export type ClassicCategoryCode = {
  [key: number]: string;
};

export const CLASSIC_CATEGORY_CODE: ClassicCategoryCode = {
  1000: 'classic_west',
  2000: 'classic_east',
  3000: 'classic_east_west',
  4000: 'classic_science',
};
export const COURSE_LIST = [
  {
    id: '009352-001',
    school: '대양휴머니티칼리지',
    name: '사고와표현1',
  },
  {
    id: '009352-002',
    school: '대양휴머니티칼리지',
    name: '사고와표현1',
  },
  {
    id: '009352-003',
    school: '대양휴머니티칼리지',
    name: '사고와표현1',
  },
  {
    id: '009352-004',
    school: '대양휴머니티칼리지',
    name: '사고와표현1',
  },
  {
    id: '009352-005',
    school: '대양휴머니티칼리지',
    name: '사고와표현1',
  },
  {
    id: '009352-006',
    school: '대양휴머니티칼리지',
    name: '사고와표현1',
  },
  {
    id: '009352-007',
    school: '대양휴머니티칼리지',
    name: '사고와표현1',
  },
  {
    id: '009353-001',
    school: '대양휴머니티칼리지',
    name: '사고와표현2',
  },
  {
    id: '009353-002',
    school: '대양휴머니티칼리지',
    name: '사고와표현2',
  },
  {
    id: '009353-003',
    school: '대양휴머니티칼리지',
    name: '사고와표현2',
  },
  {
    id: '009353-004',
    school: '대양휴머니티칼리지',
    name: '사고와표현2',
  },
  {
    id: '009353-005',
    school: '대양휴머니티칼리지',
    name: '사고와표현2',
  },
  {
    id: '009353-006',
    school: '대양휴머니티칼리지',
    name: '사고와표현2',
  },
  {
    id: '009354-001',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화1',
  },
  {
    id: '009354-002',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화1',
  },
  {
    id: '009354-003',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화1',
  },
  {
    id: '009354-004',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화1',
  },
  {
    id: '009354-005',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화1',
  },
  {
    id: '009354-006',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화1',
  },
  {
    id: '009354-007',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화1',
  },
  {
    id: '009355-001',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화2',
  },
  {
    id: '009355-002',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화2',
  },
  {
    id: '009355-003',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화2',
  },
  {
    id: '009355-004',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화2',
  },
  {
    id: '009355-005',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화2',
  },
  {
    id: '009355-006',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화2',
  },
  {
    id: '009355-007',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화2',
  },
  {
    id: '009356-001',
    school: '대양휴머니티칼리지',
    name: '한국전통문화의이해',
  },
  {
    id: '009356-002',
    school: '대양휴머니티칼리지',
    name: '한국전통문화의이해',
  },
  {
    id: '009356-003',
    school: '대양휴머니티칼리지',
    name: '한국전통문화의이해',
  },
  {
    id: '009356-004',
    school: '대양휴머니티칼리지',
    name: '한국전통문화의이해',
  },
  {
    id: '009357-001',
    school: '대양휴머니티칼리지',
    name: '서양철학의이해',
  },
  {
    id: '009357-002',
    school: '대양휴머니티칼리지',
    name: '서양철학의이해',
  },
  {
    id: '009357-003',
    school: '대양휴머니티칼리지',
    name: '서양철학의이해',
  },
  {
    id: '009045-001',
    school: '대양휴머니티칼리지',
    name: '창업과기업가정신1',
  },
  {
    id: '009045-002',
    school: '대양휴머니티칼리지',
    name: '창업과기업가정신1',
  },
  {
    id: '009045-003',
    school: '대양휴머니티칼리지',
    name: '창업과기업가정신1',
  },
  {
    id: '009045-004',
    school: '대양휴머니티칼리지',
    name: '창업과기업가정신1',
  },
  {
    id: '009067-001',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-002',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-003',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-004',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-005',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-006',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-007',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-008',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-009',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-010',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-011',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-012',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-013',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-014',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-015',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-016',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-017',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-018',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-019',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-020',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-021',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-022',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-023',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-024',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-025',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-026',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-027',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-028',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-029',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-030',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-031',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-032',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-033',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-034',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-035',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-036',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-037',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009068-001',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-002',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-003',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-004',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-005',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-006',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-007',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-008',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-009',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-010',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-011',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-012',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-013',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-014',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-015',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-016',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-017',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-018',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-019',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-020',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-021',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-022',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-023',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-024',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-025',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-026',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-027',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-028',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-029',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-030',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-031',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-032',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-033',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-034',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-035',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-036',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-037',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-038',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-039',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-040',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '011238-001',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011238-002',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011238-003',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011238-004',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011238-005',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011238-006',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011238-007',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011304-001',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-002',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-003',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-004',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-005',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-006',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-007',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-008',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-009',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-010',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-011',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-012',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-013',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-014',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-015',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-016',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-017',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-018',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-019',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-020',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-021',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-022',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-023',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-024',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-025',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-026',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-027',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-028',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-029',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-030',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-031',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-032',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-033',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-034',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-035',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-036',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-037',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-038',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-039',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-040',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-041',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-042',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-043',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-044',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-045',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-046',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-047',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-048',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-049',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-050',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-051',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-052',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-053',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-054',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-055',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-056',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-057',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-058',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-059',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-060',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-061',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-062',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-063',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-064',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-065',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '006937-001',
    school: '대양휴머니티칼리지',
    name: '한국현대사',
  },
  {
    id: '011305-001',
    school: '대양휴머니티칼리지',
    name: '동서양의사상과윤리',
  },
  {
    id: '011305-002',
    school: '대양휴머니티칼리지',
    name: '동서양의사상과윤리',
  },
  {
    id: '011306-001',
    school: '대양휴머니티칼리지',
    name: '성서와기독교',
  },
  {
    id: '011307-001',
    school: '대양휴머니티칼리지',
    name: '세계사',
  },
  {
    id: '011308-001',
    school: '대양휴머니티칼리지',
    name: '생명과학의이해',
  },
  {
    id: '011308-002',
    school: '대양휴머니티칼리지',
    name: '생명과학의이해',
  },
  {
    id: '011309-001',
    school: '대양휴머니티칼리지',
    name: '수의세계',
  },
  {
    id: '011310-001',
    school: '대양휴머니티칼리지',
    name: '지구환경과기후변화',
  },
  {
    id: '011311-001',
    school: '대양휴머니티칼리지',
    name: '현대과학으로의초대',
  },
  {
    id: '011312-001',
    school: '대양휴머니티칼리지',
    name: '경영학',
  },
  {
    id: '011313-001',
    school: '대양휴머니티칼리지',
    name: '경제학',
  },
  {
    id: '011314-001',
    school: '대양휴머니티칼리지',
    name: '미디어빅뱅과방송',
  },
  {
    id: '011315-001',
    school: '대양휴머니티칼리지',
    name: '현대사회와법',
  },
  {
    id: '011316-001',
    school: '대양휴머니티칼리지',
    name: '융합예술의이해',
  },
  {
    id: '011317-001',
    school: '대양휴머니티칼리지',
    name: '컴퓨터게임과메타버스',
  },
  {
    id: '011318-001',
    school: '대양휴머니티칼리지',
    name: '한국의문화와한류',
  },
  {
    id: '011319-001',
    school: '대양휴머니티칼리지',
    name: '현대예술의이해',
  },
  {
    id: '001357-001',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001362-001',
    school: '대양휴머니티칼리지',
    name: '미적분학2',
  },
  {
    id: '001362-002',
    school: '대양휴머니티칼리지',
    name: '미적분학2',
  },
  {
    id: '001362-003',
    school: '대양휴머니티칼리지',
    name: '미적분학2',
  },
  {
    id: '001362-004',
    school: '대양휴머니티칼리지',
    name: '미적분학2',
  },
  {
    id: '001362-005',
    school: '대양휴머니티칼리지',
    name: '미적분학2',
  },
  {
    id: '001362-006',
    school: '대양휴머니티칼리지',
    name: '미적분학2',
  },
  {
    id: '001362-007',
    school: '대양휴머니티칼리지',
    name: '미적분학2',
  },
  {
    id: '001362-008',
    school: '대양휴머니티칼리지',
    name: '미적분학2',
  },
  {
    id: '001362-009',
    school: '대양휴머니티칼리지',
    name: '미적분학2',
  },
  {
    id: '001362-010',
    school: '대양휴머니티칼리지',
    name: '미적분학2',
  },
  {
    id: '002638-001',
    school: '대양휴머니티칼리지',
    name: '일반물리학1',
  },
  {
    id: '002638-002',
    school: '대양휴머니티칼리지',
    name: '일반물리학1',
  },
  {
    id: '002641-001',
    school: '대양휴머니티칼리지',
    name: '일반물리학2',
  },
  {
    id: '002641-002',
    school: '대양휴머니티칼리지',
    name: '일반물리학2',
  },
  {
    id: '002641-003',
    school: '대양휴머니티칼리지',
    name: '일반물리학2',
  },
  {
    id: '002657-001',
    school: '대양휴머니티칼리지',
    name: '일반생물학',
  },
  {
    id: '002657-002',
    school: '대양휴머니티칼리지',
    name: '일반생물학',
  },
  {
    id: '002705-001',
    school: '대양휴머니티칼리지',
    name: '일반화학1',
  },
  {
    id: '002705-002',
    school: '대양휴머니티칼리지',
    name: '일반화학1',
  },
  {
    id: '011297-001',
    school: '대양휴머니티칼리지',
    name: '컴퓨터사고기반기초코딩',
  },
  {
    id: '011298-001',
    school: '대양휴머니티칼리지',
    name: 'SW기초코딩',
  },
  {
    id: '011298-002',
    school: '대양휴머니티칼리지',
    name: 'SW기초코딩',
  },
  {
    id: '011298-003',
    school: '대양휴머니티칼리지',
    name: 'SW기초코딩',
  },
  {
    id: '011299-001',
    school: '대양휴머니티칼리지',
    name: '프로그래밍활용-C',
  },
  {
    id: '011299-002',
    school: '대양휴머니티칼리지',
    name: '프로그래밍활용-C',
  },
  {
    id: '011300-001',
    school: '대양휴머니티칼리지',
    name: '고급프로그래밍활용',
  },
  {
    id: '011300-002',
    school: '대양휴머니티칼리지',
    name: '고급프로그래밍활용',
  },
  {
    id: '011300-003',
    school: '대양휴머니티칼리지',
    name: '고급프로그래밍활용',
  },
  {
    id: '011300-004',
    school: '대양휴머니티칼리지',
    name: '고급프로그래밍활용',
  },
  {
    id: '011300-005',
    school: '대양휴머니티칼리지',
    name: '고급프로그래밍활용',
  },
  {
    id: '011301-001',
    school: '대양휴머니티칼리지',
    name: '프로그래밍활용-P',
  },
  {
    id: '011301-002',
    school: '대양휴머니티칼리지',
    name: '프로그래밍활용-P',
  },
  {
    id: '011320-001',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-002',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-003',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-004',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-005',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-006',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-007',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011526-001',
    school: '대양휴머니티칼리지',
    name: '사회과학수학',
  },
  {
    id: '011526-002',
    school: '대양휴머니티칼리지',
    name: '사회과학수학',
  },
  {
    id: '011526-003',
    school: '대양휴머니티칼리지',
    name: '사회과학수학',
  },
  {
    id: '011526-004',
    school: '대양휴머니티칼리지',
    name: '사회과학수학',
  },
  {
    id: '011526-005',
    school: '대양휴머니티칼리지',
    name: '사회과학수학',
  },
  {
    id: '011526-006',
    school: '대양휴머니티칼리지',
    name: '사회과학수학',
  },
  {
    id: '004489-001',
    school: '대양휴머니티칼리지',
    name: '한국의전통과문화',
  },
  {
    id: '004627-001',
    school: '대양휴머니티칼리지',
    name: '채플2',
  },
  {
    id: '004794-001',
    school: '대양휴머니티칼리지',
    name: '채플4',
  },
  {
    id: '006270-001',
    school: '대양휴머니티칼리지',
    name: '동양의철학사상',
  },
  {
    id: '006279-001',
    school: '대양휴머니티칼리지',
    name: '정보사회의사이버윤리',
  },
  {
    id: '007210-001',
    school: '대양휴머니티칼리지',
    name: '역사와한국의영토',
  },
  {
    id: '007563-001',
    school: '대양휴머니티칼리지',
    name: '현대인과기독교',
  },
  {
    id: '007731-001',
    school: '대양휴머니티칼리지',
    name: '철학과인간이해',
  },
  {
    id: '008381-001',
    school: '대양휴머니티칼리지',
    name: '세종리더십',
  },
  {
    id: '008381-002',
    school: '대양휴머니티칼리지',
    name: '세종리더십',
  },
  {
    id: '008882-001',
    school: '대양휴머니티칼리지',
    name: '동서양의윤리',
  },
  {
    id: '008932-001',
    school: '대양휴머니티칼리지',
    name: '동양고전강독2',
  },
  {
    id: '008932-002',
    school: '대양휴머니티칼리지',
    name: '동양고전강독2',
  },
  {
    id: '008932-003',
    school: '대양휴머니티칼리지',
    name: '동양고전강독2',
  },
  {
    id: '008933-001',
    school: '대양휴머니티칼리지',
    name: '서양고전강독2',
  },
  {
    id: '008933-002',
    school: '대양휴머니티칼리지',
    name: '서양고전강독2',
  },
  {
    id: '008933-003',
    school: '대양휴머니티칼리지',
    name: '서양고전강독2',
  },
  {
    id: '008934-001',
    school: '대양휴머니티칼리지',
    name: '인류학과현대사회',
  },
  {
    id: '009031-001',
    school: '대양휴머니티칼리지',
    name: '한국현대사의이해',
  },
  {
    id: '009031-002',
    school: '대양휴머니티칼리지',
    name: '한국현대사의이해',
  },
  {
    id: '009033-001',
    school: '대양휴머니티칼리지',
    name: '독서토론',
  },
  {
    id: '009058-001',
    school: '대양휴머니티칼리지',
    name: '서양고전강독4',
  },
  {
    id: '009058-002',
    school: '대양휴머니티칼리지',
    name: '서양고전강독4',
  },
  {
    id: '009775-001',
    school: '대양휴머니티칼리지',
    name: '동양종교의이해',
  },
  {
    id: '009776-001',
    school: '대양휴머니티칼리지',
    name: '동양의철학사상-공맹과성리학',
  },
  {
    id: '009777-001',
    school: '대양휴머니티칼리지',
    name: '동양고전과기업경영',
  },
  {
    id: '009938-001',
    school: '대양휴머니티칼리지',
    name: '동서양고전문학강독',
  },
  {
    id: '009938-002',
    school: '대양휴머니티칼리지',
    name: '동서양고전문학강독',
  },
  {
    id: '009938-003',
    school: '대양휴머니티칼리지',
    name: '동서양고전문학강독',
  },
  {
    id: '010357-001',
    school: '대양휴머니티칼리지',
    name: '수요집현강좌',
  },
  {
    id: '010427-001',
    school: '대양휴머니티칼리지',
    name: 'SHP고전강좌:Reading Intellectus 2',
  },
  {
    id: '010541-001',
    school: '대양휴머니티칼리지',
    name: 'SHP고전강좌:Writing Intellectus 2',
  },
  {
    id: '010663-001',
    school: '대양휴머니티칼리지',
    name: 'SHP고전강좌:Building Intellectus 2',
  },
  {
    id: '011878-001',
    school: '대양휴머니티칼리지',
    name: '역사속의기독교',
  },
  {
    id: '002074-001',
    school: '대양휴머니티칼리지',
    name: '여성학',
  },
  {
    id: '004626-001',
    school: '대양휴머니티칼리지',
    name: '미래사회와사회변동',
  },
  {
    id: '004630-001',
    school: '대양휴머니티칼리지',
    name: '정보사회와정보이용',
  },
  {
    id: '004798-001',
    school: '대양휴머니티칼리지',
    name: '세계경제의이해',
  },
  {
    id: '005192-001',
    school: '대양휴머니티칼리지',
    name: '생활속의마케팅이해',
  },
  {
    id: '005991-001',
    school: '대양휴머니티칼리지',
    name: '스피치커뮤니케이션',
  },
  {
    id: '005991-002',
    school: '대양휴머니티칼리지',
    name: '스피치커뮤니케이션',
  },
  {
    id: '006277-001',
    school: '대양휴머니티칼리지',
    name: '한국사회와여성문제',
  },
  {
    id: '006422-001',
    school: '대양휴머니티칼리지',
    name: '성과문화',
  },
  {
    id: '006422-002',
    school: '대양휴머니티칼리지',
    name: '성과문화',
  },
  {
    id: '007345-001',
    school: '대양휴머니티칼리지',
    name: '미술심리치료',
  },
  {
    id: '007345-002',
    school: '대양휴머니티칼리지',
    name: '미술심리치료',
  },
  {
    id: '007565-001',
    school: '대양휴머니티칼리지',
    name: '우리차문화의이해',
  },
  {
    id: '007565-002',
    school: '대양휴머니티칼리지',
    name: '우리차문화의이해',
  },
  {
    id: '007565-003',
    school: '대양휴머니티칼리지',
    name: '우리차문화의이해',
  },
  {
    id: '007565-004',
    school: '대양휴머니티칼리지',
    name: '우리차문화의이해',
  },
  {
    id: '007565-005',
    school: '대양휴머니티칼리지',
    name: '우리차문화의이해',
  },
  {
    id: '007779-001',
    school: '대양휴머니티칼리지',
    name: '현대인의정신건강과자기발견',
  },
  {
    id: '008884-001',
    school: '대양휴머니티칼리지',
    name: '국가와정체성',
  },
  {
    id: '009251-001',
    school: '대양휴머니티칼리지',
    name: '중급미술심리치료',
  },
  {
    id: '009252-001',
    school: '대양휴머니티칼리지',
    name: '영상스토리텔링',
  },
  {
    id: '009455-001',
    school: '대양휴머니티칼리지',
    name: '경제학의이해',
  },
  {
    id: '009739-001',
    school: '대양휴머니티칼리지',
    name: '복지국가의이해',
  },
  {
    id: '009785-001',
    school: '대양휴머니티칼리지',
    name: '공간마케팅',
  },
  {
    id: '010356-001',
    school: '대양휴머니티칼리지',
    name: '대학생을위한실용금융',
  },
  {
    id: '010358-001',
    school: '대양휴머니티칼리지',
    name: '행복한가정만들기',
  },
  {
    id: '010412-001',
    school: '대양휴머니티칼리지',
    name: 'K-MOOC:콘텐츠산업의비즈니스전략',
  },
  {
    id: '010667-001',
    school: '대양휴머니티칼리지',
    name: '인문지리학의이해',
  },
  {
    id: '010797-001',
    school: '대양휴머니티칼리지',
    name: '융합적사고에기반한인문사회계글쓰기',
  },
  {
    id: '010801-001',
    school: '대양휴머니티칼리지',
    name: '영화산업의이해',
  },
  {
    id: '011258-001',
    school: '대양휴머니티칼리지',
    name: '미디어속한국문화 ',
  },
  {
    id: '011415-001',
    school: '대양휴머니티칼리지',
    name: '인간과도시,부동산',
  },
  {
    id: '009035-001',
    school: '대양휴머니티칼리지',
    name: '창업의이론과실제',
  },
  {
    id: '004763-001',
    school: '대양휴머니티칼리지',
    name: '과학사',
  },
  {
    id: '004763-002',
    school: '대양휴머니티칼리지',
    name: '과학사',
  },
  {
    id: '004763-003',
    school: '대양휴머니티칼리지',
    name: '과학사',
  },
  {
    id: '005537-001',
    school: '대양휴머니티칼리지',
    name: '지구탐사',
  },
  {
    id: '006846-001',
    school: '대양휴머니티칼리지',
    name: '지구환경과학입문',
  },
  {
    id: '008885-001',
    school: '대양휴머니티칼리지',
    name: '과학기술과사회',
  },
  {
    id: '008890-001',
    school: '대양휴머니티칼리지',
    name: '천문학의세계',
  },
  {
    id: '008890-002',
    school: '대양휴머니티칼리지',
    name: '천문학의세계',
  },
  {
    id: '008939-001',
    school: '대양휴머니티칼리지',
    name: '지구의이해',
  },
  {
    id: '009936-001',
    school: '대양휴머니티칼리지',
    name: 'Technical Writing기초',
  },
  {
    id: '009936-002',
    school: '대양휴머니티칼리지',
    name: 'Technical Writing기초',
  },
  {
    id: '009936-003',
    school: '대양휴머니티칼리지',
    name: 'Technical Writing기초',
  },
  {
    id: '010136-001',
    school: '대양휴머니티칼리지',
    name: 'K-MOOC:정보보호와보안의기초',
  },
  {
    id: '010538-001',
    school: '대양휴머니티칼리지',
    name: '융합적사고',
  },
  {
    id: '010542-001',
    school: '대양휴머니티칼리지',
    name: 'K-MOOC:일반인을위한물리코딩',
  },
  {
    id: '010543-001',
    school: '대양휴머니티칼리지',
    name: 'K-MOOC:코딩과스토리텔링',
  },
  {
    id: '011412-001',
    school: '대양휴머니티칼리지',
    name: '생활속의GPS',
  },
  {
    id: '011416-001',
    school: '대양휴머니티칼리지',
    name: '생활속의물리',
  },
  {
    id: '011416-002',
    school: '대양휴머니티칼리지',
    name: '생활속의물리',
  },
  {
    id: '011616-001',
    school: '대양휴머니티칼리지',
    name: '향과학의이해',
  },
  {
    id: '011877-001',
    school: '대양휴머니티칼리지',
    name: '기계,인간,지능',
  },
  {
    id: '006215-001',
    school: '대양휴머니티칼리지',
    name: '일본어2',
  },
  {
    id: '006215-002',
    school: '대양휴머니티칼리지',
    name: '일본어2',
  },
  {
    id: '006215-003',
    school: '대양휴머니티칼리지',
    name: '일본어2',
  },
  {
    id: '006844-001',
    school: '대양휴머니티칼리지',
    name: 'Intensive English',
  },
  {
    id: '006844-002',
    school: '대양휴머니티칼리지',
    name: 'Intensive English',
  },
  {
    id: '006844-003',
    school: '대양휴머니티칼리지',
    name: 'Intensive English',
  },
  {
    id: '007207-001',
    school: '대양휴머니티칼리지',
    name: '기초중국어1',
  },
  {
    id: '007207-002',
    school: '대양휴머니티칼리지',
    name: '기초중국어1',
  },
  {
    id: '007207-003',
    school: '대양휴머니티칼리지',
    name: '기초중국어1',
  },
  {
    id: '007208-001',
    school: '대양휴머니티칼리지',
    name: '기초중국어2',
  },
  {
    id: '007211-001',
    school: '대양휴머니티칼리지',
    name: '중국문화의이해',
  },
  {
    id: '007239-001',
    school: '대양휴머니티칼리지',
    name: '글로벌잉글리쉬2',
  },
  {
    id: '007321-001',
    school: '대양휴머니티칼리지',
    name: '생활일본어',
  },
  {
    id: '007321-002',
    school: '대양휴머니티칼리지',
    name: '생활일본어',
  },
  {
    id: '007503-001',
    school: '대양휴머니티칼리지',
    name: '영어읽기연습',
  },
  {
    id: '007503-002',
    school: '대양휴머니티칼리지',
    name: '영어읽기연습',
  },
  {
    id: '007504-001',
    school: '대양휴머니티칼리지',
    name: '영어듣기연습',
  },
  {
    id: '007504-002',
    school: '대양휴머니티칼리지',
    name: '영어듣기연습',
  },
  {
    id: '007504-003',
    school: '대양휴머니티칼리지',
    name: '영어듣기연습',
  },
  {
    id: '007504-004',
    school: '대양휴머니티칼리지',
    name: '영어듣기연습',
  },
  {
    id: '007744-001',
    school: '대양휴머니티칼리지',
    name: '인도의정치경제와사회',
  },
  {
    id: '007761-001',
    school: '대양휴머니티칼리지',
    name: '동아시아와한반도',
  },
  {
    id: '009047-001',
    school: '대양휴머니티칼리지',
    name: '글로벌잉글리쉬2(진로탐색)',
  },
  {
    id: '009049-001',
    school: '대양휴머니티칼리지',
    name: '글로벌잉글리쉬2(심화)',
  },
  {
    id: '009049-002',
    school: '대양휴머니티칼리지',
    name: '글로벌잉글리쉬2(심화)',
  },
  {
    id: '009346-001',
    school: '대양휴머니티칼리지',
    name: 'English Speaking Strategies(O) 2',
  },
  {
    id: '009346-002',
    school: '대양휴머니티칼리지',
    name: 'English Speaking Strategies(O) 2',
  },
  {
    id: '009981-001',
    school: '대양휴머니티칼리지',
    name: 'English Listening',
  },
  {
    id: '009982-001',
    school: '대양휴머니티칼리지',
    name: 'English Reading',
  },
  {
    id: '010802-001',
    school: '대양휴머니티칼리지',
    name: '한류문화의이해',
  },
  {
    id: '011411-001',
    school: '대양휴머니티칼리지',
    name: '문화간커뮤니케이션',
  },
  {
    id: '011414-001',
    school: '대양휴머니티칼리지',
    name: '한국어프레젠테이션',
  },
  {
    id: '011612-001',
    school: '대양휴머니티칼리지',
    name: 'English Speaking Strategies(IS) 2',
  },
  {
    id: '011612-002',
    school: '대양휴머니티칼리지',
    name: 'English Speaking Strategies(IS) 2',
  },
  {
    id: '005824-001',
    school: '대양휴머니티칼리지',
    name: '패션과문화',
  },
  {
    id: '006286-001',
    school: '대양휴머니티칼리지',
    name: '현대인과건강관리',
  },
  {
    id: '006538-001',
    school: '대양휴머니티칼리지',
    name: '현대사회와스포츠',
  },
  {
    id: '007771-001',
    school: '대양휴머니티칼리지',
    name: '교양스키',
  },
  {
    id: '007772-001',
    school: '대양휴머니티칼리지',
    name: '교양배드민턴',
  },
  {
    id: '009061-001',
    school: '대양휴머니티칼리지',
    name: '웰빙레저스포츠',
  },
  {
    id: '009261-001',
    school: '대양휴머니티칼리지',
    name: 'K-Pop Music 2',
  },
  {
    id: '009261-002',
    school: '대양휴머니티칼리지',
    name: 'K-Pop Music 2',
  },
  {
    id: '009268-001',
    school: '대양휴머니티칼리지',
    name: 'K-Pop Dance 2',
  },
  {
    id: '009268-002',
    school: '대양휴머니티칼리지',
    name: 'K-Pop Dance 2',
  },
  {
    id: '009453-001',
    school: '대양휴머니티칼리지',
    name: '보컬트레이닝',
  },
  {
    id: '009937-001',
    school: '대양휴머니티칼리지',
    name: '공간과인간:인문,예술,공학의융합',
  },
  {
    id: '009937-002',
    school: '대양휴머니티칼리지',
    name: '공간과인간:인문,예술,공학의융합',
  },
  {
    id: '010410-001',
    school: '대양휴머니티칼리지',
    name: 'K-MOOC:웨어러블컴퓨터디자인',
  },
  {
    id: '010410-002',
    school: '대양휴머니티칼리지',
    name: 'K-MOOC:웨어러블컴퓨터디자인',
  },
  {
    id: '010666-001',
    school: '대양휴머니티칼리지',
    name: '세종인을위한오케스트라첫걸음',
  },
  {
    id: '011324-001',
    school: '대양휴머니티칼리지',
    name: 'K-MOOC:인공지능콘텐츠아트프로듀싱',
  },
  {
    id: '007082-001',
    school: '대양휴머니티칼리지',
    name: '취업과진로',
  },
  {
    id: '007221-001',
    school: '대양휴머니티칼리지',
    name: '진로설정과자기계발',
  },
  {
    id: '008364-001',
    school: '대양휴머니티칼리지',
    name: '세종사회봉사1',
  },
  {
    id: '008364-002',
    school: '대양휴머니티칼리지',
    name: '세종사회봉사1',
  },
  {
    id: '008364-003',
    school: '대양휴머니티칼리지',
    name: '세종사회봉사1',
  },
  {
    id: '008365-001',
    school: '대양휴머니티칼리지',
    name: '세종사회봉사2',
  },
  {
    id: '008365-002',
    school: '대양휴머니티칼리지',
    name: '세종사회봉사2',
  },
  {
    id: '010083-001',
    school: '대양휴머니티칼리지',
    name: '취업전략및사회진출',
  },
  {
    id: '010083-002',
    school: '대양휴머니티칼리지',
    name: '취업전략및사회진출',
  },
  {
    id: '010651-001',
    school: '대양휴머니티칼리지',
    name: '진로오딧세이',
  },
  {
    id: '501269-001',
    school: '대양휴머니티칼리지',
    name: '역사속현자들의리더십이야기',
  },
  {
    id: '501320-001',
    school: '대양휴머니티칼리지',
    name: '동양의학(전통의학으로의여행)',
  },
  {
    id: '501350-001',
    school: '대양휴머니티칼리지',
    name: '나를위한커리어코칭',
  },
  {
    id: '501354-001',
    school: '대양휴머니티칼리지',
    name: '설득력있는프레젠테이션',
  },
  {
    id: '501355-001',
    school: '대양휴머니티칼리지',
    name: '예술,역사를만나다-근대와모던',
  },
  {
    id: '501360-001',
    school: '대양휴머니티칼리지',
    name: '재미있는인공지능속세상여행',
  },
  {
    id: '010418-001',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-002',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-003',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-004',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-005',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-006',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-007',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-008',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-009',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-010',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-011',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-012',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-013',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-014',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-015',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-016',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-017',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-018',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-019',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-020',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-021',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-022',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-023',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-024',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-025',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-026',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-027',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-028',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-029',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-030',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010419-001',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-002',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-003',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-004',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-005',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-006',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-007',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-008',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-009',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-010',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-011',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-012',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-013',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-014',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-015',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010420-001',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010420-002',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010420-004',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010420-005',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010420-006',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010420-007',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010420-008',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010420-009',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010420-010',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010420-011',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010421-001',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅳ',
  },
  {
    id: '010421-002',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅳ',
  },
  {
    id: '010421-003',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅳ',
  },
  {
    id: '010421-004',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅳ',
  },
  {
    id: '010421-005',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅳ',
  },
  {
    id: '007745-001',
    school: '대양휴머니티칼리지',
    name: '교직소양을위한독서강좌2',
  },
  {
    id: '008335-001',
    school: '대양휴머니티칼리지',
    name: '교육봉사활동2',
  },
  {
    id: '008336-001',
    school: '대양휴머니티칼리지',
    name: '교육봉사활동3',
  },
  {
    id: '000307-001',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-002',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-003',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-004',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-005',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-006',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-007',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-008',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-009',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-010',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-011',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '003353-001',
    school: '대양휴머니티칼리지',
    name: '통계학개론',
  },
  {
    id: '003353-002',
    school: '대양휴머니티칼리지',
    name: '통계학개론',
  },
  {
    id: '003353-003',
    school: '대양휴머니티칼리지',
    name: '통계학개론',
  },
  {
    id: '011320-008',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-009',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-010',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-011',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-012',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-013',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-014',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-015',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011321-001',
    school: '대양휴머니티칼리지',
    name: '인공지능활용',
  },
  {
    id: '011321-002',
    school: '대양휴머니티칼리지',
    name: '인공지능활용',
  },
  {
    id: '011322-001',
    school: '대양휴머니티칼리지',
    name: '고급인공지능활용',
  },
  {
    id: '011322-002',
    school: '대양휴머니티칼리지',
    name: '고급인공지능활용',
  },
  {
    id: '011322-003',
    school: '대양휴머니티칼리지',
    name: '고급인공지능활용',
  },
  {
    id: '009489-001',
    school: '대양휴머니티칼리지',
    name: '세계사:인간과문명',
  },
  {
    id: '009489-002',
    school: '대양휴머니티칼리지',
    name: '세계사:인간과문명',
  },
  {
    id: '009489-003',
    school: '대양휴머니티칼리지',
    name: '세계사:인간과문명',
  },
  {
    id: '009489-004',
    school: '대양휴머니티칼리지',
    name: '세계사:인간과문명',
  },
  {
    id: '009034-001',
    school: '대양휴머니티칼리지',
    name: '디자인이노베이션',
  },
  {
    id: '000496-001',
    school: '대양휴머니티칼리지',
    name: '교육심리',
  },
  {
    id: '000496-002',
    school: '대양휴머니티칼리지',
    name: '교육심리',
  },
  {
    id: '000512-001',
    school: '대양휴머니티칼리지',
    name: '교육철학및교육사',
  },
  {
    id: '000512-002',
    school: '대양휴머니티칼리지',
    name: '교육철학및교육사',
  },
  {
    id: '011183-001',
    school: '대양휴머니티칼리지',
    name: '취창업과진로설계',
  },
  {
    id: '011183-002',
    school: '대양휴머니티칼리지',
    name: '취창업과진로설계',
  },
  {
    id: '011183-003',
    school: '대양휴머니티칼리지',
    name: '취창업과진로설계',
  },
  {
    id: '011183-004',
    school: '대양휴머니티칼리지',
    name: '취창업과진로설계',
  },
  {
    id: '011183-005',
    school: '대양휴머니티칼리지',
    name: '취창업과진로설계',
  },
  {
    id: '000476-001',
    school: '대양휴머니티칼리지',
    name: '교육방법및교육공학',
  },
  {
    id: '000476-002',
    school: '대양휴머니티칼리지',
    name: '교육방법및교육공학',
  },
  {
    id: '008337-001',
    school: '대양휴머니티칼리지',
    name: '특수교육학개론',
  },
  {
    id: '008337-002',
    school: '대양휴머니티칼리지',
    name: '특수교육학개론',
  },
  {
    id: '010534-001',
    school: '대양휴머니티칼리지',
    name: '학교폭력예방및학생의이해',
  },
  {
    id: '010534-002',
    school: '대양휴머니티칼리지',
    name: '학교폭력예방및학생의이해',
  },
  {
    id: '010654-001',
    school: '대양휴머니티칼리지',
    name: '안전및조직관리사례연구',
  },
  {
    id: '010352-001',
    school: '대양휴머니티칼리지',
    name: 'English Listening Practice 1',
  },
  {
    id: '010352-002',
    school: '대양휴머니티칼리지',
    name: 'English Listening Practice 1',
  },
  {
    id: '010352-003',
    school: '대양휴머니티칼리지',
    name: 'English Listening Practice 1',
  },
  {
    id: '010352-004',
    school: '대양휴머니티칼리지',
    name: 'English Listening Practice 1',
  },
  {
    id: '010354-001',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-002',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-003',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-004',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-005',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-006',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-007',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-008',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-009',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-010',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-011',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-012',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-013',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-014',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '009780-001',
    school: '대양휴머니티칼리지',
    name: '고전특강',
  },
  {
    id: '009780-002',
    school: '대양휴머니티칼리지',
    name: '고전특강',
  },
  {
    id: '009780-003',
    school: '대양휴머니티칼리지',
    name: '고전특강',
  },
  {
    id: '009780-004',
    school: '대양휴머니티칼리지',
    name: '고전특강',
  },
  {
    id: '009780-005',
    school: '대양휴머니티칼리지',
    name: '고전특강',
  },
  {
    id: '000534-001',
    school: '대양휴머니티칼리지',
    name: '교육행정및교육경영',
  },
  {
    id: '010656-001',
    school: '대양휴머니티칼리지',
    name: '조직리더십사례연구',
  },
  {
    id: '011839-001',
    school: '인문과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '000607-001',
    school: '인문과학대학',
    name: '국어학개론',
  },
  {
    id: '010436-001',
    school: '인문과학대학',
    name: '국어어문생활의실제',
  },
  {
    id: '003727-001',
    school: '인문과학대학',
    name: '향가여요론',
  },
  {
    id: '008369-001',
    school: '인문과학대학',
    name: '한국근대소설론',
  },
  {
    id: '008484-001',
    school: '인문과학대학',
    name: '한국문학과영상문화',
  },
  {
    id: '007946-001',
    school: '인문과학대학',
    name: '한국고전소설론',
  },
  {
    id: '007947-001',
    school: '인문과학대학',
    name: '한국현대희곡론',
  },
  {
    id: '008232-001',
    school: '인문과학대학',
    name: '국어교과교재연구및지도법',
  },
  {
    id: '008317-001',
    school: '인문과학대학',
    name: '국어논리및논술',
  },
  {
    id: '008368-001',
    school: '인문과학대학',
    name: '한국문화와한국어교육',
  },
  {
    id: '008490-001',
    school: '인문과학대학',
    name: '한국문학의역사',
  },
  {
    id: '010112-001',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010437-001',
    school: '인문과학대학',
    name: '국어화용론',
  },
  {
    id: '011839-001',
    school: '인문과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '인문과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-003',
    school: '인문과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '008739-001',
    school: '인문과학대학',
    name: '현대중국의이해',
  },
  {
    id: '009611-001',
    school: '인문과학대학',
    name: '초급중국어',
  },
  {
    id: '009611-002',
    school: '인문과학대학',
    name: '초급중국어',
  },
  {
    id: '011630-001',
    school: '인문과학대학',
    name: '일본문화의이해',
  },
  {
    id: '011640-001',
    school: '인문과학대학',
    name: '초급일본어2',
  },
  {
    id: '011640-002',
    school: '인문과학대학',
    name: '초급일본어2',
  },
  {
    id: '011774-001',
    school: '인문과학대학',
    name: '미래사회와언어데이터',
  },
  {
    id: '011777-001',
    school: '인문과학대학',
    name: '언어와문화의번역',
  },
  {
    id: '007774-001',
    school: '인문과학대학',
    name: '영어어휘와발음',
  },
  {
    id: '002161-001',
    school: '인문과학대학',
    name: '영미단편소설',
  },
  {
    id: '006554-001',
    school: '인문과학대학',
    name: '국제업무와영어',
  },
  {
    id: '007649-001',
    school: '인문과학대학',
    name: '현대사회와영어',
  },
  {
    id: '007777-001',
    school: '인문과학대학',
    name: '영어토론과발표',
  },
  {
    id: '002238-001',
    school: '인문과학대학',
    name: '영어통사론',
  },
  {
    id: '002238-002',
    school: '인문과학대학',
    name: '영어통사론',
  },
  {
    id: '007927-001',
    school: '인문과학대학',
    name: '미국사회와문학',
  },
  {
    id: '008233-001',
    school: '인문과학대학',
    name: '영어교과교재연구및지도법',
  },
  {
    id: '008318-001',
    school: '인문과학대학',
    name: '영어논리및논술',
  },
  {
    id: '007932-001',
    school: '인문과학대학',
    name: '영미명작의세계',
  },
  {
    id: '010112-001',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010377-001',
    school: '인문과학대학',
    name: '일본어회화',
  },
  {
    id: '011619-001',
    school: '인문과학대학',
    name: '고급일본어',
  },
  {
    id: '011626-001',
    school: '인문과학대학',
    name: '일본문장리터러시',
  },
  {
    id: '009087-001',
    school: '인문과학대학',
    name: '일문학과역사',
  },
  {
    id: '009091-001',
    school: '인문과학대학',
    name: '일본지역연구',
  },
  {
    id: '009091-002',
    school: '인문과학대학',
    name: '일본지역연구',
  },
  {
    id: '008319-001',
    school: '인문과학대학',
    name: '일본어논리및논술',
  },
  {
    id: '011637-001',
    school: '인문과학대학',
    name: '일본의현대문학',
  },
  {
    id: '006408-001',
    school: '인문과학대학',
    name: '일본어능력시험',
  },
  {
    id: '008402-001',
    school: '인문과학대학',
    name: '한일비교문화론',
  },
  {
    id: '008402-002',
    school: '인문과학대학',
    name: '한일비교문화론',
  },
  {
    id: '010112-001',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010384-001',
    school: '인문과학대학',
    name: '일본어교육론',
  },
  {
    id: '008742-001',
    school: '인문과학대학',
    name: '국제통상개론',
  },
  {
    id: '007751-001',
    school: '인문과학대학',
    name: '중급중국어2',
  },
  {
    id: '009498-001',
    school: '인문과학대학',
    name: '중급중국어연습2',
  },
  {
    id: '008758-001',
    school: '인문과학대학',
    name: '중국어능력시험',
  },
  {
    id: '009506-001',
    school: '인문과학대학',
    name: '중국문학과문화',
  },
  {
    id: '010520-001',
    school: '인문과학대학',
    name: '중한회화연습2',
  },
  {
    id: '010390-001',
    school: '인문과학대학',
    name: '무역실무와e트레이드',
  },
  {
    id: '009505-001',
    school: '인문과학대학',
    name: '중국과세계',
  },
  {
    id: '010112-001',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010525-001',
    school: '인문과학대학',
    name: '통상회화연습',
  },
  {
    id: '010526-001',
    school: '인문과학대학',
    name: '동아시아산업과금융',
  },
  {
    id: '011839-001',
    school: '인문과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '009806-001',
    school: '인문과학대학',
    name: '문화유적현장실습1',
  },
  {
    id: '005845-001',
    school: '인문과학대학',
    name: '한국의문화유산',
  },
  {
    id: '011671-001',
    school: '인문과학대학',
    name: '세계사속의한국사',
  },
  {
    id: '009807-001',
    school: '인문과학대학',
    name: '문화유적현장실습2',
  },
  {
    id: '001690-001',
    school: '인문과학대학',
    name: '서양중세사',
  },
  {
    id: '003608-001',
    school: '인문과학대학',
    name: '한국중세사',
  },
  {
    id: '010806-001',
    school: '인문과학대학',
    name: '동아시아중세사',
  },
  {
    id: '009808-001',
    school: '인문과학대학',
    name: '문화유적현장실습3',
  },
  {
    id: '010256-001',
    school: '인문과학대학',
    name: '한국근대사',
  },
  {
    id: '008236-001',
    school: '인문과학대학',
    name: '역사교과교재연구및지도법',
  },
  {
    id: '010254-001',
    school: '인문과학대학',
    name: '서양근대사',
  },
  {
    id: '010257-001',
    school: '인문과학대학',
    name: '동아시아근대사',
  },
  {
    id: '010112-001',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010259-001',
    school: '인문과학대학',
    name: '한국사상·문화사',
  },
  {
    id: '010260-001',
    school: '인문과학대학',
    name: '20세기현대사',
  },
  {
    id: '010807-001',
    school: '인문과학대학',
    name: '서양사학사',
  },
  {
    id: '011839-001',
    school: '인문과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '005072-001',
    school: '인문과학대학',
    name: '교육행정의이론과실제',
  },
  {
    id: '005285-001',
    school: '인문과학대학',
    name: '교육공학의이론과실제',
  },
  {
    id: '005855-001',
    school: '인문과학대학',
    name: '평생교육방법론',
  },
  {
    id: '010809-001',
    school: '인문과학대학',
    name: '인공지능과학습',
  },
  {
    id: '007712-001',
    school: '인문과학대학',
    name: '교육통계',
  },
  {
    id: '000488-001',
    school: '인문과학대학',
    name: '교육사회학',
  },
  {
    id: '007713-001',
    school: '인문과학대학',
    name: '평생교육프로그램개발론',
  },
  {
    id: '007714-001',
    school: '인문과학대학',
    name: '평생교육경영론',
  },
  {
    id: '008235-001',
    school: '인문과학대학',
    name: '교육학교과교재연구및지도법',
  },
  {
    id: '008320-001',
    school: '인문과학대학',
    name: '교육학논리및논술',
  },
  {
    id: '006703-001',
    school: '인문과학대학',
    name: '심리검사',
  },
  {
    id: '007886-001',
    school: '인문과학대학',
    name: '사회조사방법론',
  },
  {
    id: '010112-001',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '인문과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '011839-001',
    school: '사회과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '사회과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '003725-001',
    school: '사회과학대학',
    name: '행정학원론',
  },
  {
    id: '003725-002',
    school: '사회과학대학',
    name: '행정학원론',
  },
  {
    id: '003736-001',
    school: '사회과학대학',
    name: '헌법학원론',
  },
  {
    id: '002873-001',
    school: '사회과학대학',
    name: '재무행정론',
  },
  {
    id: '002873-002',
    school: '사회과학대학',
    name: '재무행정론',
  },
  {
    id: '003703-001',
    school: '사회과학대학',
    name: '행정법',
  },
  {
    id: '009909-001',
    school: '사회과학대학',
    name: '조직론2',
  },
  {
    id: '009934-001',
    school: '사회과학대학',
    name: '빅데이터와행정분석',
  },
  {
    id: '009934-002',
    school: '사회과학대학',
    name: '빅데이터와행정분석',
  },
  {
    id: '011642-001',
    school: '사회과학대학',
    name: '디지털사회의NGO와시민참여',
  },
  {
    id: '011642-002',
    school: '사회과학대학',
    name: '디지털사회의NGO와시민참여',
  },
  {
    id: '011843-001',
    school: '사회과학대학',
    name: '행정통계분석(응용)',
  },
  {
    id: '011843-002',
    school: '사회과학대학',
    name: '행정통계분석(응용)',
  },
  {
    id: '000686-001',
    school: '사회과학대학',
    name: '국제행정론',
  },
  {
    id: '000822-001',
    school: '사회과학대학',
    name: '기획론',
  },
  {
    id: '003698-001',
    school: '사회과학대학',
    name: '행정관리론',
  },
  {
    id: '007182-001',
    school: '사회과학대학',
    name: '행정규제론',
  },
  {
    id: '007182-002',
    school: '사회과학대학',
    name: '행정규제론',
  },
  {
    id: '007245-001',
    school: '사회과학대학',
    name: '행정개혁론',
  },
  {
    id: '007245-002',
    school: '사회과학대학',
    name: '행정개혁론',
  },
  {
    id: '008237-001',
    school: '사회과학대학',
    name: '일반사회교과교재연구및지도법',
  },
  {
    id: '008322-001',
    school: '사회과학대학',
    name: '일반사회논리및논술',
  },
  {
    id: '011844-001',
    school: '사회과학대학',
    name: '행동경제학과공공정책',
  },
  {
    id: '000392-001',
    school: '사회과학대학',
    name: '관료제도론',
  },
  {
    id: '003623-001',
    school: '사회과학대학',
    name: '한국행정론',
  },
  {
    id: '003623-002',
    school: '사회과학대학',
    name: '한국행정론',
  },
  {
    id: '009106-001',
    school: '사회과학대학',
    name: '정책사례분석',
  },
  {
    id: '009106-002',
    school: '사회과학대학',
    name: '정책사례분석',
  },
  {
    id: '010112-001',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '011839-001',
    school: '사회과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '사회과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-003',
    school: '사회과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '008426-001',
    school: '사회과학대학',
    name: '미디어의이해',
  },
  {
    id: '008426-002',
    school: '사회과학대학',
    name: '미디어의이해',
  },
  {
    id: '008426-003',
    school: '사회과학대학',
    name: '미디어의이해',
  },
  {
    id: '011559-001',
    school: '사회과학대학',
    name: '광고PR의이해',
  },
  {
    id: '011559-002',
    school: '사회과학대학',
    name: '광고PR의이해',
  },
  {
    id: '011559-003',
    school: '사회과학대학',
    name: '광고PR의이해',
  },
  {
    id: '004659-001',
    school: '사회과학대학',
    name: '커뮤니케이션조사방법론',
  },
  {
    id: '004659-002',
    school: '사회과학대학',
    name: '커뮤니케이션조사방법론',
  },
  {
    id: '004661-001',
    school: '사회과학대학',
    name: '취재보도론',
  },
  {
    id: '004661-002',
    school: '사회과학대학',
    name: '취재보도론',
  },
  {
    id: '008428-001',
    school: '사회과학대학',
    name: 'HCI와커뮤니케이션',
  },
  {
    id: '008428-002',
    school: '사회과학대학',
    name: 'HCI와커뮤니케이션',
  },
  {
    id: '010469-001',
    school: '사회과학대학',
    name: '통합마케팅커뮤니케이션기획',
  },
  {
    id: '010469-002',
    school: '사회과학대학',
    name: '통합마케팅커뮤니케이션기획',
  },
  {
    id: '011246-001',
    school: '사회과학대학',
    name: '소셜미디어와가십',
  },
  {
    id: '006593-001',
    school: '사회과학대학',
    name: '조직커뮤니케이션',
  },
  {
    id: '006593-002',
    school: '사회과학대학',
    name: '조직커뮤니케이션',
  },
  {
    id: '007521-001',
    school: '사회과학대학',
    name: '미디어산업과정책',
  },
  {
    id: '010262-001',
    school: '사회과학대학',
    name: '뉴스큐레이션',
  },
  {
    id: '010262-002',
    school: '사회과학대학',
    name: '뉴스큐레이션',
  },
  {
    id: '010472-001',
    school: '사회과학대학',
    name: 'SNS전략커뮤니케이션',
  },
  {
    id: '010472-002',
    school: '사회과학대학',
    name: 'SNS전략커뮤니케이션',
  },
  {
    id: '006111-001',
    school: '사회과학대학',
    name: '프리젠테이션실습',
  },
  {
    id: '006111-002',
    school: '사회과학대학',
    name: '프리젠테이션실습',
  },
  {
    id: '007525-001',
    school: '사회과학대학',
    name: '매체비평론',
  },
  {
    id: '010112-001',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '사회과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010480-001',
    school: '사회과학대학',
    name: '브랜드콘텐츠제작',
  },
  {
    id: '010480-002',
    school: '사회과학대학',
    name: '브랜드콘텐츠제작',
  },
  {
    id: '011839-001',
    school: '경영경제대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '경영경제대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-003',
    school: '경영경제대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-004',
    school: '경영경제대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-005',
    school: '경영경제대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '000137-001',
    school: '경영경제대학',
    name: '경영학원론',
  },
  {
    id: '000137-002',
    school: '경영경제대학',
    name: '경영학원론',
  },
  {
    id: '000137-003',
    school: '경영경제대학',
    name: '경영학원론',
  },
  {
    id: '000137-004',
    school: '경영경제대학',
    name: '경영학원론',
  },
  {
    id: '000137-005',
    school: '경영경제대학',
    name: '경영학원론',
  },
  {
    id: '000137-006',
    school: '경영경제대학',
    name: '경영학원론',
  },
  {
    id: '000137-007',
    school: '경영경제대학',
    name: '경영학원론',
  },
  {
    id: '004008-001',
    school: '경영경제대학',
    name: '회계원리1',
  },
  {
    id: '004008-002',
    school: '경영경제대학',
    name: '회계원리1',
  },
  {
    id: '004008-003',
    school: '경영경제대학',
    name: '회계원리1',
  },
  {
    id: '004008-004',
    school: '경영경제대학',
    name: '회계원리1',
  },
  {
    id: '005155-001',
    school: '경영경제대학',
    name: '경영통계학',
  },
  {
    id: '005155-002',
    school: '경영경제대학',
    name: '경영통계학',
  },
  {
    id: '010130-001',
    school: '경영경제대학',
    name: '경영기초수학',
  },
  {
    id: '010494-001',
    school: '경영경제대학',
    name: 'Introduction to Finance',
  },
  {
    id: '003061-001',
    school: '경영경제대학',
    name: '조직행동론',
  },
  {
    id: '003061-002',
    school: '경영경제대학',
    name: '조직행동론',
  },
  {
    id: '003061-003',
    school: '경영경제대학',
    name: '조직행동론',
  },
  {
    id: '003061-004',
    school: '경영경제대학',
    name: '조직행동론',
  },
  {
    id: '003061-005',
    school: '경영경제대학',
    name: '조직행동론',
  },
  {
    id: '004218-001',
    school: '경영경제대학',
    name: '경영정보론',
  },
  {
    id: '004218-002',
    school: '경영경제대학',
    name: '경영정보론',
  },
  {
    id: '004218-003',
    school: '경영경제대학',
    name: '경영정보론',
  },
  {
    id: '004218-004',
    school: '경영경제대학',
    name: '경영정보론',
  },
  {
    id: '004218-005',
    school: '경영경제대학',
    name: '경영정보론',
  },
  {
    id: '010620-001',
    school: '경영경제대학',
    name: '생산관리',
  },
  {
    id: '010620-002',
    school: '경영경제대학',
    name: '생산관리',
  },
  {
    id: '010620-003',
    school: '경영경제대학',
    name: '생산관리',
  },
  {
    id: '010620-004',
    school: '경영경제대학',
    name: '생산관리',
  },
  {
    id: '010620-005',
    school: '경영경제대학',
    name: '생산관리',
  },
  {
    id: '001092-001',
    school: '경영경제대학',
    name: '마케팅조사',
  },
  {
    id: '001092-002',
    school: '경영경제대학',
    name: '마케팅조사',
  },
  {
    id: '001092-003',
    school: '경영경제대학',
    name: '마케팅조사',
  },
  {
    id: '001766-001',
    school: '경영경제대학',
    name: '소비자행동론',
  },
  {
    id: '001766-002',
    school: '경영경제대학',
    name: '소비자행동론',
  },
  {
    id: '001766-003',
    school: '경영경제대학',
    name: '소비자행동론',
  },
  {
    id: '002340-001',
    school: '경영경제대학',
    name: '원가회계',
  },
  {
    id: '002340-002',
    school: '경영경제대학',
    name: '원가회계',
  },
  {
    id: '002340-003',
    school: '경영경제대학',
    name: '원가회계',
  },
  {
    id: '003359-001',
    school: '경영경제대학',
    name: '투자론',
  },
  {
    id: '003359-002',
    school: '경영경제대학',
    name: '투자론',
  },
  {
    id: '003359-003',
    school: '경영경제대학',
    name: '투자론',
  },
  {
    id: '006802-001',
    school: '경영경제대학',
    name: '기업재무',
  },
  {
    id: '006802-002',
    school: '경영경제대학',
    name: '기업재무',
  },
  {
    id: '000395-001',
    school: '경영경제대학',
    name: '관리경제학',
  },
  {
    id: '001753-001',
    school: '경영경제대학',
    name: '세무회계',
  },
  {
    id: '006798-001',
    school: '경영경제대학',
    name: '유통경로관리',
  },
  {
    id: '007251-001',
    school: '경영경제대학',
    name: '인적자원개발론',
  },
  {
    id: '007983-001',
    school: '경영경제대학',
    name: '금융기관론',
  },
  {
    id: '007983-002',
    school: '경영경제대학',
    name: '금융기관론',
  },
  {
    id: '008451-001',
    school: '경영경제대학',
    name: '팀관리',
  },
  {
    id: '009254-001',
    school: '경영경제대학',
    name: '디지털경영론',
  },
  {
    id: '009254-002',
    school: '경영경제대학',
    name: '디지털경영론',
  },
  {
    id: '009873-001',
    school: '경영경제대학',
    name: '중급회계2',
  },
  {
    id: '009873-002',
    school: '경영경제대학',
    name: '중급회계2',
  },
  {
    id: '009873-003',
    school: '경영경제대학',
    name: '중급회계2',
  },
  {
    id: '010102-001',
    school: '경영경제대학',
    name: 'Services Marketing in a Global Context',
  },
  {
    id: '010392-001',
    school: '경영경제대학',
    name: '상업교과교재연구및지도법',
  },
  {
    id: '010393-001',
    school: '경영경제대학',
    name: '상업논리및논술',
  },
  {
    id: '010851-001',
    school: '경영경제대학',
    name: '사이버보안경영론',
  },
  {
    id: '000257-001',
    school: '경영경제대학',
    name: '고급회계',
  },
  {
    id: '006697-001',
    school: '경영경제대학',
    name: '생명보험',
  },
  {
    id: '006697-002',
    school: '경영경제대학',
    name: '생명보험',
  },
  {
    id: '006697-003',
    school: '경영경제대학',
    name: '생명보험',
  },
  {
    id: '007613-001',
    school: '경영경제대학',
    name: '경영시뮬레이션',
  },
  {
    id: '009884-001',
    school: '경영경제대학',
    name: '마케팅사례',
  },
  {
    id: '010112-001',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-010',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-011',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-012',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-013',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-014',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-015',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-016',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-017',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-018',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-020',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-021',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-022',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-023',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-024',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-025',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-026',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-027',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-028',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-029',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-030',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-031',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-032',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-033',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-034',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-035',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-036',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-037',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-038',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-039',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-040',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-041',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010488-001',
    school: '경영경제대학',
    name: '재무분석및가치평가',
  },
  {
    id: '011839-001',
    school: '경영경제대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '경영경제대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-003',
    school: '경영경제대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '000200-001',
    school: '경영경제대학',
    name: '경제학원론',
  },
  {
    id: '000200-002',
    school: '경영경제대학',
    name: '경제학원론',
  },
  {
    id: '000200-003',
    school: '경영경제대학',
    name: '경제학원론',
  },
  {
    id: '000200-004',
    school: '경영경제대학',
    name: '경제학원론',
  },
  {
    id: '000200-005',
    school: '경영경제대학',
    name: '경제학원론',
  },
  {
    id: '000200-006',
    school: '경영경제대학',
    name: '경제학원론',
  },
  {
    id: '000200-007',
    school: '경영경제대학',
    name: '경제학원론',
  },
  {
    id: '000200-008',
    school: '경영경제대학',
    name: '경제학원론',
  },
  {
    id: '000078-001',
    school: '경영경제대학',
    name: '거시경제학',
  },
  {
    id: '000078-002',
    school: '경영경제대학',
    name: '거시경제학',
  },
  {
    id: '007768-001',
    school: '경영경제대학',
    name: '경제수학',
  },
  {
    id: '007768-002',
    school: '경영경제대학',
    name: '경제수학',
  },
  {
    id: '000152-001',
    school: '경영경제대학',
    name: '경제발전론',
  },
  {
    id: '010815-001',
    school: '경영경제대학',
    name: '경제실무영어',
  },
  {
    id: '000649-001',
    school: '경영경제대학',
    name: '국제금융론',
  },
  {
    id: '000649-002',
    school: '경영경제대학',
    name: '국제금융론',
  },
  {
    id: '001552-001',
    school: '경영경제대학',
    name: '산업조직론',
  },
  {
    id: '008237-001',
    school: '경영경제대학',
    name: '일반사회교과교재연구및지도법',
  },
  {
    id: '008322-001',
    school: '경영경제대학',
    name: '일반사회논리및논술',
  },
  {
    id: '010449-001',
    school: '경영경제대학',
    name: '파생금융상품론',
  },
  {
    id: '010112-001',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '경영경제대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010453-001',
    school: '경영경제대학',
    name: '보건의료경제학',
  },
  {
    id: '010455-001',
    school: '경영경제대학',
    name: '물류유통경제론',
  },
  {
    id: '010817-001',
    school: '경영경제대학',
    name: '환경자원경제학',
  },
  {
    id: '011291-001',
    school: '경영경제대학',
    name: '자산관리경제학',
  },
  {
    id: '011839-001',
    school: '호텔관광대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '호텔관광대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-003',
    school: '호텔관광대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011618-001',
    school: '호텔관광대학',
    name: 'Hospitality경영원론',
  },
  {
    id: '011618-002',
    school: '호텔관광대학',
    name: 'Hospitality경영원론',
  },
  {
    id: '011618-003',
    school: '호텔관광대학',
    name: 'Hospitality경영원론',
  },
  {
    id: '011618-004',
    school: '호텔관광대학',
    name: 'Hospitality경영원론',
  },
  {
    id: '003998-001',
    school: '호텔관광대학',
    name: '회계원리',
  },
  {
    id: '009770-001',
    school: '호텔관광대학',
    name: '호텔관광경영통계원론',
  },
  {
    id: '009770-002',
    school: '호텔관광대학',
    name: '호텔관광경영통계원론',
  },
  {
    id: '009770-003',
    school: '호텔관광대학',
    name: '호텔관광경영통계원론',
  },
  {
    id: '009770-004',
    school: '호텔관광대학',
    name: '호텔관광경영통계원론',
  },
  {
    id: '009770-005',
    school: '호텔관광대학',
    name: '호텔관광경영통계원론',
  },
  {
    id: '009770-006',
    school: '호텔관광대학',
    name: '호텔관광경영통계원론',
  },
  {
    id: '009890-001',
    school: '호텔관광대학',
    name: '호텔관광조직인적자원관리론',
  },
  {
    id: '009890-002',
    school: '호텔관광대학',
    name: '호텔관광조직인적자원관리론',
  },
  {
    id: '009890-003',
    school: '호텔관광대학',
    name: '호텔관광조직인적자원관리론',
  },
  {
    id: '009890-004',
    school: '호텔관광대학',
    name: '호텔관광조직인적자원관리론',
  },
  {
    id: '003875-001',
    school: '호텔관광대학',
    name: '호텔관광재무회계',
  },
  {
    id: '003875-002',
    school: '호텔관광대학',
    name: '호텔관광재무회계',
  },
  {
    id: '006358-001',
    school: '호텔관광대학',
    name: '여가사회학',
  },
  {
    id: '006609-001',
    school: '호텔관광대학',
    name: '서비스경영론',
  },
  {
    id: '006609-002',
    school: '호텔관광대학',
    name: '서비스경영론',
  },
  {
    id: '007443-001',
    school: '호텔관광대학',
    name: '마케팅조사론',
  },
  {
    id: '007991-001',
    school: '호텔관광대학',
    name: '서비스운영관리',
  },
  {
    id: '000388-001',
    school: '호텔관광대학',
    name: '관광행동론',
  },
  {
    id: '000388-002',
    school: '호텔관광대학',
    name: '관광행동론',
  },
  {
    id: '006858-001',
    school: '호텔관광대학',
    name: '서비스마케팅',
  },
  {
    id: '006858-002',
    school: '호텔관광대학',
    name: '서비스마케팅',
  },
  {
    id: '007505-001',
    school: '호텔관광대학',
    name: '리조트경영론',
  },
  {
    id: '007505-002',
    school: '호텔관광대학',
    name: '리조트경영론',
  },
  {
    id: '007763-001',
    school: '호텔관광대학',
    name: '크루즈경영론',
  },
  {
    id: '008239-001',
    school: '호텔관광대학',
    name: '관광교과교재연구및지도법',
  },
  {
    id: '008324-001',
    school: '호텔관광대학',
    name: '관광논리및논술',
  },
  {
    id: '009623-001',
    school: '호텔관광대학',
    name: '호텔관광경제학',
  },
  {
    id: '009630-001',
    school: '호텔관광대학',
    name: '호텔관광커리어멘토링2',
  },
  {
    id: '009637-001',
    school: '호텔관광대학',
    name: '호텔관광전략경영론',
  },
  {
    id: '009637-002',
    school: '호텔관광대학',
    name: '호텔관광전략경영론',
  },
  {
    id: '009896-001',
    school: '호텔관광대학',
    name: '국제회의및이벤트기획',
  },
  {
    id: '010687-001',
    school: '호텔관광대학',
    name: 'HTM 데이터마이닝',
  },
  {
    id: '010824-001',
    school: '호텔관광대학',
    name: 'HTM 스마트/AI알고리즘',
  },
  {
    id: '011201-001',
    school: '호텔관광대학',
    name: 'TPDM 빅데이터플랫폼경영',
  },
  {
    id: '000331-001',
    school: '호텔관광대학',
    name: '관광법규',
  },
  {
    id: '009615-001',
    school: '호텔관광대학',
    name: '국제호텔관광세미나',
  },
  {
    id: '009628-001',
    school: '호텔관광대학',
    name: '호텔관광수익관리',
  },
  {
    id: '009628-002',
    school: '호텔관광대학',
    name: '호텔관광수익관리',
  },
  {
    id: '009639-001',
    school: '호텔관광대학',
    name: 'Special Topics in Hospitality and Tourism Industry',
  },
  {
    id: '010112-001',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-010',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-011',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-012',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-013',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-014',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-015',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-016',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '001948-001',
    school: '호텔관광대학',
    name: '식품학',
  },
  {
    id: '001948-002',
    school: '호텔관광대학',
    name: '식품학',
  },
  {
    id: '008455-001',
    school: '호텔관광대학',
    name: '기초서양조리실습',
  },
  {
    id: '008455-002',
    school: '호텔관광대학',
    name: '기초서양조리실습',
  },
  {
    id: '009519-001',
    school: '호텔관광대학',
    name: '외식서비스마케팅',
  },
  {
    id: '009764-001',
    school: '호텔관광대학',
    name: '바리스타및음료실습1',
  },
  {
    id: '010681-001',
    school: '호텔관광대학',
    name: 'SFM 주방시설관리론',
  },
  {
    id: '010683-001',
    school: '호텔관광대학',
    name: 'SFM 외식서비스앱설계',
  },
  {
    id: '005201-001',
    school: '호텔관광대학',
    name: '제과제빵실습',
  },
  {
    id: '005596-001',
    school: '호텔관광대학',
    name: '식품위생관리',
  },
  {
    id: '006128-001',
    school: '호텔관광대학',
    name: '메뉴계획과디자인',
  },
  {
    id: '007411-001',
    school: '호텔관광대학',
    name: '동양조리실습',
  },
  {
    id: '007531-001',
    school: '호텔관광대학',
    name: '식음료원가관리론',
  },
  {
    id: '008457-001',
    school: '호텔관광대학',
    name: '와인개론',
  },
  {
    id: '009527-001',
    school: '호텔관광대학',
    name: '외식마케팅컨설팅',
  },
  {
    id: '010112-001',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '호텔관광대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010685-001',
    school: '호텔관광대학',
    name: 'SFM 스마트FM캡스톤디자인',
  },
  {
    id: '000200-001',
    school: '호텔관광대학',
    name: '경제학원론',
  },
  {
    id: '006423-001',
    school: '호텔관광대학',
    name: 'Hospitality산업의이해',
  },
  {
    id: '007886-001',
    school: '호텔관광대학',
    name: '사회조사방법론',
  },
  {
    id: '008469-001',
    school: '호텔관광대학',
    name: '글로벌식생활문화',
  },
  {
    id: '009390-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무2',
  },
  {
    id: '009120-001',
    school: '호텔관광대학',
    name: 'HRT서비스경영론',
  },
  {
    id: '009121-001',
    school: '호텔관광대학',
    name: 'HRT프랜차이즈관련법규',
  },
  {
    id: '009398-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무4',
  },
  {
    id: '010189-001',
    school: '호텔관광대학',
    name: 'HRT프랜차이즈마케팅',
  },
  {
    id: '010191-001',
    school: '호텔관광대학',
    name: '연회기획및케이터링경영론',
  },
  {
    id: '000309-001',
    school: '호텔관광대학',
    name: '관광경영론',
  },
  {
    id: '007385-001',
    school: '호텔관광대학',
    name: '외식산업경영론',
  },
  {
    id: '009123-001',
    school: '호텔관광대학',
    name: 'HRT프랜차이즈기업사례연구',
  },
  {
    id: '009128-001',
    school: '호텔관광대학',
    name: '창업아이템개발및상품화계획',
  },
  {
    id: '009400-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무6',
  },
  {
    id: '009136-001',
    school: '호텔관광대학',
    name: 'HRT창업프로젝트',
  },
  {
    id: '009402-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무8',
  },
  {
    id: '009386-001',
    school: '호텔관광대학',
    name: '호텔외식비즈니스의이해',
  },
  {
    id: '010857-001',
    school: '호텔관광대학',
    name: '호텔외식조리경영실무2',
  },
  {
    id: '011456-001',
    school: '호텔관광대학',
    name: '사회조사연구방법론',
  },
  {
    id: '011848-001',
    school: '호텔관광대학',
    name: '기초경제학',
  },
  {
    id: '006463-001',
    school: '호텔관광대학',
    name: '레스토랑경영론',
  },
  {
    id: '009410-001',
    school: '호텔관광대학',
    name: '호텔외식서비스경영론',
  },
  {
    id: '009416-001',
    school: '호텔관광대학',
    name: '호텔외식식품위생관리',
  },
  {
    id: '009552-001',
    school: '호텔관광대학',
    name: '푸드스타일링',
  },
  {
    id: '010859-001',
    school: '호텔관광대학',
    name: '호텔외식조리경영실무4',
  },
  {
    id: '009385-001',
    school: '호텔관광대학',
    name: '호텔기업경영론',
  },
  {
    id: '009387-001',
    school: '호텔관광대학',
    name: '호텔외식원가관리',
  },
  {
    id: '010428-001',
    school: '호텔관광대학',
    name: '커피학개론',
  },
  {
    id: '010861-001',
    school: '호텔관광대학',
    name: '호텔외식조리경영실무6',
  },
  {
    id: '006702-001',
    school: '호텔관광대학',
    name: '외식상품개발론',
  },
  {
    id: '009404-001',
    school: '호텔관광대학',
    name: '프랜차이즈기업사례연구',
  },
  {
    id: '010863-001',
    school: '호텔관광대학',
    name: '호텔외식조리경영실무8',
  },
  {
    id: '009386-001',
    school: '호텔관광대학',
    name: '호텔외식비즈니스의이해',
  },
  {
    id: '010857-001',
    school: '호텔관광대학',
    name: '호텔외식조리경영실무2',
  },
  {
    id: '011850-001',
    school: '호텔관광대학',
    name: '사회조사분석론',
  },
  {
    id: '011851-001',
    school: '호텔관광대학',
    name: '경제학개론',
  },
  {
    id: '001938-001',
    school: '호텔관광대학',
    name: '식품재료학',
  },
  {
    id: '010842-001',
    school: '호텔관광대학',
    name: '유러피안퀴진실습',
  },
  {
    id: '010842-002',
    school: '호텔관광대학',
    name: '유러피안퀴진실습',
  },
  {
    id: '010843-001',
    school: '호텔관광대학',
    name: 'Boulanger실습',
  },
  {
    id: '010843-002',
    school: '호텔관광대학',
    name: 'Boulanger실습',
  },
  {
    id: '010859-001',
    school: '호텔관광대학',
    name: '호텔외식조리경영실무4',
  },
  {
    id: '010847-001',
    school: '호텔관광대학',
    name: '퐁과소스실습',
  },
  {
    id: '010847-002',
    school: '호텔관광대학',
    name: '퐁과소스실습',
  },
  {
    id: '010873-001',
    school: '호텔관광대학',
    name: '레스토랑경영과창업',
  },
  {
    id: '010861-001',
    school: '호텔관광대학',
    name: '호텔외식조리경영실무6',
  },
  {
    id: '010867-001',
    school: '호텔관광대학',
    name: '글로벌퀴진인더키친',
  },
  {
    id: '010863-001',
    school: '호텔관광대학',
    name: '호텔외식조리경영실무8',
  },
  {
    id: '010870-001',
    school: '호텔관광대학',
    name: '글로벌조리캡스톤디자인',
  },
  {
    id: '010877-001',
    school: '호텔관광대학',
    name: 'HMR상품기획',
  },
  {
    id: '501329-001',
    school: '호텔관광대학',
    name: '페스티벌이벤트경영',
  },
  {
    id: '004585-001',
    school: '자연과학대학',
    name: '수학사',
  },
  {
    id: '010112-001',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '004585-001',
    school: '자연과학대학',
    name: '수학사',
  },
  {
    id: '008057-001',
    school: '자연과학대학',
    name: '베이지안분석',
  },
  {
    id: '010112-001',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '011839-001',
    school: '자연과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '자연과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '002641-001',
    school: '자연과학대학',
    name: '일반물리학2',
  },
  {
    id: '002641-002',
    school: '자연과학대학',
    name: '일반물리학2',
  },
  {
    id: '002641-003',
    school: '자연과학대학',
    name: '일반물리학2',
  },
  {
    id: '002641-004',
    school: '자연과학대학',
    name: '일반물리학2',
  },
  {
    id: '002641-005',
    school: '자연과학대학',
    name: '일반물리학2',
  },
  {
    id: '011432-001',
    school: '자연과학대학',
    name: '기초천문학',
  },
  {
    id: '002974-001',
    school: '자연과학대학',
    name: '전자기학1',
  },
  {
    id: '002974-002',
    school: '자연과학대학',
    name: '전자기학1',
  },
  {
    id: '006651-001',
    school: '자연과학대학',
    name: '은하천문학',
  },
  {
    id: '006651-002',
    school: '자연과학대학',
    name: '은하천문학',
  },
  {
    id: '001778-001',
    school: '자연과학대학',
    name: '수리물리2',
  },
  {
    id: '002098-001',
    school: '자연과학대학',
    name: '역학2',
  },
  {
    id: '006467-001',
    school: '자연과학대학',
    name: '기초천문관측및실습',
  },
  {
    id: '008571-001',
    school: '자연과학대학',
    name: '전자학실험',
  },
  {
    id: '009702-001',
    school: '자연과학대학',
    name: '계산과학',
  },
  {
    id: '002037-001',
    school: '자연과학대학',
    name: '양자역학2',
  },
  {
    id: '002116-001',
    school: '자연과학대학',
    name: '열물리학',
  },
  {
    id: '006750-001',
    school: '자연과학대학',
    name: '천체분광학개론',
  },
  {
    id: '009820-001',
    school: '자연과학대학',
    name: '천문관측및실습(종합설계)',
  },
  {
    id: '010885-001',
    school: '자연과학대학',
    name: '나노소자의이해',
  },
  {
    id: '000284-001',
    school: '자연과학대학',
    name: '고체물리학2',
  },
  {
    id: '007636-001',
    school: '자연과학대학',
    name: '성간물질',
  },
  {
    id: '009139-001',
    school: '자연과학대학',
    name: '반도체소자물리학',
  },
  {
    id: '009703-001',
    school: '자연과학대학',
    name: '중력과상대론',
  },
  {
    id: '010112-001',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-010',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-011',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-012',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-013',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-014',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-015',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-016',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-017',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-018',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-019',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-020',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010887-001',
    school: '자연과학대학',
    name: '핵및입자물리학',
  },
  {
    id: '011839-001',
    school: '자연과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '자연과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '002705-001',
    school: '자연과학대학',
    name: '일반화학1',
  },
  {
    id: '002705-002',
    school: '자연과학대학',
    name: '일반화학1',
  },
  {
    id: '002705-003',
    school: '자연과학대학',
    name: '일반화학1',
  },
  {
    id: '002705-004',
    school: '자연과학대학',
    name: '일반화학1',
  },
  {
    id: '002705-005',
    school: '자연과학대학',
    name: '일반화학1',
  },
  {
    id: '002705-006',
    school: '자연과학대학',
    name: '일반화학1',
  },
  {
    id: '002705-007',
    school: '자연과학대학',
    name: '일반화학1',
  },
  {
    id: '002705-008',
    school: '자연과학대학',
    name: '일반화학1',
  },
  {
    id: '002705-009',
    school: '자연과학대학',
    name: '일반화학1',
  },
  {
    id: '002712-001',
    school: '자연과학대학',
    name: '일반화학2',
  },
  {
    id: '002712-002',
    school: '자연과학대학',
    name: '일반화학2',
  },
  {
    id: '002358-001',
    school: '자연과학대학',
    name: '유기화학2',
  },
  {
    id: '002358-002',
    school: '자연과학대학',
    name: '유기화학2',
  },
  {
    id: '006367-001',
    school: '자연과학대학',
    name: '응용분석화학',
  },
  {
    id: '006367-002',
    school: '자연과학대학',
    name: '응용분석화학',
  },
  {
    id: '001281-001',
    school: '자연과학대학',
    name: '물리화학1',
  },
  {
    id: '002365-001',
    school: '자연과학대학',
    name: '유기화학실험',
  },
  {
    id: '006748-001',
    school: '자연과학대학',
    name: '단백질생화학',
  },
  {
    id: '000264-001',
    school: '자연과학대학',
    name: '고분자화학',
  },
  {
    id: '001607-001',
    school: '자연과학대학',
    name: '생화학실험',
  },
  {
    id: '004460-001',
    school: '자연과학대학',
    name: '무기화학실험',
  },
  {
    id: '004588-001',
    school: '자연과학대학',
    name: '생유기화학',
  },
  {
    id: '008240-001',
    school: '자연과학대학',
    name: '화학교과교재연구및지도법',
  },
  {
    id: '008325-001',
    school: '자연과학대학',
    name: '화학논리및논술',
  },
  {
    id: '008579-001',
    school: '자연과학대학',
    name: '화학과소프트웨어1',
  },
  {
    id: '001615-001',
    school: '자연과학대학',
    name: '생활속의화학',
  },
  {
    id: '005600-001',
    school: '자연과학대학',
    name: '정밀화학',
  },
  {
    id: '008591-001',
    school: '자연과학대학',
    name: '고등분석화학',
  },
  {
    id: '010112-001',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-010',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-011',
    school: '자연과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010435-001',
    school: '자연과학대학',
    name: '에너지화학',
  },
  {
    id: '011839-001',
    school: '생명과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '생명과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-003',
    school: '생명과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-004',
    school: '생명과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '006936-001',
    school: '생명과학대학',
    name: '일반생물학2',
  },
  {
    id: '006936-002',
    school: '생명과학대학',
    name: '일반생물학2',
  },
  {
    id: '006936-003',
    school: '생명과학대학',
    name: '일반생물학2',
  },
  {
    id: '006936-004',
    school: '생명과학대학',
    name: '일반생물학2',
  },
  {
    id: '009708-001',
    school: '생명과학대학',
    name: '기초생물통계학',
  },
  {
    id: '009708-002',
    school: '생명과학대학',
    name: '기초생물통계학',
  },
  {
    id: '004462-001',
    school: '생명과학대학',
    name: '생화학',
  },
  {
    id: '004462-002',
    school: '생명과학대학',
    name: '생화학',
  },
  {
    id: '004835-001',
    school: '생명과학대학',
    name: '식품미생물학',
  },
  {
    id: '009329-001',
    school: '생명과학대학',
    name: '식품가공기초',
  },
  {
    id: '001945-001',
    school: '생명과학대학',
    name: '식품포장학',
  },
  {
    id: '004107-001',
    school: '생명과학대학',
    name: '식품화학2및실험',
  },
  {
    id: '010197-001',
    school: '생명과학대학',
    name: '식품분자생물학및실험',
  },
  {
    id: '010198-001',
    school: '생명과학대학',
    name: '식품공정학및실험',
  },
  {
    id: '010199-001',
    school: '생명과학대학',
    name: '식품생명공학연구실습',
  },
  {
    id: '001946-001',
    school: '생명과학대학',
    name: '식품품질관리',
  },
  {
    id: '010112-001',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010201-001',
    school: '생명과학대학',
    name: '발효생명공학',
  },
  {
    id: '010203-001',
    school: '생명과학대학',
    name: '최신식품생명동향연구',
  },
  {
    id: '001606-001',
    school: '생명과학대학',
    name: '생화학2및실험',
  },
  {
    id: '001606-002',
    school: '생명과학대학',
    name: '생화학2및실험',
  },
  {
    id: '001606-003',
    school: '생명과학대학',
    name: '생화학2및실험',
  },
  {
    id: '001606-004',
    school: '생명과학대학',
    name: '생화학2및실험',
  },
  {
    id: '001468-001',
    school: '생명과학대학',
    name: '분석화학',
  },
  {
    id: '001468-002',
    school: '생명과학대학',
    name: '분석화학',
  },
  {
    id: '005213-001',
    school: '생명과학대학',
    name: '기기분석학',
  },
  {
    id: '007000-001',
    school: '생명과학대학',
    name: '면역학1',
  },
  {
    id: '007000-002',
    school: '생명과학대학',
    name: '면역학1',
  },
  {
    id: '007000-003',
    school: '생명과학대학',
    name: '면역학1',
  },
  {
    id: '009667-001',
    school: '생명과학대학',
    name: '기초유전공학',
  },
  {
    id: '009667-002',
    school: '생명과학대학',
    name: '기초유전공학',
  },
  {
    id: '009667-003',
    school: '생명과학대학',
    name: '기초유전공학',
  },
  {
    id: '005143-001',
    school: '생명과학대학',
    name: '분자생물학2',
  },
  {
    id: '005143-002',
    school: '생명과학대학',
    name: '분자생물학2',
  },
  {
    id: '005143-003',
    school: '생명과학대학',
    name: '분자생물학2',
  },
  {
    id: '006321-001',
    school: '생명과학대학',
    name: '바이러스학',
  },
  {
    id: '007001-001',
    school: '생명과학대학',
    name: '세포조직공학',
  },
  {
    id: '008063-001',
    school: '생명과학대학',
    name: '세포생물학2및실험',
  },
  {
    id: '008063-002',
    school: '생명과학대학',
    name: '세포생물학2및실험',
  },
  {
    id: '009324-001',
    school: '생명과학대학',
    name: '암생물학',
  },
  {
    id: '009682-001',
    school: '생명과학대학',
    name: '발생학',
  },
  {
    id: '009842-001',
    school: '생명과학대학',
    name: '시스템면역학및실험',
  },
  {
    id: '005623-001',
    school: '생명과학대학',
    name: '분자유전학',
  },
  {
    id: '007002-001',
    school: '생명과학대학',
    name: '생물공정학',
  },
  {
    id: '009165-001',
    school: '생명과학대학',
    name: '스트레스생물학',
  },
  {
    id: '009841-001',
    school: '생명과학대학',
    name: '분자병리학',
  },
  {
    id: '010112-001',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-010',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-011',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-012',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-013',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-014',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-015',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-016',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-017',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-018',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-019',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '001468-001',
    school: '생명과학대학',
    name: '분석화학',
  },
  {
    id: '001468-002',
    school: '생명과학대학',
    name: '분석화학',
  },
  {
    id: '005100-001',
    school: '생명과학대학',
    name: '식물학',
  },
  {
    id: '008987-001',
    school: '생명과학대학',
    name: '바이오자원공학',
  },
  {
    id: '009706-001',
    school: '생명과학대학',
    name: '일반생화학',
  },
  {
    id: '009857-001',
    school: '생명과학대학',
    name: '분자생물학및실험',
  },
  {
    id: '006116-001',
    school: '생명과학대학',
    name: '식물유전공학및실험',
  },
  {
    id: '006116-002',
    school: '생명과학대학',
    name: '식물유전공학및실험',
  },
  {
    id: '009688-001',
    school: '생명과학대학',
    name: '식물육종학및실험',
  },
  {
    id: '009688-002',
    school: '생명과학대학',
    name: '식물육종학및실험',
  },
  {
    id: '005607-001',
    school: '생명과학대학',
    name: '식물발달생물학',
  },
  {
    id: '008977-001',
    school: '생명과학대학',
    name: '채소학',
  },
  {
    id: '009671-001',
    school: '생명과학대학',
    name: '바이오폴리머공학',
  },
  {
    id: '009683-001',
    school: '생명과학대학',
    name: '식물세포생물학',
  },
  {
    id: '006115-001',
    school: '생명과학대학',
    name: '환경생물학',
  },
  {
    id: '009675-001',
    school: '생명과학대학',
    name: '식물기능유전체학',
  },
  {
    id: '009676-001',
    school: '생명과학대학',
    name: '항체공학',
  },
  {
    id: '009693-001',
    school: '생명과학대학',
    name: '품종개발및보호출원',
  },
  {
    id: '010112-001',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '011839-001',
    school: '생명과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '006936-001',
    school: '생명과학대학',
    name: '일반생물학2',
  },
  {
    id: '009708-001',
    school: '생명과학대학',
    name: '기초생물통계학',
  },
  {
    id: '011128-001',
    school: '생명과학대학',
    name: '종자생명산업과학및실습1',
  },
  {
    id: '011129-001',
    school: '생명과학대학',
    name: '곤충생리학',
  },
  {
    id: '004751-001',
    school: '생명과학대학',
    name: '미생물학및실험',
  },
  {
    id: '009159-001',
    school: '생명과학대학',
    name: '자원식물학',
  },
  {
    id: '011130-001',
    school: '생명과학대학',
    name: '생명산업유전학',
  },
  {
    id: '011134-001',
    school: '생명과학대학',
    name: '어류생리학',
  },
  {
    id: '011142-001',
    school: '생명과학대학',
    name: '스마트팜기획및설계',
  },
  {
    id: '011143-001',
    school: '생명과학대학',
    name: '천연물화학및실험2',
  },
  {
    id: '011149-001',
    school: '생명과학대학',
    name: '생리활성천연물소재탐색',
  },
  {
    id: '010112-001',
    school: '생명과학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '004111-001',
    school: '전자정보공학대학',
    name: '물리전자공학',
  },
  {
    id: '004111-002',
    school: '전자정보공학대학',
    name: '물리전자공학',
  },
  {
    id: '005246-001',
    school: '전자정보공학대학',
    name: '신호및시스템',
  },
  {
    id: '005246-002',
    school: '전자정보공학대학',
    name: '신호및시스템',
  },
  {
    id: '005246-003',
    school: '전자정보공학대학',
    name: '신호및시스템',
  },
  {
    id: '005246-004',
    school: '전자정보공학대학',
    name: '신호및시스템',
  },
  {
    id: '005246-005',
    school: '전자정보공학대학',
    name: '신호및시스템',
  },
  {
    id: '005246-006',
    school: '전자정보공학대학',
    name: '신호및시스템',
  },
  {
    id: '007620-001',
    school: '전자정보공학대학',
    name: '기초설계',
  },
  {
    id: '007620-002',
    school: '전자정보공학대학',
    name: '기초설계',
  },
  {
    id: '007620-003',
    school: '전자정보공학대학',
    name: '기초설계',
  },
  {
    id: '007620-004',
    school: '전자정보공학대학',
    name: '기초설계',
  },
  {
    id: '007620-005',
    school: '전자정보공학대학',
    name: '기초설계',
  },
  {
    id: '003276-001',
    school: '전자정보공학대학',
    name: '컴퓨터구조론',
  },
  {
    id: '003276-002',
    school: '전자정보공학대학',
    name: '컴퓨터구조론',
  },
  {
    id: '005130-001',
    school: '전자정보공학대학',
    name: 'JAVA프로그래밍',
  },
  {
    id: '005130-002',
    school: '전자정보공학대학',
    name: 'JAVA프로그래밍',
  },
  {
    id: '009658-001',
    school: '전자정보공학대학',
    name: '전기회로실험',
  },
  {
    id: '009658-002',
    school: '전자정보공학대학',
    name: '전기회로실험',
  },
  {
    id: '009658-003',
    school: '전자정보공학대학',
    name: '전기회로실험',
  },
  {
    id: '009658-004',
    school: '전자정보공학대학',
    name: '전기회로실험',
  },
  {
    id: '009658-005',
    school: '전자정보공학대학',
    name: '전기회로실험',
  },
  {
    id: '009658-006',
    school: '전자정보공학대학',
    name: '전기회로실험',
  },
  {
    id: '003284-001',
    school: '전자정보공학대학',
    name: '컴퓨터네트워크',
  },
  {
    id: '003284-002',
    school: '전자정보공학대학',
    name: '컴퓨터네트워크',
  },
  {
    id: '003284-003',
    school: '전자정보공학대학',
    name: '컴퓨터네트워크',
  },
  {
    id: '004829-001',
    school: '전자정보공학대학',
    name: '광전자공학',
  },
  {
    id: '004829-002',
    school: '전자정보공학대학',
    name: '광전자공학',
  },
  {
    id: '006132-001',
    school: '전자정보공학대학',
    name: '영상처리',
  },
  {
    id: '006132-002',
    school: '전자정보공학대학',
    name: '영상처리',
  },
  {
    id: '006294-001',
    school: '전자정보공학대학',
    name: '음성처리',
  },
  {
    id: '006294-002',
    school: '전자정보공학대학',
    name: '음성처리',
  },
  {
    id: '008086-001',
    school: '전자정보공학대학',
    name: '디지털통신시스템',
  },
  {
    id: '008086-002',
    school: '전자정보공학대학',
    name: '디지털통신시스템',
  },
  {
    id: '004596-001',
    school: '전자정보공학대학',
    name: '반도체공학',
  },
  {
    id: '004596-002',
    school: '전자정보공학대학',
    name: '반도체공학',
  },
  {
    id: '006559-001',
    school: '전자정보공학대학',
    name: '정보이론',
  },
  {
    id: '006559-002',
    school: '전자정보공학대학',
    name: '정보이론',
  },
  {
    id: '006935-001',
    school: '전자정보공학대학',
    name: '정보시스템설계',
  },
  {
    id: '007720-001',
    school: '전자정보공학대학',
    name: '디스플레이공학',
  },
  {
    id: '007720-002',
    school: '전자정보공학대학',
    name: '디스플레이공학',
  },
  {
    id: '007721-001',
    school: '전자정보공학대학',
    name: '반도체소자설계',
  },
  {
    id: '007721-002',
    school: '전자정보공학대학',
    name: '반도체소자설계',
  },
  {
    id: '007722-001',
    school: '전자정보공학대학',
    name: '전자회로2',
  },
  {
    id: '009650-001',
    school: '전자정보공학대학',
    name: '데이터통신설계',
  },
  {
    id: '009650-002',
    school: '전자정보공학대학',
    name: '데이터통신설계',
  },
  {
    id: '009659-001',
    school: '전자정보공학대학',
    name: '전자기2',
  },
  {
    id: '009659-002',
    school: '전자정보공학대학',
    name: '전자기2',
  },
  {
    id: '004304-001',
    school: '전자정보공학대학',
    name: '응용광학',
  },
  {
    id: '004830-001',
    school: '전자정보공학대학',
    name: '디지털제어',
  },
  {
    id: '007463-001',
    school: '전자정보공학대학',
    name: '차세대이동통신',
  },
  {
    id: '008079-001',
    school: '전자정보공학대학',
    name: '광반도체및LED공학',
  },
  {
    id: '009664-001',
    school: '전자정보공학대학',
    name: '전자정보통신공학특강B',
  },
  {
    id: '009948-001',
    school: '전자정보공학대학',
    name: '캡스톤디자인B',
  },
  {
    id: '009948-002',
    school: '전자정보공학대학',
    name: '캡스톤디자인B',
  },
  {
    id: '009948-003',
    school: '전자정보공학대학',
    name: '캡스톤디자인B',
  },
  {
    id: '010112-001',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-010',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-011',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-012',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-013',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-014',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-015',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-016',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-017',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-018',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-019',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-020',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-021',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-022',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-023',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-024',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-025',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-026',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-027',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-028',
    school: '전자정보공학대학',
    name: '졸업연구및진로2',
  },
  {
    id: '003278-001',
    school: '소프트웨어융합대학',
    name: '컴퓨터구조',
  },
  {
    id: '003278-002',
    school: '소프트웨어융합대학',
    name: '컴퓨터구조',
  },
  {
    id: '003278-003',
    school: '소프트웨어융합대학',
    name: '컴퓨터구조',
  },
  {
    id: '003278-004',
    school: '소프트웨어융합대학',
    name: '컴퓨터구조',
  },
  {
    id: '003278-005',
    school: '소프트웨어융합대학',
    name: '컴퓨터구조',
  },
  {
    id: '003278-006',
    school: '소프트웨어융합대학',
    name: '컴퓨터구조',
  },
  {
    id: '009912-001',
    school: '소프트웨어융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-002',
    school: '소프트웨어융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009914-001',
    school: '소프트웨어융합대학',
    name: '공학설계기초(산학프로젝트입문)',
  },
  {
    id: '009954-001',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '009954-002',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '009954-003',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '009954-004',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '009954-005',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '009954-006',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '009954-007',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '009955-001',
    school: '소프트웨어융합대학',
    name: '이산수학및프로그래밍',
  },
  {
    id: '009955-002',
    school: '소프트웨어융합대학',
    name: '이산수학및프로그래밍',
  },
  {
    id: '009955-003',
    school: '소프트웨어융합대학',
    name: '이산수학및프로그래밍',
  },
  {
    id: '009955-004',
    school: '소프트웨어융합대학',
    name: '이산수학및프로그래밍',
  },
  {
    id: '009956-001',
    school: '소프트웨어융합대학',
    name: '문제해결및실습:JAVA',
  },
  {
    id: '009956-002',
    school: '소프트웨어융합대학',
    name: '문제해결및실습:JAVA',
  },
  {
    id: '009956-003',
    school: '소프트웨어융합대학',
    name: '문제해결및실습:JAVA',
  },
  {
    id: '009956-004',
    school: '소프트웨어융합대학',
    name: '문제해결및실습:JAVA',
  },
  {
    id: '009956-005',
    school: '소프트웨어융합대학',
    name: '문제해결및실습:JAVA',
  },
  {
    id: '009961-001',
    school: '소프트웨어융합대학',
    name: '선형대수및프로그래밍',
  },
  {
    id: '009961-002',
    school: '소프트웨어융합대학',
    name: '선형대수및프로그래밍',
  },
  {
    id: '009961-003',
    school: '소프트웨어융합대학',
    name: '선형대수및프로그래밍',
  },
  {
    id: '009961-004',
    school: '소프트웨어융합대학',
    name: '선형대수및프로그래밍',
  },
  {
    id: '011200-001',
    school: '소프트웨어융합대학',
    name: 'K-MOOC:멀티미디어',
  },
  {
    id: '011251-001',
    school: '소프트웨어융합대학',
    name: 'K-MOOC:모두를위한머신러닝',
  },
  {
    id: '003284-001',
    school: '소프트웨어융합대학',
    name: '컴퓨터네트워크',
  },
  {
    id: '003284-002',
    school: '소프트웨어융합대학',
    name: '컴퓨터네트워크',
  },
  {
    id: '003284-003',
    school: '소프트웨어융합대학',
    name: '컴퓨터네트워크',
  },
  {
    id: '003284-004',
    school: '소프트웨어융합대학',
    name: '컴퓨터네트워크',
  },
  {
    id: '003284-005',
    school: '소프트웨어융합대학',
    name: '컴퓨터네트워크',
  },
  {
    id: '003284-006',
    school: '소프트웨어융합대학',
    name: '컴퓨터네트워크',
  },
  {
    id: '001769-001',
    school: '소프트웨어융합대학',
    name: '소프트웨어공학',
  },
  {
    id: '001769-002',
    school: '소프트웨어융합대학',
    name: '소프트웨어공학',
  },
  {
    id: '002505-001',
    school: '소프트웨어융합대학',
    name: '인공지능',
  },
  {
    id: '004600-001',
    school: '소프트웨어융합대학',
    name: '디지털신호처리',
  },
  {
    id: '005617-001',
    school: '소프트웨어융합대학',
    name: 'Unix프로그래밍',
  },
  {
    id: '005617-002',
    school: '소프트웨어융합대학',
    name: 'Unix프로그래밍',
  },
  {
    id: '006324-001',
    school: '소프트웨어융합대학',
    name: 'XML프로그래밍',
  },
  {
    id: '008636-001',
    school: '소프트웨어융합대학',
    name: '멀티코어프로그래밍',
  },
  {
    id: '009962-001',
    school: '소프트웨어융합대학',
    name: '웹기반시스템',
  },
  {
    id: '011771-001',
    school: '소프트웨어융합대학',
    name: 'K-MOOC:생성형인공지능입문',
  },
  {
    id: '009960-001',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '009960-002',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '009960-003',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '006566-001',
    school: '소프트웨어융합대학',
    name: '지능형시스템',
  },
  {
    id: '010112-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-010',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-011',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-012',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-013',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-014',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-015',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-016',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-017',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-018',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-019',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '009174-001',
    school: '소프트웨어융합대학',
    name: '어셈블리어',
  },
  {
    id: '009954-001',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '003278-001',
    school: '소프트웨어융합대학',
    name: '컴퓨터구조',
  },
  {
    id: '006981-001',
    school: '소프트웨어융합대학',
    name: '보안프로그래밍',
  },
  {
    id: '009989-001',
    school: '소프트웨어융합대학',
    name: '시스템해킹과보안',
  },
  {
    id: '009958-001',
    school: '소프트웨어융합대학',
    name: '오픈소스SW설계',
  },
  {
    id: '010205-001',
    school: '소프트웨어융합대학',
    name: '보안공학',
  },
  {
    id: '010446-001',
    school: '소프트웨어융합대학',
    name: '사이버관제및대응',
  },
  {
    id: '008663-001',
    school: '소프트웨어융합대학',
    name: '보안정책과법규',
  },
  {
    id: '010112-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010447-001',
    school: '소프트웨어융합대학',
    name: '정보보호특강',
  },
  {
    id: '003278-001',
    school: '소프트웨어융합대학',
    name: '컴퓨터구조',
  },
  {
    id: '003278-002',
    school: '소프트웨어융합대학',
    name: '컴퓨터구조',
  },
  {
    id: '009954-001',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '009954-002',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '009993-001',
    school: '소프트웨어융합대학',
    name: 'SW설계기초(산학프로젝트입문)',
  },
  {
    id: '009993-002',
    school: '소프트웨어융합대학',
    name: 'SW설계기초(산학프로젝트입문)',
  },
  {
    id: '009955-001',
    school: '소프트웨어융합대학',
    name: '이산수학및프로그래밍',
  },
  {
    id: '009955-002',
    school: '소프트웨어융합대학',
    name: '이산수학및프로그래밍',
  },
  {
    id: '009956-001',
    school: '소프트웨어융합대학',
    name: '문제해결및실습:JAVA',
  },
  {
    id: '009956-002',
    school: '소프트웨어융합대학',
    name: '문제해결및실습:JAVA',
  },
  {
    id: '009961-001',
    school: '소프트웨어융합대학',
    name: '선형대수및프로그래밍',
  },
  {
    id: '009961-002',
    school: '소프트웨어융합대학',
    name: '선형대수및프로그래밍',
  },
  {
    id: '001769-001',
    school: '소프트웨어융합대학',
    name: '소프트웨어공학',
  },
  {
    id: '003281-001',
    school: '소프트웨어융합대학',
    name: '컴퓨터그래픽스',
  },
  {
    id: '005910-001',
    school: '소프트웨어융합대학',
    name: '데이터베이스프로그래밍',
  },
  {
    id: '011175-001',
    school: '소프트웨어융합대학',
    name: '음성오디오처리',
  },
  {
    id: '009960-001',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '002505-001',
    school: '소프트웨어융합대학',
    name: '인공지능',
  },
  {
    id: '009973-001',
    school: '소프트웨어융합대학',
    name: '소프트웨어특강2',
  },
  {
    id: '010112-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '003278-001',
    school: '소프트웨어융합대학',
    name: '컴퓨터구조',
  },
  {
    id: '009954-001',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '004102-001',
    school: '소프트웨어융합대학',
    name: '수치해석',
  },
  {
    id: '009961-001',
    school: '소프트웨어융합대학',
    name: '선형대수및프로그래밍',
  },
  {
    id: '009957-001',
    school: '소프트웨어융합대학',
    name: '오픈소스SW개론',
  },
  {
    id: '002505-001',
    school: '소프트웨어융합대학',
    name: '인공지능',
  },
  {
    id: '010143-001',
    school: '소프트웨어융합대학',
    name: '데이터시각화',
  },
  {
    id: '010145-001',
    school: '소프트웨어융합대학',
    name: '데이터문제해결및실습1',
  },
  {
    id: '009967-001',
    school: '소프트웨어융합대학',
    name: '특허와창업',
  },
  {
    id: '010112-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010570-001',
    school: '소프트웨어융합대학',
    name: '고급기계학습',
  },
  {
    id: '002505-001',
    school: '소프트웨어융합대학',
    name: '인공지능',
  },
  {
    id: '002505-002',
    school: '소프트웨어융합대학',
    name: '인공지능',
  },
  {
    id: '004600-001',
    school: '소프트웨어융합대학',
    name: '디지털신호처리',
  },
  {
    id: '005905-001',
    school: '소프트웨어융합대학',
    name: '디지털통신',
  },
  {
    id: '006139-001',
    school: '소프트웨어융합대학',
    name: '임베디드시스템',
  },
  {
    id: '006486-001',
    school: '소프트웨어융합대학',
    name: '로보틱스',
  },
  {
    id: '010229-001',
    school: '소프트웨어융합대학',
    name: '앱프로그래밍',
  },
  {
    id: '010571-001',
    school: '소프트웨어융합대학',
    name: '디지털회로설계',
  },
  {
    id: '009960-001',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '009960-002',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '010112-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010239-001',
    school: '소프트웨어융합대학',
    name: '머신비전시스템',
  },
  {
    id: '002505-001',
    school: '소프트웨어융합대학',
    name: '인공지능',
  },
  {
    id: '002505-002',
    school: '소프트웨어융합대학',
    name: '인공지능',
  },
  {
    id: '004600-001',
    school: '소프트웨어융합대학',
    name: '디지털신호처리',
  },
  {
    id: '005905-001',
    school: '소프트웨어융합대학',
    name: '디지털통신',
  },
  {
    id: '006139-001',
    school: '소프트웨어융합대학',
    name: '임베디드시스템',
  },
  {
    id: '006486-001',
    school: '소프트웨어융합대학',
    name: '로보틱스',
  },
  {
    id: '010229-001',
    school: '소프트웨어융합대학',
    name: '앱프로그래밍',
  },
  {
    id: '010230-001',
    school: '소프트웨어융합대학',
    name: '사물인터넷',
  },
  {
    id: '010230-002',
    school: '소프트웨어융합대학',
    name: '사물인터넷',
  },
  {
    id: '010231-001',
    school: '소프트웨어융합대학',
    name: '스마트디스플레이',
  },
  {
    id: '010571-001',
    school: '소프트웨어융합대학',
    name: '디지털회로설계',
  },
  {
    id: '009960-001',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '009960-002',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '010112-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010239-001',
    school: '소프트웨어융합대학',
    name: '머신비전시스템',
  },
  {
    id: '008499-001',
    school: '소프트웨어융합대학',
    name: '타입&이미지',
  },
  {
    id: '008499-002',
    school: '소프트웨어융합대학',
    name: '타입&이미지',
  },
  {
    id: '006328-001',
    school: '소프트웨어융합대학',
    name: '디자인재료및성형기법',
  },
  {
    id: '007860-001',
    school: '소프트웨어융합대학',
    name: '인터렉티브디자인',
  },
  {
    id: '010327-001',
    school: '소프트웨어융합대학',
    name: '기초3D그래픽스',
  },
  {
    id: '010327-002',
    school: '소프트웨어융합대학',
    name: '기초3D그래픽스',
  },
  {
    id: '010328-001',
    school: '소프트웨어융합대학',
    name: '프로덕트조형스튜디오',
  },
  {
    id: '009946-001',
    school: '소프트웨어융합대학',
    name: 'UX디자인2',
  },
  {
    id: '009946-002',
    school: '소프트웨어융합대학',
    name: 'UX디자인2',
  },
  {
    id: '000706-001',
    school: '소프트웨어융합대학',
    name: '그래픽디자인2',
  },
  {
    id: '000706-002',
    school: '소프트웨어융합대학',
    name: '그래픽디자인2',
  },
  {
    id: '010330-001',
    school: '소프트웨어융합대학',
    name: '프로덕트&모빌리티디자인2',
  },
  {
    id: '010334-001',
    school: '소프트웨어융합대학',
    name: '스마트프로덕트디자인2',
  },
  {
    id: '010337-001',
    school: '소프트웨어융합대학',
    name: '디지털미디어디자인',
  },
  {
    id: '005764-001',
    school: '소프트웨어융합대학',
    name: '졸업작품(P/NP)',
  },
  {
    id: '005920-001',
    school: '소프트웨어융합대학',
    name: '아이덴티티디자인2',
  },
  {
    id: '006754-001',
    school: '소프트웨어융합대학',
    name: '제품시스템디자인2',
  },
  {
    id: '009215-001',
    school: '소프트웨어융합대학',
    name: '제품및운송기기디자인4',
  },
  {
    id: '010338-001',
    school: '소프트웨어융합대학',
    name: '디자인비즈니스&매니지먼트',
  },
  {
    id: '010344-001',
    school: '소프트웨어융합대학',
    name: '디지털미디어프로젝트2',
  },
  {
    id: '008791-001',
    school: '소프트웨어융합대학',
    name: '콘텐츠기획2',
  },
  {
    id: '008791-002',
    school: '소프트웨어융합대학',
    name: '콘텐츠기획2',
  },
  {
    id: '008429-001',
    school: '소프트웨어융합대학',
    name: '디지털스토리텔링',
  },
  {
    id: '008429-002',
    school: '소프트웨어융합대학',
    name: '디지털스토리텔링',
  },
  {
    id: '008793-001',
    school: '소프트웨어융합대학',
    name: '만화제작2',
  },
  {
    id: '008793-002',
    school: '소프트웨어융합대학',
    name: '만화제작2',
  },
  {
    id: '010282-001',
    school: '소프트웨어융합대학',
    name: '애니메이션액팅2',
  },
  {
    id: '010282-002',
    school: '소프트웨어융합대학',
    name: '애니메이션액팅2',
  },
  {
    id: '010579-001',
    school: '소프트웨어융합대학',
    name: '3D제작도구2',
  },
  {
    id: '010579-002',
    school: '소프트웨어융합대학',
    name: '3D제작도구2',
  },
  {
    id: '011186-001',
    school: '소프트웨어융합대학',
    name: '프리비즈워크숍2',
  },
  {
    id: '011186-002',
    school: '소프트웨어융합대학',
    name: '프리비즈워크숍2',
  },
  {
    id: '010673-001',
    school: '소프트웨어융합대학',
    name: '디지털코믹스제작2',
  },
  {
    id: '010673-002',
    school: '소프트웨어융합대학',
    name: '디지털코믹스제작2',
  },
  {
    id: '011192-001',
    school: '소프트웨어융합대학',
    name: '비주얼디벨롭먼트2',
  },
  {
    id: '011192-002',
    school: '소프트웨어융합대학',
    name: '비주얼디벨롭먼트2',
  },
  {
    id: '010671-001',
    school: '소프트웨어융합대학',
    name: '디지털애니메이션디렉팅2',
  },
  {
    id: '010672-001',
    school: '소프트웨어융합대학',
    name: '이펙트디자인2',
  },
  {
    id: '010672-002',
    school: '소프트웨어융합대학',
    name: '이펙트디자인2',
  },
  {
    id: '011114-001',
    school: '소프트웨어융합대학',
    name: '기술융합형콘텐츠스토리텔링워크숍2',
  },
  {
    id: '011115-001',
    school: '소프트웨어융합대학',
    name: '기술융합형콘텐츠실무제작2',
  },
  {
    id: '011188-001',
    school: '소프트웨어융합대학',
    name: '애니메이션워크숍2',
  },
  {
    id: '011188-002',
    school: '소프트웨어융합대학',
    name: '애니메이션워크숍2',
  },
  {
    id: '011190-001',
    school: '소프트웨어융합대학',
    name: '3D제작도구고급2',
  },
  {
    id: '011190-002',
    school: '소프트웨어융합대학',
    name: '3D제작도구고급2',
  },
  {
    id: '005764-001',
    school: '소프트웨어융합대학',
    name: '졸업작품(P/NP)',
  },
  {
    id: '010299-001',
    school: '소프트웨어융합대학',
    name: '애니메이션코어스튜디오2',
  },
  {
    id: '010299-002',
    school: '소프트웨어융합대학',
    name: '애니메이션코어스튜디오2',
  },
  {
    id: '010301-001',
    school: '소프트웨어융합대학',
    name: '웹툰커넥션프로덕션2',
  },
  {
    id: '010112-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '003278-001',
    school: '소프트웨어융합대학',
    name: '컴퓨터구조',
  },
  {
    id: '003278-002',
    school: '소프트웨어융합대학',
    name: '컴퓨터구조',
  },
  {
    id: '009954-001',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '009954-002',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '004600-001',
    school: '소프트웨어융합대학',
    name: '디지털신호처리',
  },
  {
    id: '009961-001',
    school: '소프트웨어융합대학',
    name: '선형대수및프로그래밍',
  },
  {
    id: '011172-001',
    school: '소프트웨어융합대학',
    name: '인공지능수학2',
  },
  {
    id: '011260-001',
    school: '소프트웨어융합대학',
    name: '파이썬기반기계학습',
  },
  {
    id: '011263-001',
    school: '소프트웨어융합대학',
    name: '파이썬기반딥러닝',
  },
  {
    id: '006566-001',
    school: '소프트웨어융합대학',
    name: '지능형시스템',
  },
  {
    id: '009665-001',
    school: '소프트웨어융합대학',
    name: '패턴인식',
  },
  {
    id: '010143-001',
    school: '소프트웨어융합대학',
    name: '데이터시각화',
  },
  {
    id: '011265-001',
    school: '소프트웨어융합대학',
    name: 'AR/VR /MR',
  },
  {
    id: '009967-001',
    school: '소프트웨어융합대학',
    name: '특허와창업',
  },
  {
    id: '010112-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로2',
  },
  {
    id: '011271-001',
    school: '소프트웨어융합대학',
    name: 'Human–AI Interaction',
  },
  {
    id: '011839-001',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '004274-001',
    school: '공과대학',
    name: '구조역학1',
  },
  {
    id: '011278-001',
    school: '공과대학',
    name: '건축디지털설계',
  },
  {
    id: '011278-002',
    school: '공과대학',
    name: '건축디지털설계',
  },
  {
    id: '006307-001',
    school: '공과대학',
    name: '건축설비개론',
  },
  {
    id: '004434-001',
    school: '공과대학',
    name: '건축재료',
  },
  {
    id: '004608-001',
    school: '공과대학',
    name: '건축법규',
  },
  {
    id: '006610-001',
    school: '공과대학',
    name: '건축시공',
  },
  {
    id: '009186-001',
    school: '공과대학',
    name: '특수구조개론',
  },
  {
    id: '008179-001',
    school: '공과대학',
    name: '공학설계B',
  },
  {
    id: '004849-001',
    school: '공과대학',
    name: '컴퓨터구조해석',
  },
  {
    id: '006575-001',
    school: '공과대학',
    name: '건축조명',
  },
  {
    id: '009810-001',
    school: '공과대학',
    name: '스마트구조개론',
  },
  {
    id: '010112-001',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '004703-001',
    school: '공과대학',
    name: '건설경영',
  },
  {
    id: '006763-001',
    school: '공과대학',
    name: '스튜디오6',
  },
  {
    id: '006763-002',
    school: '공과대학',
    name: '스튜디오6',
  },
  {
    id: '006763-003',
    school: '공과대학',
    name: '스튜디오6',
  },
  {
    id: '006763-004',
    school: '공과대학',
    name: '스튜디오6',
  },
  {
    id: '011281-001',
    school: '공과대학',
    name: '한국건축사',
  },
  {
    id: '006762-001',
    school: '공과대학',
    name: '인테리어',
  },
  {
    id: '006931-001',
    school: '공과대학',
    name: '주거론',
  },
  {
    id: '007037-001',
    school: '공과대학',
    name: '스튜디오8',
  },
  {
    id: '007037-002',
    school: '공과대학',
    name: '스튜디오8',
  },
  {
    id: '007037-003',
    school: '공과대학',
    name: '스튜디오8',
  },
  {
    id: '007037-004',
    school: '공과대학',
    name: '스튜디오8',
  },
  {
    id: '011111-001',
    school: '공과대학',
    name: '졸업작품',
  },
  {
    id: '011111-002',
    school: '공과대학',
    name: '졸업작품',
  },
  {
    id: '011111-003',
    school: '공과대학',
    name: '졸업작품',
  },
  {
    id: '011111-004',
    school: '공과대학',
    name: '졸업작품',
  },
  {
    id: '007038-001',
    school: '공과대학',
    name: '개별연구',
  },
  {
    id: '010112-001',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '011839-001',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '004326-001',
    school: '공과대학',
    name: '응용역학및연습2',
  },
  {
    id: '010614-001',
    school: '공과대학',
    name: '토질역학',
  },
  {
    id: '010269-001',
    school: '공과대학',
    name: '수리학',
  },
  {
    id: '004707-001',
    school: '공과대학',
    name: '기초공학',
  },
  {
    id: '010594-001',
    school: '공과대학',
    name: '건설경영관리',
  },
  {
    id: '010595-001',
    school: '공과대학',
    name: '콘크리트구조설계',
  },
  {
    id: '010596-001',
    school: '공과대학',
    name: '물재생자원순환',
  },
  {
    id: '010597-001',
    school: '공과대학',
    name: '합성구조설계',
  },
  {
    id: '011422-001',
    school: '공과대학',
    name: '도시수문학',
  },
  {
    id: '009267-001',
    school: '공과대학',
    name: '빅데이터분석',
  },
  {
    id: '010112-001',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010599-001',
    school: '공과대학',
    name: '첨단계측공학',
  },
  {
    id: '010600-001',
    school: '공과대학',
    name: '건설재료시험',
  },
  {
    id: '011423-001',
    school: '공과대학',
    name: '스마트시티프로젝트(종합설계)',
  },
  {
    id: '011424-001',
    school: '공과대학',
    name: '스마트환경유체모델링',
  },
  {
    id: '011839-001',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '009620-001',
    school: '공과대학',
    name: '환경바이오공학',
  },
  {
    id: '011382-001',
    school: '공과대학',
    name: '환경데이터처리',
  },
  {
    id: '009624-001',
    school: '공과대학',
    name: '온실가스관리및분석',
  },
  {
    id: '009633-001',
    school: '공과대학',
    name: '환경에너지',
  },
  {
    id: '009818-001',
    school: '공과대학',
    name: '환경원격탐사',
  },
  {
    id: '008169-001',
    school: '공과대학',
    name: '종합설계',
  },
  {
    id: '007168-001',
    school: '공과대학',
    name: '환경영향평가',
  },
  {
    id: '009636-001',
    school: '공과대학',
    name: '환경에너지공간세미나',
  },
  {
    id: '010112-001',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '004475-001',
    school: '공과대학',
    name: '자동제어',
  },
  {
    id: '004862-001',
    school: '공과대학',
    name: '열전달',
  },
  {
    id: '005134-001',
    school: '공과대학',
    name: '컴퓨터응용설계',
  },
  {
    id: '005134-002',
    school: '공과대학',
    name: '컴퓨터응용설계',
  },
  {
    id: '006099-001',
    school: '공과대학',
    name: '전자공학개론',
  },
  {
    id: '007261-001',
    school: '공과대학',
    name: '응용열역학',
  },
  {
    id: '011295-001',
    school: '공과대학',
    name: '금속적층제조공정학',
  },
  {
    id: '005234-001',
    school: '공과대학',
    name: '내연기관',
  },
  {
    id: '007621-001',
    school: '공과대학',
    name: '전산열유체역학',
  },
  {
    id: '010112-001',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010911-001',
    school: '공과대학',
    name: '종합설계B',
  },
  {
    id: '010919-002',
    school: '공과대학',
    name: '인공지능응용기계공학',
  },
  {
    id: '004102-001',
    school: '공과대학',
    name: '수치해석',
  },
  {
    id: '004102-002',
    school: '공과대학',
    name: '수치해석',
  },
  {
    id: '004868-001',
    school: '공과대학',
    name: '추진체공학',
  },
  {
    id: '005243-001',
    school: '공과대학',
    name: '인공위성응용',
  },
  {
    id: '007265-001',
    school: '공과대학',
    name: '항공센서신호처리',
  },
  {
    id: '010921-001',
    school: '공과대학',
    name: '자율비행체시스템설계1',
  },
  {
    id: '004862-001',
    school: '공과대학',
    name: '열전달',
  },
  {
    id: '006887-001',
    school: '공과대학',
    name: '유도제어시스템설계',
  },
  {
    id: '007056-001',
    school: '공과대학',
    name: '헬리콥터공학및설계',
  },
  {
    id: '008140-001',
    school: '공과대학',
    name: '전산응용해석',
  },
  {
    id: '009195-001',
    school: '공과대학',
    name: '항공우주응용SW2',
  },
  {
    id: '009836-001',
    school: '공과대학',
    name: '종합설계2',
  },
  {
    id: '010112-001',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '011839-001',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-003',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '004281-001',
    school: '공과대학',
    name: '유기화학',
  },
  {
    id: '004281-002',
    school: '공과대학',
    name: '유기화학',
  },
  {
    id: '005648-001',
    school: '공과대학',
    name: '재료열역학2',
  },
  {
    id: '005648-002',
    school: '공과대학',
    name: '재료열역학2',
  },
  {
    id: '006152-001',
    school: '공과대학',
    name: '전자기학',
  },
  {
    id: '006782-001',
    school: '공과대학',
    name: '신소재과학2',
  },
  {
    id: '007458-001',
    school: '공과대학',
    name: '재료의전자기적물성',
  },
  {
    id: '006996-001',
    school: '공과대학',
    name: '재료의기계적성질',
  },
  {
    id: '006996-002',
    school: '공과대학',
    name: '재료의기계적성질',
  },
  {
    id: '006996-003',
    school: '공과대학',
    name: '재료의기계적성질',
  },
  {
    id: '010080-001',
    school: '공과대학',
    name: '반도체와고분자화학기초설계및실험',
  },
  {
    id: '010080-002',
    school: '공과대학',
    name: '반도체와고분자화학기초설계및실험',
  },
  {
    id: '010080-003',
    school: '공과대학',
    name: '반도체와고분자화학기초설계및실험',
  },
  {
    id: '010080-004',
    school: '공과대학',
    name: '반도체와고분자화학기초설계및실험',
  },
  {
    id: '010080-005',
    school: '공과대학',
    name: '반도체와고분자화학기초설계및실험',
  },
  {
    id: '006147-001',
    school: '공과대학',
    name: '반도체제조공학',
  },
  {
    id: '006147-002',
    school: '공과대학',
    name: '반도체제조공학',
  },
  {
    id: '006679-001',
    school: '공과대학',
    name: '전기화학',
  },
  {
    id: '007159-001',
    school: '공과대학',
    name: '고분자물리',
  },
  {
    id: '007579-001',
    school: '공과대학',
    name: '신금속재료',
  },
  {
    id: '008105-001',
    school: '공과대학',
    name: '화학기기분석',
  },
  {
    id: '009024-001',
    school: '공과대학',
    name: '산화물재료',
  },
  {
    id: '006148-001',
    school: '공과대학',
    name: '전자세라믹스재료',
  },
  {
    id: '006786-001',
    school: '공과대학',
    name: '금속공정학',
  },
  {
    id: '007273-001',
    school: '공과대학',
    name: '나노재료응용',
  },
  {
    id: '007580-001',
    school: '공과대학',
    name: '세라믹스공정학',
  },
  {
    id: '010082-001',
    school: '공과대학',
    name: '나노신소재창의연구2(종합설계)',
  },
  {
    id: '010082-002',
    school: '공과대학',
    name: '나노신소재창의연구2(종합설계)',
  },
  {
    id: '010082-003',
    school: '공과대학',
    name: '나노신소재창의연구2(종합설계)',
  },
  {
    id: '010112-001',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-010',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-011',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-012',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-013',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-014',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-015',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-016',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-017',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '011839-001',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-003',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '004642-001',
    school: '공과대학',
    name: '동역학',
  },
  {
    id: '004642-002',
    school: '공과대학',
    name: '동역학',
  },
  {
    id: '005641-001',
    school: '공과대학',
    name: '유체역학',
  },
  {
    id: '005641-002',
    school: '공과대학',
    name: '유체역학',
  },
  {
    id: '006585-001',
    school: '공과대학',
    name: '기계요소설계',
  },
  {
    id: '006585-002',
    school: '공과대학',
    name: '기계요소설계',
  },
  {
    id: '011839-001',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '008951-001',
    school: '공과대학',
    name: '해군장교현장실습1',
  },
  {
    id: '009204-001',
    school: '공과대학',
    name: '군사전자공학개론및실험',
  },
  {
    id: '010212-001',
    school: '공과대학',
    name: '장교직무교육세미나2',
  },
  {
    id: '005246-001',
    school: '공과대학',
    name: '신호및시스템',
  },
  {
    id: '008924-001',
    school: '공과대학',
    name: '기초역학개론',
  },
  {
    id: '008931-001',
    school: '공과대학',
    name: '시스템응용SW',
  },
  {
    id: '008952-001',
    school: '공과대학',
    name: '해군장교현장실습2',
  },
  {
    id: '010214-001',
    school: '공과대학',
    name: '장교직무교육세미나4',
  },
  {
    id: '008771-001',
    school: '공과대학',
    name: '함정운용학',
  },
  {
    id: '009205-001',
    school: '공과대학',
    name: '함정공학개론',
  },
  {
    id: '007235-001',
    school: '공과대학',
    name: '랜덤프로세스',
  },
  {
    id: '008077-001',
    school: '공과대학',
    name: '제어공학',
  },
  {
    id: '008486-001',
    school: '공과대학',
    name: '리더십',
  },
  {
    id: '009468-001',
    school: '공과대학',
    name: '해군장교현장실습3',
  },
  {
    id: '010216-001',
    school: '공과대학',
    name: '장교직무교육세미나6',
  },
  {
    id: '008773-001',
    school: '공과대학',
    name: '레이더시스템',
  },
  {
    id: '009206-001',
    school: '공과대학',
    name: '마이크로콘트롤러응용',
  },
  {
    id: '010934-001',
    school: '공과대학',
    name: '국방인공지능개론및실습',
  },
  {
    id: '008765-001',
    school: '공과대학',
    name: '항해학개론',
  },
  {
    id: '009781-001',
    school: '공과대학',
    name: '해군장교현장실습4',
  },
  {
    id: '010218-001',
    school: '공과대학',
    name: '장교직무교육세미나8',
  },
  {
    id: '010940-001',
    school: '공과대학',
    name: '음향진동학',
  },
  {
    id: '008780-001',
    school: '공과대학',
    name: '해군교리및작전',
  },
  {
    id: '010112-001',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '009290-001',
    school: '공과대학',
    name: '공군리더십',
  },
  {
    id: '001875-001',
    school: '공과대학',
    name: '시스템분석및설계',
  },
  {
    id: '011061-001',
    school: '공과대학',
    name: '항공우주실험2',
  },
  {
    id: '011072-001',
    school: '공과대학',
    name: '모의비행실습1',
  },
  {
    id: '011072-002',
    school: '공과대학',
    name: '모의비행실습1',
  },
  {
    id: '009538-001',
    school: '공과대학',
    name: '비행일반및체험비행',
  },
  {
    id: '006303-001',
    school: '공과대학',
    name: '무인항공기설계2',
  },
  {
    id: '009310-001',
    school: '공과대학',
    name: '방위사업체계',
  },
  {
    id: '010112-001',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '011074-001',
    school: '공과대학',
    name: '모의비행실습3',
  },
  {
    id: '011074-002',
    school: '공과대학',
    name: '모의비행실습3',
  },
  {
    id: '011839-001',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '008153-001',
    school: '공과대학',
    name: '지구화학탐사',
  },
  {
    id: '010906-001',
    school: '공과대학',
    name: '암석역학및실험',
  },
  {
    id: '010906-002',
    school: '공과대학',
    name: '암석역학및실험',
  },
  {
    id: '010915-001',
    school: '공과대학',
    name: '물리탐사공학개론',
  },
  {
    id: '004714-001',
    school: '공과대학',
    name: '열역학',
  },
  {
    id: '009545-001',
    school: '공과대학',
    name: '응용지구전자기학',
  },
  {
    id: '010918-001',
    school: '공과대학',
    name: '지반정보(GIS)시스템및실습',
  },
  {
    id: '008148-001',
    school: '공과대학',
    name: '시추공학',
  },
  {
    id: '008477-001',
    school: '공과대학',
    name: '전기화학공학및실습',
  },
  {
    id: '008478-001',
    school: '공과대학',
    name: '지구통계학',
  },
  {
    id: '010907-001',
    school: '공과대학',
    name: '에너지환경지오메카닉스및실습',
  },
  {
    id: '010909-001',
    school: '공과대학',
    name: '전산지진학및실습',
  },
  {
    id: '010913-001',
    school: '공과대학',
    name: '수리지질학',
  },
  {
    id: '011393-001',
    school: '공과대학',
    name: '유용자원회수공학',
  },
  {
    id: '010112-001',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-005',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-006',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-007',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-008',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-009',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010910-001',
    school: '공과대학',
    name: '지진및지질재해론',
  },
  {
    id: '010911-001',
    school: '공과대학',
    name: '종합설계B',
  },
  {
    id: '011396-001',
    school: '공과대학',
    name: '3D지질모델링및매장량평가',
  },
  {
    id: '011397-001',
    school: '공과대학',
    name: '스마트마이닝캡스톤디자인',
  },
  {
    id: '011839-001',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '009838-001',
    school: '공과대학',
    name: '원자력기계공학기초',
  },
  {
    id: '007330-001',
    school: '공과대학',
    name: '확률및통계',
  },
  {
    id: '008994-001',
    school: '공과대학',
    name: '방사선과물질상호작용',
  },
  {
    id: '008999-001',
    school: '공과대학',
    name: '원자로열전달',
  },
  {
    id: '011391-001',
    school: '공과대학',
    name: '원자력공학개론2',
  },
  {
    id: '009010-001',
    school: '공과대학',
    name: '확률론적안전성평가',
  },
  {
    id: '009574-001',
    school: '공과대학',
    name: '핵연료주기및폐기물관리',
  },
  {
    id: '009576-001',
    school: '공과대학',
    name: '보건물리',
  },
  {
    id: '009577-001',
    school: '공과대학',
    name: '발전소계통공학',
  },
  {
    id: '010928-001',
    school: '공과대학',
    name: '원자력안전규제및법령',
  },
  {
    id: '009586-001',
    school: '공과대학',
    name: '몬테카를로분석및방사선차폐',
  },
  {
    id: '009851-001',
    school: '공과대학',
    name: '종합설계B',
  },
  {
    id: '010112-001',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-004',
    school: '공과대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010931-001',
    school: '공과대학',
    name: '원자력데이터사이언스',
  },
  {
    id: '011839-001',
    school: '예체능대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '000808-001',
    school: '예체능대학',
    name: '기초한국화2',
  },
  {
    id: '000808-002',
    school: '예체능대학',
    name: '기초한국화2',
  },
  {
    id: '005888-001',
    school: '예체능대학',
    name: '기초회화2',
  },
  {
    id: '005888-002',
    school: '예체능대학',
    name: '기초회화2',
  },
  {
    id: '000967-001',
    school: '예체능대학',
    name: '동양미술사',
  },
  {
    id: '009542-001',
    school: '예체능대학',
    name: '드로잉',
  },
  {
    id: '009542-002',
    school: '예체능대학',
    name: '드로잉',
  },
  {
    id: '000776-001',
    school: '예체능대학',
    name: '기초서양화2',
  },
  {
    id: '000776-002',
    school: '예체능대학',
    name: '기초서양화2',
  },
  {
    id: '009610-001',
    school: '예체능대학',
    name: '한.표현기법',
  },
  {
    id: '001330-001',
    school: '예체능대학',
    name: '미술비평',
  },
  {
    id: '002401-001',
    school: '예체능대학',
    name: '유화기법2',
  },
  {
    id: '002401-002',
    school: '예체능대학',
    name: '유화기법2',
  },
  {
    id: '003169-001',
    school: '예체능대학',
    name: '채색화',
  },
  {
    id: '005247-001',
    school: '예체능대학',
    name: '컴퓨터드로잉2',
  },
  {
    id: '005247-002',
    school: '예체능대학',
    name: '컴퓨터드로잉2',
  },
  {
    id: '008660-001',
    school: '예체능대학',
    name: '서양미술사2',
  },
  {
    id: '002392-001',
    school: '예체능대학',
    name: '유화2',
  },
  {
    id: '002392-002',
    school: '예체능대학',
    name: '유화2',
  },
  {
    id: '004330-001',
    school: '예체능대학',
    name: '한국화2',
  },
  {
    id: '006541-001',
    school: '예체능대학',
    name: '서.복합매체기법',
  },
  {
    id: '007602-001',
    school: '예체능대학',
    name: '멀티미디어와회화2',
  },
  {
    id: '007602-002',
    school: '예체능대학',
    name: '멀티미디어와회화2',
  },
  {
    id: '008243-001',
    school: '예체능대학',
    name: '미술교과교재연구및지도법',
  },
  {
    id: '008328-001',
    school: '예체능대학',
    name: '미술논리및논술',
  },
  {
    id: '008661-001',
    school: '예체능대학',
    name: '현대산수연구',
  },
  {
    id: '011242-001',
    school: '예체능대학',
    name: '판화',
  },
  {
    id: '001631-001',
    school: '예체능대학',
    name: '서.종합실기2',
  },
  {
    id: '001631-002',
    school: '예체능대학',
    name: '서.종합실기2',
  },
  {
    id: '004876-001',
    school: '예체능대학',
    name: '한.종합실기2',
  },
  {
    id: '005764-001',
    school: '예체능대학',
    name: '졸업작품(P/NP)',
  },
  {
    id: '001636-001',
    school: '예체능대학',
    name: '서.종합실기4',
  },
  {
    id: '004877-001',
    school: '예체능대학',
    name: '한.종합실기4',
  },
  {
    id: '011839-001',
    school: '예체능대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '008504-001',
    school: '예체능대학',
    name: '패션컴퓨터그래픽',
  },
  {
    id: '008504-002',
    school: '예체능대학',
    name: '패션컴퓨터그래픽',
  },
  {
    id: '010951-001',
    school: '예체능대학',
    name: '응용패턴종합설계',
  },
  {
    id: '010951-002',
    school: '예체능대학',
    name: '응용패턴종합설계',
  },
  {
    id: '010944-001',
    school: '예체능대학',
    name: '소재캡스톤디자인',
  },
  {
    id: '010944-002',
    school: '예체능대학',
    name: '소재캡스톤디자인',
  },
  {
    id: '005263-001',
    school: '예체능대학',
    name: '창작패션일러스트레이션',
  },
  {
    id: '005263-002',
    school: '예체능대학',
    name: '창작패션일러스트레이션',
  },
  {
    id: '008249-001',
    school: '예체능대학',
    name: '의상교과교재연구및지도법',
  },
  {
    id: '008511-001',
    school: '예체능대학',
    name: '기초패션드레이핑',
  },
  {
    id: '008511-002',
    school: '예체능대학',
    name: '기초패션드레이핑',
  },
  {
    id: '010945-001',
    school: '예체능대학',
    name: '패션브랜드캡스톤디자인',
  },
  {
    id: '010945-002',
    school: '예체능대학',
    name: '패션브랜드캡스톤디자인',
  },
  {
    id: '010011-001',
    school: '예체능대학',
    name: '창작의상캡스톤디자인',
  },
  {
    id: '010011-002',
    school: '예체능대학',
    name: '창작의상캡스톤디자인',
  },
  {
    id: '005093-001',
    school: '예체능대학',
    name: '테일러링',
  },
  {
    id: '005093-002',
    school: '예체능대학',
    name: '테일러링',
  },
  {
    id: '010012-001',
    school: '예체능대학',
    name: '디지털패션캡스톤디자인',
  },
  {
    id: '010012-002',
    school: '예체능대학',
    name: '디지털패션캡스톤디자인',
  },
  {
    id: '010013-001',
    school: '예체능대학',
    name: '니트캡스톤디자인',
  },
  {
    id: '010013-002',
    school: '예체능대학',
    name: '니트캡스톤디자인',
  },
  {
    id: '005764-001',
    school: '예체능대학',
    name: '졸업작품(P/NP)',
  },
  {
    id: '010018-001',
    school: '예체능대학',
    name: '패션코디네이션종합설계',
  },
  {
    id: '010018-002',
    school: '예체능대학',
    name: '패션코디네이션종합설계',
  },
  {
    id: '010950-001',
    school: '예체능대학',
    name: '패션포트폴리오종합설계',
  },
  {
    id: '010950-002',
    school: '예체능대학',
    name: '패션포트폴리오종합설계',
  },
  {
    id: '011839-001',
    school: '예체능대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '예체능대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '002111-001',
    school: '예체능대학',
    name: '연주2',
  },
  {
    id: '002111-002',
    school: '예체능대학',
    name: '연주2',
  },
  {
    id: '002111-003',
    school: '예체능대학',
    name: '연주2',
  },
  {
    id: '002900-001',
    school: '예체능대학',
    name: '전공실기2',
  },
  {
    id: '001046-001',
    school: '예체능대학',
    name: '딕션2',
  },
  {
    id: '003655-001',
    school: '예체능대학',
    name: '합창2',
  },
  {
    id: '007280-001',
    school: '예체능대학',
    name: '현악합주2',
  },
  {
    id: '007546-001',
    school: '예체능대학',
    name: '관악합주2',
  },
  {
    id: '009472-001',
    school: '예체능대학',
    name: '체임버뮤직2',
  },
  {
    id: '009472-002',
    school: '예체능대학',
    name: '체임버뮤직2',
  },
  {
    id: '009472-003',
    school: '예체능대학',
    name: '체임버뮤직2',
  },
  {
    id: '009472-004',
    school: '예체능대학',
    name: '체임버뮤직2',
  },
  {
    id: '009472-005',
    school: '예체능대학',
    name: '체임버뮤직2',
  },
  {
    id: '009483-001',
    school: '예체능대학',
    name: '시창청음2',
  },
  {
    id: '009483-002',
    school: '예체능대학',
    name: '시창청음2',
  },
  {
    id: '009483-003',
    school: '예체능대학',
    name: '시창청음2',
  },
  {
    id: '009749-001',
    school: '예체능대학',
    name: '발성과발음',
  },
  {
    id: '009749-002',
    school: '예체능대학',
    name: '발성과발음',
  },
  {
    id: '009927-001',
    school: '예체능대학',
    name: '컴퓨터음악1',
  },
  {
    id: '009927-002',
    school: '예체능대학',
    name: '컴퓨터음악1',
  },
  {
    id: '010646-001',
    school: '예체능대학',
    name: '오케스트라및앙상블2',
  },
  {
    id: '002113-001',
    school: '예체능대학',
    name: '연주4',
  },
  {
    id: '002113-002',
    school: '예체능대학',
    name: '연주4',
  },
  {
    id: '002113-003',
    school: '예체능대학',
    name: '연주4',
  },
  {
    id: '002905-001',
    school: '예체능대학',
    name: '전공실기4',
  },
  {
    id: '003467-001',
    school: '예체능대학',
    name: '피아노문헌2',
  },
  {
    id: '003661-001',
    school: '예체능대학',
    name: '합창4',
  },
  {
    id: '007543-001',
    school: '예체능대학',
    name: '현악합주4',
  },
  {
    id: '007702-001',
    school: '예체능대학',
    name: '관악합주4',
  },
  {
    id: '009470-001',
    school: '예체능대학',
    name: '딕션4',
  },
  {
    id: '009474-001',
    school: '예체능대학',
    name: '체임버뮤직4',
  },
  {
    id: '009474-002',
    school: '예체능대학',
    name: '체임버뮤직4',
  },
  {
    id: '009474-003',
    school: '예체능대학',
    name: '체임버뮤직4',
  },
  {
    id: '009474-004',
    school: '예체능대학',
    name: '체임버뮤직4',
  },
  {
    id: '009474-005',
    school: '예체능대학',
    name: '체임버뮤직4',
  },
  {
    id: '009480-001',
    school: '예체능대학',
    name: '화성법및대위법2',
  },
  {
    id: '009480-002',
    school: '예체능대학',
    name: '화성법및대위법2',
  },
  {
    id: '009480-003',
    school: '예체능대학',
    name: '화성법및대위법2',
  },
  {
    id: '010647-001',
    school: '예체능대학',
    name: '오케스트라및앙상블4',
  },
  {
    id: '010650-001',
    school: '예체능대학',
    name: '재즈피아노',
  },
  {
    id: '002110-001',
    school: '예체능대학',
    name: '연주6',
  },
  {
    id: '002110-002',
    school: '예체능대학',
    name: '연주6',
  },
  {
    id: '002110-003',
    school: '예체능대학',
    name: '연주6',
  },
  {
    id: '002909-001',
    school: '예체능대학',
    name: '전공실기6',
  },
  {
    id: '001740-001',
    school: '예체능대학',
    name: '성악문헌2',
  },
  {
    id: '002456-001',
    school: '예체능대학',
    name: '음악사2',
  },
  {
    id: '003666-001',
    school: '예체능대학',
    name: '합창6',
  },
  {
    id: '007705-001',
    school: '예체능대학',
    name: '현악합주6',
  },
  {
    id: '008189-001',
    school: '예체능대학',
    name: '관악합주6',
  },
  {
    id: '008244-001',
    school: '예체능대학',
    name: '음악교과교재연구및지도법',
  },
  {
    id: '008331-001',
    school: '예체능대학',
    name: '음악논리및논술',
  },
  {
    id: '009476-001',
    school: '예체능대학',
    name: '체임버뮤직6',
  },
  {
    id: '009476-002',
    school: '예체능대학',
    name: '체임버뮤직6',
  },
  {
    id: '009476-003',
    school: '예체능대학',
    name: '체임버뮤직6',
  },
  {
    id: '009476-004',
    school: '예체능대학',
    name: '체임버뮤직6',
  },
  {
    id: '009476-005',
    school: '예체능대학',
    name: '체임버뮤직6',
  },
  {
    id: '009757-001',
    school: '예체능대학',
    name: '퍼포먼스워크샵2',
  },
  {
    id: '009757-002',
    school: '예체능대학',
    name: '퍼포먼스워크샵2',
  },
  {
    id: '010644-001',
    school: '예체능대학',
    name: '오케스트라및앙상블6',
  },
  {
    id: '002913-001',
    school: '예체능대학',
    name: '전공실기8',
  },
  {
    id: '005764-001',
    school: '예체능대학',
    name: '졸업작품(P/NP)',
  },
  {
    id: '010395-001',
    school: '예체능대학',
    name: '연주8',
  },
  {
    id: '010395-002',
    school: '예체능대학',
    name: '연주8',
  },
  {
    id: '010395-003',
    school: '예체능대학',
    name: '연주8',
  },
  {
    id: '003155-001',
    school: '예체능대학',
    name: '지휘법',
  },
  {
    id: '008186-001',
    school: '예체능대학',
    name: '현악합주8',
  },
  {
    id: '008192-001',
    school: '예체능대학',
    name: '관악합주8',
  },
  {
    id: '009478-001',
    school: '예체능대학',
    name: '체임버뮤직8',
  },
  {
    id: '009478-002',
    school: '예체능대학',
    name: '체임버뮤직8',
  },
  {
    id: '009478-003',
    school: '예체능대학',
    name: '체임버뮤직8',
  },
  {
    id: '009478-004',
    school: '예체능대학',
    name: '체임버뮤직8',
  },
  {
    id: '009478-005',
    school: '예체능대학',
    name: '체임버뮤직8',
  },
  {
    id: '009485-001',
    school: '예체능대학',
    name: '오페라워크샾2',
  },
  {
    id: '009759-001',
    school: '예체능대학',
    name: '뮤직비지니스',
  },
  {
    id: '009931-001',
    school: '예체능대학',
    name: '반주문헌2',
  },
  {
    id: '010022-001',
    school: '예체능대학',
    name: '실용음악제작',
  },
  {
    id: '010030-001',
    school: '예체능대학',
    name: '퍼포먼스워크샵4',
  },
  {
    id: '010649-001',
    school: '예체능대학',
    name: '오케스트라및앙상블8',
  },
  {
    id: '011839-001',
    school: '예체능대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '003213-001',
    school: '예체능대학',
    name: '체육사회학',
  },
  {
    id: '006898-001',
    school: '예체능대학',
    name: '건강증진학',
  },
  {
    id: '003206-001',
    school: '예체능대학',
    name: '체육사',
  },
  {
    id: '006899-001',
    school: '예체능대학',
    name: '스포츠의학입문',
  },
  {
    id: '008544-001',
    school: '예체능대학',
    name: '스포츠와미디어',
  },
  {
    id: '010960-001',
    school: '예체능대학',
    name: '체력육성실습',
  },
  {
    id: '010961-001',
    school: '예체능대학',
    name: '뉴스포츠의이해',
  },
  {
    id: '003363-001',
    school: '예체능대학',
    name: '트레이닝방법론',
  },
  {
    id: '001836-001',
    school: '예체능대학',
    name: '스포츠영양학',
  },
  {
    id: '001847-001',
    school: '예체능대학',
    name: '스포츠특강2',
  },
  {
    id: '002328-001',
    school: '예체능대학',
    name: '운동기능학',
  },
  {
    id: '007009-001',
    school: '예체능대학',
    name: '레저스포츠2',
  },
  {
    id: '008245-001',
    school: '예체능대학',
    name: '체육교과교재연구및지도법',
  },
  {
    id: '008332-001',
    school: '예체능대학',
    name: '체육논리및논술',
  },
  {
    id: '005765-001',
    school: '예체능대학',
    name: '졸업시험(P/NP)',
  },
  {
    id: '001499-001',
    school: '예체능대학',
    name: '비교체육학',
  },
  {
    id: '002331-001',
    school: '예체능대학',
    name: '운동처방',
  },
  {
    id: '003226-001',
    school: '예체능대학',
    name: '체육학연구법',
  },
  {
    id: '003486-001',
    school: '예체능대학',
    name: '학교보건',
  },
  {
    id: '011839-001',
    school: '예체능대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '003770-001',
    school: '예체능대학',
    name: '현대무용기본2',
  },
  {
    id: '004620-001',
    school: '예체능대학',
    name: '발레테크닉2',
  },
  {
    id: '004622-001',
    school: '예체능대학',
    name: '워크샵2',
  },
  {
    id: '005267-001',
    school: '예체능대학',
    name: '발레레파토리2',
  },
  {
    id: '007282-001',
    school: '예체능대학',
    name: '발레기초2',
  },
  {
    id: '008824-001',
    school: '예체능대학',
    name: '모던댄스2',
  },
  {
    id: '008828-001',
    school: '예체능대학',
    name: '한국전통무용기교훈련2',
  },
  {
    id: '008830-001',
    school: '예체능대학',
    name: '한국창작무용기교훈련2',
  },
  {
    id: '008903-001',
    school: '예체능대학',
    name: '한국전통무용기본2',
  },
  {
    id: '002000-001',
    school: '예체능대학',
    name: '안무법',
  },
  {
    id: '004895-001',
    school: '예체능대학',
    name: '현대무용사',
  },
  {
    id: '008832-001',
    school: '예체능대학',
    name: '한국무용음악분석',
  },
  {
    id: '008904-001',
    school: '예체능대학',
    name: '발레와필라테스',
  },
  {
    id: '004880-001',
    school: '예체능대학',
    name: '발레테크닉4',
  },
  {
    id: '004882-001',
    school: '예체능대학',
    name: '워크샵4',
  },
  {
    id: '005928-001',
    school: '예체능대학',
    name: '발레레파토리4',
  },
  {
    id: '008826-001',
    school: '예체능대학',
    name: '모던댄스4',
  },
  {
    id: '008835-001',
    school: '예체능대학',
    name: '전통춤기교실습2',
  },
  {
    id: '008837-001',
    school: '예체능대학',
    name: '창작춤기교실습2',
  },
  {
    id: '007069-001',
    school: '예체능대학',
    name: '궁중정재',
  },
  {
    id: '008846-001',
    school: '예체능대학',
    name: '무용사회학',
  },
  {
    id: '005269-001',
    school: '예체능대학',
    name: '고급현대무용2',
  },
  {
    id: '008839-001',
    school: '예체능대학',
    name: '발레테크닉6',
  },
  {
    id: '008850-001',
    school: '예체능대학',
    name: '컨템포러리댄스2',
  },
  {
    id: '008854-001',
    school: '예체능대학',
    name: '한국전통무용안무2',
  },
  {
    id: '008856-001',
    school: '예체능대학',
    name: '한국창작무용안무2',
  },
  {
    id: '008869-001',
    school: '예체능대학',
    name: '발레레파토리6',
  },
  {
    id: '001211-001',
    school: '예체능대학',
    name: '무용비평',
  },
  {
    id: '009227-001',
    school: '예체능대학',
    name: '컨템포러리발레2',
  },
  {
    id: '009229-001',
    school: '예체능대학',
    name: '발레워크샵2',
  },
  {
    id: '005764-001',
    school: '예체능대학',
    name: '졸업작품(P/NP)',
  },
  {
    id: '005930-001',
    school: '예체능대학',
    name: '고급현대무용4',
  },
  {
    id: '008841-001',
    school: '예체능대학',
    name: '발레테크닉8',
  },
  {
    id: '008852-001',
    school: '예체능대학',
    name: '컨템포러리댄스4',
  },
  {
    id: '008865-001',
    school: '예체능대학',
    name: '한국전통무용작품분석2',
  },
  {
    id: '008867-001',
    school: '예체능대학',
    name: '한국창작무용작품분석2',
  },
  {
    id: '008871-001',
    school: '예체능대학',
    name: '발레레파토리8',
  },
  {
    id: '000965-001',
    school: '예체능대학',
    name: '동양무용사',
  },
  {
    id: '009231-001',
    school: '예체능대학',
    name: '캐릭터발레2',
  },
  {
    id: '010272-001',
    school: '예체능대학',
    name: '공연기획과실습',
  },
  {
    id: '011839-001',
    school: '예체능대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '004264-001',
    school: '예체능대학',
    name: '서양영화사',
  },
  {
    id: '004264-002',
    school: '예체능대학',
    name: '서양영화사',
  },
  {
    id: '006905-001',
    school: '예체능대학',
    name: '무대매커니즘2',
  },
  {
    id: '008676-001',
    school: '예체능대학',
    name: '영화기술기초',
  },
  {
    id: '008676-002',
    school: '예체능대학',
    name: '영화기술기초',
  },
  {
    id: '009978-001',
    school: '예체능대학',
    name: '개별창의연구2',
  },
  {
    id: '010047-001',
    school: '예체능대학',
    name: '기초연기2(감성과체험훈련)',
  },
  {
    id: '010971-001',
    school: '예체능대학',
    name: '호흡과발성2',
  },
  {
    id: '009218-001',
    school: '예체능대학',
    name: '공연의이해와감상',
  },
  {
    id: '009218-002',
    school: '예체능대학',
    name: '공연의이해와감상',
  },
  {
    id: '004652-001',
    school: '예체능대학',
    name: '연출론',
  },
  {
    id: '004652-002',
    school: '예체능대학',
    name: '연출론',
  },
  {
    id: '010048-001',
    school: '예체능대학',
    name: '공연프로덕션실습2',
  },
  {
    id: '010055-001',
    school: '예체능대학',
    name: '텍스트와연기실습2',
  },
  {
    id: '004662-001',
    school: '예체능대학',
    name: '시나리오작법1',
  },
  {
    id: '006369-001',
    school: '예체능대학',
    name: '영화제작WS2',
  },
  {
    id: '008683-001',
    school: '예체능대학',
    name: '사운드',
  },
  {
    id: '008683-002',
    school: '예체능대학',
    name: '사운드',
  },
  {
    id: '009219-001',
    school: '예체능대학',
    name: '공연연출실습',
  },
  {
    id: '010049-001',
    school: '예체능대학',
    name: '화술트레이닝1',
  },
  {
    id: '006371-001',
    school: '예체능대학',
    name: '영화제작론',
  },
  {
    id: '006371-002',
    school: '예체능대학',
    name: '영화제작론',
  },
  {
    id: '005925-001',
    school: '예체능대학',
    name: '연기메소드연구',
  },
  {
    id: '006370-001',
    school: '예체능대학',
    name: '영화제작WS4',
  },
  {
    id: '008247-001',
    school: '예체능대학',
    name: '연극영화교과교재연구및지도법',
  },
  {
    id: '008333-001',
    school: '예체능대학',
    name: '연극영화논리및논술',
  },
  {
    id: '008689-001',
    school: '예체능대학',
    name: '매체연기실습2',
  },
  {
    id: '008689-002',
    school: '예체능대학',
    name: '매체연기실습2',
  },
  {
    id: '008693-001',
    school: '예체능대학',
    name: '뮤지컬넘버플레이2',
  },
  {
    id: '010057-001',
    school: '예체능대학',
    name: '연기실습콜라보레이션2-종합설계',
  },
  {
    id: '010973-001',
    school: '예체능대학',
    name: '신체언어훈련2',
  },
  {
    id: '005764-001',
    school: '예체능대학',
    name: '졸업작품(P/NP)',
  },
  {
    id: '006534-001',
    school: '예체능대학',
    name: '작가연구',
  },
  {
    id: '008697-001',
    school: '예체능대학',
    name: '공연제작Project2',
  },
  {
    id: '006373-001',
    school: '예체능대학',
    name: '영화제작WS6',
  },
  {
    id: '006916-001',
    school: '예체능대학',
    name: '예술과기획경영',
  },
  {
    id: '008713-001',
    school: '대학',
    name: '계약법',
  },
  {
    id: '008805-001',
    school: '대학',
    name: '법철학',
  },
  {
    id: '009601-001',
    school: '대학',
    name: '헌법2',
  },
  {
    id: '009603-001',
    school: '대학',
    name: '물권법',
  },
  {
    id: '009609-001',
    school: '대학',
    name: '형법각론',
  },
  {
    id: '004812-001',
    school: '대학',
    name: '회사법',
  },
  {
    id: '011443-001',
    school: '대학',
    name: '민사소송법',
  },
  {
    id: '008716-001',
    school: '대학',
    name: '법학적성평가연습2',
  },
  {
    id: '008725-001',
    school: '대학',
    name: '친족상속법',
  },
  {
    id: '011444-001',
    school: '대학',
    name: '저작권법',
  },
  {
    id: '010112-001',
    school: '대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-002',
    school: '대학',
    name: '졸업연구및진로2',
  },
  {
    id: '010112-003',
    school: '대학',
    name: '졸업연구및진로2',
  },
  {
    id: '009881-001',
    school: '연계전공',
    name: '비즈니스모델',
  },
  {
    id: '010603-001',
    school: '연계전공',
    name: '린스타트업',
  },
  {
    id: '010978-001',
    school: '연계전공',
    name: '창업회계',
  },
  {
    id: '010980-001',
    school: '연계전공',
    name: '실전창업동아리2',
  },
  {
    id: '010604-001',
    school: '연계전공',
    name: '창업캡스톤',
  },
  {
    id: '011773-001',
    school: '연계전공',
    name: 'K-MOOC:비주얼프로그래밍',
  },
  {
    id: '009717-001',
    school: '연계전공',
    name: 'ES-디지털사운드디자인',
  },
  {
    id: '009728-001',
    school: '연계전공',
    name: 'ES-웨어러블컴퓨터디자인',
  },
  {
    id: '010097-001',
    school: '연계전공',
    name: 'GMSW-미디어빅데이터분석',
  },
  {
    id: '010485-001',
    school: '연계전공',
    name: 'GMSW-융합디자인세미나',
  },
  {
    id: '010101-001',
    school: '연계전공',
    name: 'GMSW-포스트영상프로덕션',
  },
  {
    id: '010613-001',
    school: '연계전공',
    name: 'GMSW-글로벌미디어의현장',
  },
  {
    id: '011839-001',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-003',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '000304-001',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '000304-002',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '000304-003',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '000304-004',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '000304-005',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '001725-001',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '001725-002',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '001725-003',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '001725-004',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '001725-005',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '009913-001',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-002',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-003',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-004',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-005',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '011839-001',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '007590-001',
    school: '공과대학',
    name: '건축디자인',
  },
  {
    id: '007590-002',
    school: '공과대학',
    name: '건축디자인',
  },
  {
    id: '006309-001',
    school: '공과대학',
    name: '스튜디오2',
  },
  {
    id: '006309-002',
    school: '공과대학',
    name: '스튜디오2',
  },
  {
    id: '006309-003',
    school: '공과대학',
    name: '스튜디오2',
  },
  {
    id: '006309-004',
    school: '공과대학',
    name: '스튜디오2',
  },
  {
    id: '009811-001',
    school: '공과대학',
    name: '건축구조개론',
  },
  {
    id: '011286-001',
    school: '공과대학',
    name: '현대건축사',
  },
  {
    id: '006661-001',
    school: '공과대학',
    name: '건축디지털디자인2',
  },
  {
    id: '006661-002',
    school: '공과대학',
    name: '건축디지털디자인2',
  },
  {
    id: '006661-003',
    school: '공과대학',
    name: '건축디지털디자인2',
  },
  {
    id: '004706-001',
    school: '공과대학',
    name: '건축설비',
  },
  {
    id: '006608-001',
    school: '공과대학',
    name: '스튜디오4',
  },
  {
    id: '006608-002',
    school: '공과대학',
    name: '스튜디오4',
  },
  {
    id: '006608-003',
    school: '공과대학',
    name: '스튜디오4',
  },
  {
    id: '006608-004',
    school: '공과대학',
    name: '스튜디오4',
  },
  {
    id: '006662-001',
    school: '공과대학',
    name: '도시설계',
  },
  {
    id: '007594-001',
    school: '공과대학',
    name: '재료와디테일',
  },
  {
    id: '010462-001',
    school: '공과대학',
    name: '건축경제학',
  },
  {
    id: '011839-001',
    school: '인문과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011683-001',
    school: '인문과학대학',
    name: '전공한국어쓰기',
  },
  {
    id: '011685-001',
    school: '인문과학대학',
    name: '전공한국어읽기',
  },
  {
    id: '011719-001',
    school: '인문과학대학',
    name: 'Technical Writing',
  },
  {
    id: '011720-001',
    school: '인문과학대학',
    name: 'Seminar on Parliamentary Debate',
  },
  {
    id: '011118-001',
    school: '연계전공',
    name: '공연예술의이해',
  },
  {
    id: '010794-001',
    school: '연계전공',
    name: '퍼포밍아트2(작품분석과비평)',
  },
  {
    id: '011028-001',
    school: '연계전공',
    name: '졸업프로젝트4',
  },
  {
    id: '011226-001',
    school: '연계전공',
    name: '박물관과큐레이션실습',
  },
  {
    id: '011327-001',
    school: '연계전공',
    name: '디지털큐레이션전공인턴쉽2',
  },
  {
    id: '010760-001',
    school: '연계전공',
    name: '커뮤니케이션마켓믹스디자인',
  },
  {
    id: '011013-001',
    school: '연계전공',
    name: '가방디자인이해',
  },
  {
    id: '010746-001',
    school: '연계전공',
    name: '조향디자인',
  },
  {
    id: '010715-001',
    school: '연계전공',
    name: '문화콘텐츠기획',
  },
  {
    id: '010735-001',
    school: '연계전공',
    name: '전시기획론',
  },
  {
    id: '010741-001',
    school: '연계전공',
    name: '축제기획론',
  },
  {
    id: '004111-001',
    school: '전자정보공학대학',
    name: '물리전자공학',
  },
  {
    id: '011350-001',
    school: '전자정보공학대학',
    name: '반도체특화연구및실험1',
  },
  {
    id: '003278-001',
    school: '전자정보공학대학',
    name: '컴퓨터구조',
  },
  {
    id: '005246-001',
    school: '전자정보공학대학',
    name: '신호및시스템',
  },
  {
    id: '006314-001',
    school: '전자정보공학대학',
    name: '박막공학',
  },
  {
    id: '007453-001',
    school: '전자정보공학대학',
    name: '전자회로1',
  },
  {
    id: '011259-001',
    school: '전자정보공학대학',
    name: '기계학습개론',
  },
  {
    id: '011353-001',
    school: '전자정보공학대학',
    name: '회로이론및실습',
  },
  {
    id: '011875-001',
    school: '전자정보공학대학',
    name: 'AI반도체설계',
  },
  {
    id: '011876-001',
    school: '전자정보공학대학',
    name: 'AI반도체소자물리',
  },
  {
    id: '011839-001',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '000304-001',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '001725-001',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '009913-001',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-002',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '011839-001',
    school: '사회과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '008712-001',
    school: '사회과학대학',
    name: '인권과법',
  },
  {
    id: '010691-001',
    school: '연계전공',
    name: 'BA 데이터애널리틱스',
  },
  {
    id: '010692-001',
    school: '연계전공',
    name: 'BA 데이터시각화',
  },
  {
    id: '011256-001',
    school: '연계전공',
    name: 'BA 소비자분석',
  },
  {
    id: '010118-001',
    school: '연계전공',
    name: 'SM-디지털영상의합성과편집',
  },
  {
    id: '010612-001',
    school: '연계전공',
    name: 'SM-캡스톤디자인',
  },
  {
    id: '011839-001',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '000304-001',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '000304-002',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '001725-001',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '009913-001',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-002',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '011839-001',
    school: '자연과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '자연과학대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '001362-001',
    school: '자연과학대학',
    name: '미적분학2',
  },
  {
    id: '001362-002',
    school: '자연과학대학',
    name: '미적분학2',
  },
  {
    id: '001362-003',
    school: '자연과학대학',
    name: '미적분학2',
  },
  {
    id: '011631-001',
    school: '자연과학대학',
    name: '기초통계학',
  },
  {
    id: '011631-002',
    school: '자연과학대학',
    name: '기초통계학',
  },
  {
    id: '011631-003',
    school: '자연과학대학',
    name: '기초통계학',
  },
  {
    id: '001728-001',
    school: '자연과학대학',
    name: '선형대수학2',
  },
  {
    id: '001728-002',
    school: '자연과학대학',
    name: '선형대수학2',
  },
  {
    id: '003971-001',
    school: '자연과학대학',
    name: '확률론',
  },
  {
    id: '003971-002',
    school: '자연과학대학',
    name: '확률론',
  },
  {
    id: '003444-001',
    school: '자연과학대학',
    name: '프로그래밍실습',
  },
  {
    id: '006596-001',
    school: '자연과학대학',
    name: '해석학개론2',
  },
  {
    id: '011274-001',
    school: '자연과학대학',
    name: '계산수학2',
  },
  {
    id: '002998-001',
    school: '자연과학대학',
    name: '정수론',
  },
  {
    id: '004030-001',
    school: '자연과학대학',
    name: '회귀분석2',
  },
  {
    id: '004311-001',
    school: '자연과학대학',
    name: '수리통계학2',
  },
  {
    id: '004335-001',
    school: '자연과학대학',
    name: '실험계획법',
  },
  {
    id: '005599-001',
    school: '자연과학대학',
    name: '현대대수학2',
  },
  {
    id: '005895-001',
    school: '자연과학대학',
    name: '복소수해석학',
  },
  {
    id: '010631-001',
    school: '연계전공',
    name: 'ST-자료구조/데이터베이스',
  },
  {
    id: '010636-001',
    school: '연계전공',
    name: 'ST-캡스톤디자인',
  },
  {
    id: '011223-001',
    school: '연계전공',
    name: '시스템생명공학캡스톤디자인Ⅱ',
  },
  {
    id: '011096-001',
    school: '연계전공',
    name: '에듀테크빅데이터의이해와분석',
  },
  {
    id: '010716-001',
    school: '연계전공',
    name: '디지털필름메이킹2',
  },
  {
    id: '010716-002',
    school: '연계전공',
    name: '디지털필름메이킹2',
  },
  {
    id: '011230-001',
    school: '연계전공',
    name: '모션그래픽스2:프로젝트',
  },
  {
    id: '011230-002',
    school: '연계전공',
    name: '모션그래픽스2:프로젝트',
  },
  {
    id: '011230-003',
    school: '연계전공',
    name: '모션그래픽스2:프로젝트',
  },
  {
    id: '011232-001',
    school: '연계전공',
    name: '3D영상디자인',
  },
  {
    id: '011232-002',
    school: '연계전공',
    name: '3D영상디자인',
  },
  {
    id: '010719-001',
    school: '연계전공',
    name: '영상디자인스튜디오2',
  },
  {
    id: '011099-001',
    school: '연계전공',
    name: '문화예술교육개론',
  },
  {
    id: '011100-001',
    school: '연계전공',
    name: '문화예술교육현장의이해와실습',
  },
  {
    id: '004642-001',
    school: '공과대학',
    name: '동역학',
  },
  {
    id: '004642-002',
    school: '공과대학',
    name: '동역학',
  },
  {
    id: '011398-001',
    school: '공과대학',
    name: '공기역학',
  },
  {
    id: '011398-002',
    school: '공과대학',
    name: '공기역학',
  },
  {
    id: '009239-001',
    school: '공과대학',
    name: '항공우주응용SW1',
  },
  {
    id: '009239-002',
    school: '공과대학',
    name: '항공우주응용SW1',
  },
  {
    id: '011839-001',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '004325-001',
    school: '공과대학',
    name: '공업역학',
  },
  {
    id: '011839-001',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '000304-001',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '000304-002',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '000304-003',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '000304-004',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '001725-001',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '001725-002',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '001725-003',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '001725-004',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '009913-001',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-002',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-003',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-004',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '011839-001',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-003',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '000304-001',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '000304-002',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '000304-003',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '000304-004',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '001725-001',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '001725-002',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '001725-003',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '001725-004',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '009913-001',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-002',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-003',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-004',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '011839-001',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '000304-001',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '001725-001',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '009913-001',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009954-001',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '009954-002',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '009954-003',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '009954-004',
    school: '소프트웨어융합대학',
    name: '알고리즘및실습',
  },
  {
    id: '009959-001',
    school: '소프트웨어융합대학',
    name: '확률통계및프로그래밍',
  },
  {
    id: '009959-002',
    school: '소프트웨어융합대학',
    name: '확률통계및프로그래밍',
  },
  {
    id: '009959-003',
    school: '소프트웨어융합대학',
    name: '확률통계및프로그래밍',
  },
  {
    id: '009959-004',
    school: '소프트웨어융합대학',
    name: '확률통계및프로그래밍',
  },
  {
    id: '005130-001',
    school: '소프트웨어융합대학',
    name: 'JAVA프로그래밍',
  },
  {
    id: '005246-001',
    school: '소프트웨어융합대학',
    name: '신호및시스템',
  },
  {
    id: '005246-002',
    school: '소프트웨어융합대학',
    name: '신호및시스템',
  },
  {
    id: '005246-003',
    school: '소프트웨어융합대학',
    name: '신호및시스템',
  },
  {
    id: '006237-001',
    school: '소프트웨어융합대학',
    name: '웹프로그래밍',
  },
  {
    id: '006237-002',
    school: '소프트웨어융합대학',
    name: '웹프로그래밍',
  },
  {
    id: '009658-001',
    school: '소프트웨어융합대학',
    name: '전기회로실험',
  },
  {
    id: '009658-002',
    school: '소프트웨어융합대학',
    name: '전기회로실험',
  },
  {
    id: '010226-001',
    school: '소프트웨어융합대학',
    name: '동적시스템모델링',
  },
  {
    id: '010226-002',
    school: '소프트웨어융합대학',
    name: '동적시스템모델링',
  },
  {
    id: '011839-001',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '005253-001',
    school: '인공지능융합대학',
    name: '만화기초2',
  },
  {
    id: '005253-002',
    school: '인공지능융합대학',
    name: '만화기초2',
  },
  {
    id: '008786-001',
    school: '인공지능융합대학',
    name: '애니메이션기초2',
  },
  {
    id: '008786-002',
    school: '인공지능융합대학',
    name: '애니메이션기초2',
  },
  {
    id: '008786-003',
    school: '인공지능융합대학',
    name: '애니메이션기초2',
  },
  {
    id: '010560-001',
    school: '인공지능융합대학',
    name: '창의SW융합노마드',
  },
  {
    id: '010309-001',
    school: '인공지능융합대학',
    name: '프로덕트디자인1',
  },
  {
    id: '010309-002',
    school: '인공지능융합대학',
    name: '프로덕트디자인1',
  },
  {
    id: '010311-001',
    school: '인공지능융합대학',
    name: '비주얼커뮤니케이션디자인1',
  },
  {
    id: '010311-002',
    school: '인공지능융합대학',
    name: '비주얼커뮤니케이션디자인1',
  },
  {
    id: '011839-001',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-002',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-003',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-004',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-005',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '011839-006',
    school: '인공지능융합대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '000304-001',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '000304-002',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '000304-003',
    school: '인공지능융합대학',
    name: '공업수학1',
  },
  {
    id: '001725-001',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '001725-002',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '001725-003',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '001725-004',
    school: '인공지능융합대학',
    name: '선형대수',
  },
  {
    id: '009913-001',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-002',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-003',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-004',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-005',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-006',
    school: '인공지능융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '011839-001',
    school: '공과대학',
    name: '세종인을위한전공탐색',
  },
  {
    id: '008489-001',
    school: '공과대학',
    name: '항공전사',
  },
  {
    id: '009040-001',
    school: '공과대학',
    name: '항공우주무기체계',
  },
  {
    id: '011069-001',
    school: '공과대학',
    name: '일반비행이론',
  },
  {
    id: '011071-001',
    school: '공과대학',
    name: '항공전략론',
  },
  {
    id: '011377-001',
    school: '공과대학',
    name: '비행기초역학2',
  },
  {
    id: '011398-001',
    school: '공과대학',
    name: '공기역학',
  },
];
