const courseList = [
  {
    id: '009045-001',
    school: '대양휴머니티칼리지',
    name: '창업과기업가정신1',
  },
  {
    id: '009045-002',
    school: '대양휴머니티칼리지',
    name: '창업과기업가정신1',
  },
  {
    id: '009045-003',
    school: '대양휴머니티칼리지',
    name: '창업과기업가정신1',
  },
  {
    id: '009045-004',
    school: '대양휴머니티칼리지',
    name: '창업과기업가정신1',
  },
  {
    id: '009065-001',
    school: '대양휴머니티칼리지',
    name: 'English Writing 1',
  },
  {
    id: '009065-002',
    school: '대양휴머니티칼리지',
    name: 'English Writing 1',
  },
  {
    id: '009066-001',
    school: '대양휴머니티칼리지',
    name: 'English Writing 2',
  },
  {
    id: '009067-001',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-002',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-003',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-004',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-005',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-006',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-007',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-008',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-009',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-010',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-011',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-012',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-013',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-014',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-015',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-016',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-017',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-018',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-019',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-020',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-021',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-022',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-023',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-024',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-025',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-026',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-027',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-028',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-029',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-030',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-031',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-032',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-033',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-034',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-035',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-036',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-037',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-038',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-039',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009067-040',
    school: '대양휴머니티칼리지',
    name: '문제해결을위한글쓰기와발표',
  },
  {
    id: '009068-001',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-002',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-003',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-004',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-005',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-006',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-007',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-008',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-009',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-010',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-011',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-012',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-013',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-014',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-015',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-016',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-017',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-018',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-019',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-020',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-021',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-022',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-023',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-024',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-025',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-026',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-027',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-028',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-029',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-030',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-031',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-032',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-033',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-034',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-035',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-036',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009068-037',
    school: '대양휴머니티칼리지',
    name: '서양철학:쟁점과토론',
  },
  {
    id: '009352-001',
    school: '대양휴머니티칼리지',
    name: '사고와표현1',
  },
  {
    id: '009352-002',
    school: '대양휴머니티칼리지',
    name: '사고와표현1',
  },
  {
    id: '009352-003',
    school: '대양휴머니티칼리지',
    name: '사고와표현1',
  },
  {
    id: '009352-004',
    school: '대양휴머니티칼리지',
    name: '사고와표현1',
  },
  {
    id: '009352-005',
    school: '대양휴머니티칼리지',
    name: '사고와표현1',
  },
  {
    id: '009352-006',
    school: '대양휴머니티칼리지',
    name: '사고와표현1',
  },
  {
    id: '009352-007',
    school: '대양휴머니티칼리지',
    name: '사고와표현1',
  },
  {
    id: '009353-001',
    school: '대양휴머니티칼리지',
    name: '사고와표현2',
  },
  {
    id: '009353-002',
    school: '대양휴머니티칼리지',
    name: '사고와표현2',
  },
  {
    id: '009353-003',
    school: '대양휴머니티칼리지',
    name: '사고와표현2',
  },
  {
    id: '009353-004',
    school: '대양휴머니티칼리지',
    name: '사고와표현2',
  },
  {
    id: '009353-005',
    school: '대양휴머니티칼리지',
    name: '사고와표현2',
  },
  {
    id: '009353-006',
    school: '대양휴머니티칼리지',
    name: '사고와표현2',
  },
  {
    id: '009353-007',
    school: '대양휴머니티칼리지',
    name: '사고와표현2',
  },
  {
    id: '009354-001',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화1',
  },
  {
    id: '009354-002',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화1',
  },
  {
    id: '009354-003',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화1',
  },
  {
    id: '009354-004',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화1',
  },
  {
    id: '009354-005',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화1',
  },
  {
    id: '009354-006',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화1',
  },
  {
    id: '009354-007',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화1',
  },
  {
    id: '009355-001',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화2',
  },
  {
    id: '009355-002',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화2',
  },
  {
    id: '009355-003',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화2',
  },
  {
    id: '009355-004',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화2',
  },
  {
    id: '009355-005',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화2',
  },
  {
    id: '009355-006',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화2',
  },
  {
    id: '009355-007',
    school: '대양휴머니티칼리지',
    name: '한국의언어와문화2',
  },
  {
    id: '009356-001',
    school: '대양휴머니티칼리지',
    name: '한국전통문화의이해',
  },
  {
    id: '009356-002',
    school: '대양휴머니티칼리지',
    name: '한국전통문화의이해',
  },
  {
    id: '009356-003',
    school: '대양휴머니티칼리지',
    name: '한국전통문화의이해',
  },
  {
    id: '009356-004',
    school: '대양휴머니티칼리지',
    name: '한국전통문화의이해',
  },
  {
    id: '009357-001',
    school: '대양휴머니티칼리지',
    name: '서양철학의이해',
  },
  {
    id: '009357-002',
    school: '대양휴머니티칼리지',
    name: '서양철학의이해',
  },
  {
    id: '009357-003',
    school: '대양휴머니티칼리지',
    name: '서양철학의이해',
  },
  {
    id: '010352-001',
    school: '대양휴머니티칼리지',
    name: 'English Listening Practice 1',
  },
  {
    id: '010352-002',
    school: '대양휴머니티칼리지',
    name: 'English Listening Practice 1',
  },
  {
    id: '010354-001',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-002',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '010354-003',
    school: '대양휴머니티칼리지',
    name: 'English Reading Practice 1',
  },
  {
    id: '011238-001',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011238-002',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011238-003',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011238-004',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011238-005',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011238-006',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011238-007',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011238-008',
    school: '대양휴머니티칼리지',
    name: '우주자연인간',
  },
  {
    id: '011304-001',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-002',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-003',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-004',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-005',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-006',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-007',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-008',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-009',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-010',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-011',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-012',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-013',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-014',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-015',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-016',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-017',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-018',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-019',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-020',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-021',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-022',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-023',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-024',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-025',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-026',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-027',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-028',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-029',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-030',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-031',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-032',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-033',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-034',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-035',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-036',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-037',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-038',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-039',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-040',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-041',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-042',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-043',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-044',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-045',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-046',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-047',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-048',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-049',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-050',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-051',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-052',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-053',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-054',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-055',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-056',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-057',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-058',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-059',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-060',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011304-061',
    school: '대양휴머니티칼리지',
    name: '대학영어',
  },
  {
    id: '011614-001',
    school: '대양휴머니티칼리지',
    name: '세종인을위한진로설계',
  },
  {
    id: '011614-002',
    school: '대양휴머니티칼리지',
    name: '세종인을위한진로설계',
  },
  {
    id: '011614-003',
    school: '대양휴머니티칼리지',
    name: '세종인을위한진로설계',
  },
  {
    id: '011614-004',
    school: '대양휴머니티칼리지',
    name: '세종인을위한진로설계',
  },
  {
    id: '011614-005',
    school: '대양휴머니티칼리지',
    name: '세종인을위한진로설계',
  },
  {
    id: '011614-006',
    school: '대양휴머니티칼리지',
    name: '세종인을위한진로설계',
  },
  {
    id: '011614-007',
    school: '대양휴머니티칼리지',
    name: '세종인을위한진로설계',
  },
  {
    id: '000304-001',
    school: '대양휴머니티칼리지',
    name: '공업수학1',
  },
  {
    id: '000304-002',
    school: '대양휴머니티칼리지',
    name: '공업수학1',
  },
  {
    id: '000304-003',
    school: '대양휴머니티칼리지',
    name: '공업수학1',
  },
  {
    id: '000304-004',
    school: '대양휴머니티칼리지',
    name: '공업수학1',
  },
  {
    id: '000304-005',
    school: '대양휴머니티칼리지',
    name: '공업수학1',
  },
  {
    id: '000304-006',
    school: '대양휴머니티칼리지',
    name: '공업수학1',
  },
  {
    id: '000304-007',
    school: '대양휴머니티칼리지',
    name: '공업수학1',
  },
  {
    id: '000304-008',
    school: '대양휴머니티칼리지',
    name: '공업수학1',
  },
  {
    id: '000304-009',
    school: '대양휴머니티칼리지',
    name: '공업수학1',
  },
  {
    id: '000304-010',
    school: '대양휴머니티칼리지',
    name: '공업수학1',
  },
  {
    id: '000304-011',
    school: '대양휴머니티칼리지',
    name: '공업수학1',
  },
  {
    id: '000307-001',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-002',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-003',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-004',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-005',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '000307-006',
    school: '대양휴머니티칼리지',
    name: '공업수학2',
  },
  {
    id: '001357-001',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-002',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-003',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-004',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-005',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-006',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-007',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-008',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-009',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-010',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-011',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-012',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-013',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-014',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-015',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-016',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-017',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-018',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-019',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-020',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-021',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-022',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-023',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-024',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-025',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-026',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001357-027',
    school: '대양휴머니티칼리지',
    name: '미적분학1',
  },
  {
    id: '001362-001',
    school: '대양휴머니티칼리지',
    name: '미적분학2',
  },
  {
    id: '002638-001',
    school: '대양휴머니티칼리지',
    name: '일반물리학1',
  },
  {
    id: '002638-002',
    school: '대양휴머니티칼리지',
    name: '일반물리학1',
  },
  {
    id: '002638-003',
    school: '대양휴머니티칼리지',
    name: '일반물리학1',
  },
  {
    id: '002638-004',
    school: '대양휴머니티칼리지',
    name: '일반물리학1',
  },
  {
    id: '002657-001',
    school: '대양휴머니티칼리지',
    name: '일반생물학',
  },
  {
    id: '002657-002',
    school: '대양휴머니티칼리지',
    name: '일반생물학',
  },
  {
    id: '002705-001',
    school: '대양휴머니티칼리지',
    name: '일반화학1',
  },
  {
    id: '002705-002',
    school: '대양휴머니티칼리지',
    name: '일반화학1',
  },
  {
    id: '002705-003',
    school: '대양휴머니티칼리지',
    name: '일반화학1',
  },
  {
    id: '002705-004',
    school: '대양휴머니티칼리지',
    name: '일반화학1',
  },
  {
    id: '002705-005',
    school: '대양휴머니티칼리지',
    name: '일반화학1',
  },
  {
    id: '002705-006',
    school: '대양휴머니티칼리지',
    name: '일반화학1',
  },
  {
    id: '003353-001',
    school: '대양휴머니티칼리지',
    name: '통계학개론',
  },
  {
    id: '006098-001',
    school: '대양휴머니티칼리지',
    name: '기초미적분학',
  },
  {
    id: '011297-001',
    school: '대양휴머니티칼리지',
    name: '컴퓨터사고기반기초코딩',
  },
  {
    id: '011297-002',
    school: '대양휴머니티칼리지',
    name: '컴퓨터사고기반기초코딩',
  },
  {
    id: '011297-003',
    school: '대양휴머니티칼리지',
    name: '컴퓨터사고기반기초코딩',
  },
  {
    id: '011297-004',
    school: '대양휴머니티칼리지',
    name: '컴퓨터사고기반기초코딩',
  },
  {
    id: '011297-005',
    school: '대양휴머니티칼리지',
    name: '컴퓨터사고기반기초코딩',
  },
  {
    id: '011297-006',
    school: '대양휴머니티칼리지',
    name: '컴퓨터사고기반기초코딩',
  },
  {
    id: '011297-007',
    school: '대양휴머니티칼리지',
    name: '컴퓨터사고기반기초코딩',
  },
  {
    id: '011297-008',
    school: '대양휴머니티칼리지',
    name: '컴퓨터사고기반기초코딩',
  },
  {
    id: '011297-009',
    school: '대양휴머니티칼리지',
    name: '컴퓨터사고기반기초코딩',
  },
  {
    id: '011298-001',
    school: '대양휴머니티칼리지',
    name: 'SW기초코딩',
  },
  {
    id: '011298-002',
    school: '대양휴머니티칼리지',
    name: 'SW기초코딩',
  },
  {
    id: '011298-003',
    school: '대양휴머니티칼리지',
    name: 'SW기초코딩',
  },
  {
    id: '011298-004',
    school: '대양휴머니티칼리지',
    name: 'SW기초코딩',
  },
  {
    id: '011300-001',
    school: '대양휴머니티칼리지',
    name: '고급프로그래밍활용',
  },
  {
    id: '011300-002',
    school: '대양휴머니티칼리지',
    name: '고급프로그래밍활용',
  },
  {
    id: '011300-003',
    school: '대양휴머니티칼리지',
    name: '고급프로그래밍활용',
  },
  {
    id: '011300-004',
    school: '대양휴머니티칼리지',
    name: '고급프로그래밍활용',
  },
  {
    id: '011300-005',
    school: '대양휴머니티칼리지',
    name: '고급프로그래밍활용',
  },
  {
    id: '011526-001',
    school: '대양휴머니티칼리지',
    name: '사회과학수학',
  },
  {
    id: '011526-002',
    school: '대양휴머니티칼리지',
    name: '사회과학수학',
  },
  {
    id: '011526-003',
    school: '대양휴머니티칼리지',
    name: '사회과학수학',
  },
  {
    id: '011526-004',
    school: '대양휴머니티칼리지',
    name: '사회과학수학',
  },
  {
    id: '011526-005',
    school: '대양휴머니티칼리지',
    name: '사회과학수학',
  },
  {
    id: '011526-006',
    school: '대양휴머니티칼리지',
    name: '사회과학수학',
  },
  {
    id: '004558-001',
    school: '대양휴머니티칼리지',
    name: '채플1',
  },
  {
    id: '004777-001',
    school: '대양휴머니티칼리지',
    name: '채플3',
  },
  {
    id: '006270-001',
    school: '대양휴머니티칼리지',
    name: '동양의철학사상',
  },
  {
    id: '006279-001',
    school: '대양휴머니티칼리지',
    name: '정보사회의사이버윤리',
  },
  {
    id: '007210-001',
    school: '대양휴머니티칼리지',
    name: '역사와한국의영토',
  },
  {
    id: '008381-001',
    school: '대양휴머니티칼리지',
    name: '세종리더십',
  },
  {
    id: '008381-002',
    school: '대양휴머니티칼리지',
    name: '세종리더십',
  },
  {
    id: '008882-001',
    school: '대양휴머니티칼리지',
    name: '동서양의윤리',
  },
  {
    id: '008913-001',
    school: '대양휴머니티칼리지',
    name: '동양고전강독1',
  },
  {
    id: '008913-002',
    school: '대양휴머니티칼리지',
    name: '동양고전강독1',
  },
  {
    id: '008913-003',
    school: '대양휴머니티칼리지',
    name: '동양고전강독1',
  },
  {
    id: '008914-001',
    school: '대양휴머니티칼리지',
    name: '서양고전강독1',
  },
  {
    id: '008914-002',
    school: '대양휴머니티칼리지',
    name: '서양고전강독1',
  },
  {
    id: '008914-003',
    school: '대양휴머니티칼리지',
    name: '서양고전강독1',
  },
  {
    id: '008936-001',
    school: '대양휴머니티칼리지',
    name: '정치경제학의이해',
  },
  {
    id: '009031-001',
    school: '대양휴머니티칼리지',
    name: '한국현대사의이해',
  },
  {
    id: '009031-002',
    school: '대양휴머니티칼리지',
    name: '한국현대사의이해',
  },
  {
    id: '009033-001',
    school: '대양휴머니티칼리지',
    name: '독서토론',
  },
  {
    id: '009057-001',
    school: '대양휴머니티칼리지',
    name: '서양고전강독3',
  },
  {
    id: '009057-002',
    school: '대양휴머니티칼리지',
    name: '서양고전강독3',
  },
  {
    id: '009489-001',
    school: '대양휴머니티칼리지',
    name: '세계사:인간과문명',
  },
  {
    id: '009489-002',
    school: '대양휴머니티칼리지',
    name: '세계사:인간과문명',
  },
  {
    id: '009489-003',
    school: '대양휴머니티칼리지',
    name: '세계사:인간과문명',
  },
  {
    id: '009489-004',
    school: '대양휴머니티칼리지',
    name: '세계사:인간과문명',
  },
  {
    id: '009489-005',
    school: '대양휴머니티칼리지',
    name: '세계사:인간과문명',
  },
  {
    id: '009738-001',
    school: '대양휴머니티칼리지',
    name: '서양종교의이해',
  },
  {
    id: '009740-001',
    school: '대양휴머니티칼리지',
    name: '동양의철학사상-노장과불교',
  },
  {
    id: '009775-001',
    school: '대양휴머니티칼리지',
    name: '동양종교의이해',
  },
  {
    id: '009780-001',
    school: '대양휴머니티칼리지',
    name: '고전특강',
  },
  {
    id: '009780-002',
    school: '대양휴머니티칼리지',
    name: '고전특강',
  },
  {
    id: '009780-003',
    school: '대양휴머니티칼리지',
    name: '고전특강',
  },
  {
    id: '009780-004',
    school: '대양휴머니티칼리지',
    name: '고전특강',
  },
  {
    id: '009780-005',
    school: '대양휴머니티칼리지',
    name: '고전특강',
  },
  {
    id: '009938-001',
    school: '대양휴머니티칼리지',
    name: '동서양고전문학강독',
  },
  {
    id: '009938-002',
    school: '대양휴머니티칼리지',
    name: '동서양고전문학강독',
  },
  {
    id: '009938-003',
    school: '대양휴머니티칼리지',
    name: '동서양고전문학강독',
  },
  {
    id: '010357-001',
    school: '대양휴머니티칼리지',
    name: '수요집현강좌',
  },
  {
    id: '010359-001',
    school: '대양휴머니티칼리지',
    name: 'SHP고전강좌:Reading Intellectus 1',
  },
  {
    id: '010530-001',
    school: '대양휴머니티칼리지',
    name: 'SHP고전강좌:Writing Intellectus 1',
  },
  {
    id: '010652-001',
    school: '대양휴머니티칼리지',
    name: 'SHP고전강좌:Building Intellectus 1',
  },
  {
    id: '010663-001',
    school: '대양휴머니티칼리지',
    name: 'SHP고전강좌:Building Intellectus 2',
  },
  {
    id: '002074-001',
    school: '대양휴머니티칼리지',
    name: '여성학',
  },
  {
    id: '005991-001',
    school: '대양휴머니티칼리지',
    name: '스피치커뮤니케이션',
  },
  {
    id: '006422-001',
    school: '대양휴머니티칼리지',
    name: '성과문화',
  },
  {
    id: '006422-002',
    school: '대양휴머니티칼리지',
    name: '성과문화',
  },
  {
    id: '007345-001',
    school: '대양휴머니티칼리지',
    name: '미술심리치료',
  },
  {
    id: '007345-002',
    school: '대양휴머니티칼리지',
    name: '미술심리치료',
  },
  {
    id: '007565-001',
    school: '대양휴머니티칼리지',
    name: '우리차문화의이해',
  },
  {
    id: '007565-002',
    school: '대양휴머니티칼리지',
    name: '우리차문화의이해',
  },
  {
    id: '007565-003',
    school: '대양휴머니티칼리지',
    name: '우리차문화의이해',
  },
  {
    id: '007565-004',
    school: '대양휴머니티칼리지',
    name: '우리차문화의이해',
  },
  {
    id: '007565-005',
    school: '대양휴머니티칼리지',
    name: '우리차문화의이해',
  },
  {
    id: '007779-001',
    school: '대양휴머니티칼리지',
    name: '현대인의정신건강과자기발견',
  },
  {
    id: '008300-001',
    school: '대양휴머니티칼리지',
    name: '쟁점으로이해하는북한사회',
  },
  {
    id: '008887-001',
    school: '대양휴머니티칼리지',
    name: '언어와문명',
  },
  {
    id: '009251-001',
    school: '대양휴머니티칼리지',
    name: '중급미술심리치료',
  },
  {
    id: '009252-001',
    school: '대양휴머니티칼리지',
    name: '영상스토리텔링',
  },
  {
    id: '009778-001',
    school: '대양휴머니티칼리지',
    name: '경영학의이해',
  },
  {
    id: '009785-001',
    school: '대양휴머니티칼리지',
    name: '공간마케팅',
  },
  {
    id: '010356-001',
    school: '대양휴머니티칼리지',
    name: '대학생을위한실용금융',
  },
  {
    id: '010358-001',
    school: '대양휴머니티칼리지',
    name: '행복한가정만들기',
  },
  {
    id: '010407-001',
    school: '대양휴머니티칼리지',
    name: '시사로보는경제이야기',
  },
  {
    id: '010412-001',
    school: '대양휴머니티칼리지',
    name: 'K-MOOC:콘텐츠산업의비즈니스전략',
  },
  {
    id: '011257-001',
    school: '대양휴머니티칼리지',
    name: '시사미디어한국어',
  },
  {
    id: '011410-001',
    school: '대양휴머니티칼리지',
    name: '민속담화를통한다문화의이해',
  },
  {
    id: '003129-001',
    school: '대양휴머니티칼리지',
    name: '지구과학개론',
  },
  {
    id: '004763-001',
    school: '대양휴머니티칼리지',
    name: '과학사',
  },
  {
    id: '004763-002',
    school: '대양휴머니티칼리지',
    name: '과학사',
  },
  {
    id: '004763-003',
    school: '대양휴머니티칼리지',
    name: '과학사',
  },
  {
    id: '004921-001',
    school: '대양휴머니티칼리지',
    name: '미생물의세계',
  },
  {
    id: '005106-001',
    school: '대양휴머니티칼리지',
    name: '생명의미시적세계',
  },
  {
    id: '005541-001',
    school: '대양휴머니티칼리지',
    name: '식물의세계',
  },
  {
    id: '008885-001',
    school: '대양휴머니티칼리지',
    name: '과학기술과사회',
  },
  {
    id: '008890-001',
    school: '대양휴머니티칼리지',
    name: '천문학의세계',
  },
  {
    id: '008890-002',
    school: '대양휴머니티칼리지',
    name: '천문학의세계',
  },
  {
    id: '008892-001',
    school: '대양휴머니티칼리지',
    name: '생명과학의미래',
  },
  {
    id: '008966-001',
    school: '대양휴머니티칼리지',
    name: '꽃의세계',
  },
  {
    id: '009936-001',
    school: '대양휴머니티칼리지',
    name: 'Technical Writing기초',
  },
  {
    id: '009936-002',
    school: '대양휴머니티칼리지',
    name: 'Technical Writing기초',
  },
  {
    id: '009936-003',
    school: '대양휴머니티칼리지',
    name: 'Technical Writing기초',
  },
  {
    id: '010361-001',
    school: '대양휴머니티칼리지',
    name: '먹고즐기는자연',
  },
  {
    id: '010363-001',
    school: '대양휴머니티칼리지',
    name: '곤충의새로운가치',
  },
  {
    id: '010542-001',
    school: '대양휴머니티칼리지',
    name: 'K-MOOC:일반인을위한물리코딩',
  },
  {
    id: '010668-001',
    school: '대양휴머니티칼리지',
    name: '자연지리학의이해',
  },
  {
    id: '010798-001',
    school: '대양휴머니티칼리지',
    name: '융합적사고에기반한이공계글쓰기',
  },
  {
    id: '011416-001',
    school: '대양휴머니티칼리지',
    name: '생활속의물리',
  },
  {
    id: '011617-001',
    school: '대양휴머니티칼리지',
    name: '화학의세계',
  },
  {
    id: '011845-001',
    school: '대양휴머니티칼리지',
    name: '공학기술사',
  },
  {
    id: '006214-001',
    school: '대양휴머니티칼리지',
    name: '일본어1',
  },
  {
    id: '006214-002',
    school: '대양휴머니티칼리지',
    name: '일본어1',
  },
  {
    id: '006214-003',
    school: '대양휴머니티칼리지',
    name: '일본어1',
  },
  {
    id: '006844-001',
    school: '대양휴머니티칼리지',
    name: 'Intensive English',
  },
  {
    id: '006844-002',
    school: '대양휴머니티칼리지',
    name: 'Intensive English',
  },
  {
    id: '006844-003',
    school: '대양휴머니티칼리지',
    name: 'Intensive English',
  },
  {
    id: '006844-004',
    school: '대양휴머니티칼리지',
    name: 'Intensive English',
  },
  {
    id: '007207-001',
    school: '대양휴머니티칼리지',
    name: '기초중국어1',
  },
  {
    id: '007207-002',
    school: '대양휴머니티칼리지',
    name: '기초중국어1',
  },
  {
    id: '007207-003',
    school: '대양휴머니티칼리지',
    name: '기초중국어1',
  },
  {
    id: '007208-001',
    school: '대양휴머니티칼리지',
    name: '기초중국어2',
  },
  {
    id: '007214-001',
    school: '대양휴머니티칼리지',
    name: '글로벌잉글리쉬1',
  },
  {
    id: '007321-001',
    school: '대양휴머니티칼리지',
    name: '생활일본어',
  },
  {
    id: '007321-002',
    school: '대양휴머니티칼리지',
    name: '생활일본어',
  },
  {
    id: '007338-001',
    school: '대양휴머니티칼리지',
    name: '중국의정치경제와사회',
  },
  {
    id: '007399-001',
    school: '대양휴머니티칼리지',
    name: '영상매체속의영어',
  },
  {
    id: '007399-002',
    school: '대양휴머니티칼리지',
    name: '영상매체속의영어',
  },
  {
    id: '007401-001',
    school: '대양휴머니티칼리지',
    name: '영어발음연습',
  },
  {
    id: '007401-002',
    school: '대양휴머니티칼리지',
    name: '영어발음연습',
  },
  {
    id: '007503-001',
    school: '대양휴머니티칼리지',
    name: '영어읽기연습',
  },
  {
    id: '007503-002',
    school: '대양휴머니티칼리지',
    name: '영어읽기연습',
  },
  {
    id: '007503-003',
    school: '대양휴머니티칼리지',
    name: '영어읽기연습',
  },
  {
    id: '007503-004',
    school: '대양휴머니티칼리지',
    name: '영어읽기연습',
  },
  {
    id: '007504-001',
    school: '대양휴머니티칼리지',
    name: '영어듣기연습',
  },
  {
    id: '007504-002',
    school: '대양휴머니티칼리지',
    name: '영어듣기연습',
  },
  {
    id: '007504-003',
    school: '대양휴머니티칼리지',
    name: '영어듣기연습',
  },
  {
    id: '008895-001',
    school: '대양휴머니티칼리지',
    name: 'EU의정치경제와사회',
  },
  {
    id: '008898-001',
    school: '대양휴머니티칼리지',
    name: '영어로하는프리젠테이션',
  },
  {
    id: '009048-001',
    school: '대양휴머니티칼리지',
    name: '글로벌잉글리쉬1(심화)',
  },
  {
    id: '009048-002',
    school: '대양휴머니티칼리지',
    name: '글로벌잉글리쉬1(심화)',
  },
  {
    id: '009073-001',
    school: '대양휴머니티칼리지',
    name: 'English Speaking Strategies(TS) 1',
  },
  {
    id: '009073-002',
    school: '대양휴머니티칼리지',
    name: 'English Speaking Strategies(TS) 1',
  },
  {
    id: '009073-003',
    school: '대양휴머니티칼리지',
    name: 'English Speaking Strategies(TS) 1',
  },
  {
    id: '009259-001',
    school: '대양휴머니티칼리지',
    name: 'K-Pop Music 1',
  },
  {
    id: '009259-002',
    school: '대양휴머니티칼리지',
    name: 'K-Pop Music 1',
  },
  {
    id: '009265-001',
    school: '대양휴머니티칼리지',
    name: 'K-Pop Dance 1',
  },
  {
    id: '009265-002',
    school: '대양휴머니티칼리지',
    name: 'K-Pop Dance 1',
  },
  {
    id: '009345-001',
    school: '대양휴머니티칼리지',
    name: 'English Speaking Strategies(O) 1',
  },
  {
    id: '009345-002',
    school: '대양휴머니티칼리지',
    name: 'English Speaking Strategies(O) 1',
  },
  {
    id: '009345-003',
    school: '대양휴머니티칼리지',
    name: 'English Speaking Strategies(O) 1',
  },
  {
    id: '009981-001',
    school: '대양휴머니티칼리지',
    name: 'English Listening',
  },
  {
    id: '009982-001',
    school: '대양휴머니티칼리지',
    name: 'English Reading',
  },
  {
    id: '010531-001',
    school: '대양휴머니티칼리지',
    name: '세계시민정신',
  },
  {
    id: '010532-001',
    school: '대양휴머니티칼리지',
    name: '아시아공동체의이해',
  },
  {
    id: '011413-001',
    school: '대양휴머니티칼리지',
    name: '대학한국어글쓰기',
  },
  {
    id: '011613-001',
    school: '대양휴머니티칼리지',
    name: 'English Speaking Strategies(IS) 1',
  },
  {
    id: '011613-002',
    school: '대양휴머니티칼리지',
    name: 'English Speaking Strategies(IS) 1',
  },
  {
    id: '011615-001',
    school: '대양휴머니티칼리지',
    name: '지속가능발전목표(SDGs)의이해와실천',
  },
  {
    id: '005565-001',
    school: '대양휴머니티칼리지',
    name: '스쿼시',
  },
  {
    id: '006425-001',
    school: '대양휴머니티칼리지',
    name: '스포츠와대중매체',
  },
  {
    id: '006709-001',
    school: '대양휴머니티칼리지',
    name: '운동과다이어트',
  },
  {
    id: '006711-001',
    school: '대양휴머니티칼리지',
    name: '건강과삶',
  },
  {
    id: '007369-001',
    school: '대양휴머니티칼리지',
    name: '발레의이해와감상',
  },
  {
    id: '009061-001',
    school: '대양휴머니티칼리지',
    name: '웰빙레저스포츠',
  },
  {
    id: '009453-001',
    school: '대양휴머니티칼리지',
    name: '보컬트레이닝',
  },
  {
    id: '009937-001',
    school: '대양휴머니티칼리지',
    name: '공간과인간:인문,예술,공학의융합',
  },
  {
    id: '010410-001',
    school: '대양휴머니티칼리지',
    name: 'K-MOOC:웨어러블컴퓨터디자인',
  },
  {
    id: '010666-001',
    school: '대양휴머니티칼리지',
    name: '세종인을위한오케스트라첫걸음',
  },
  {
    id: '011093-001',
    school: '대양휴머니티칼리지',
    name: '골프',
  },
  {
    id: '011324-001',
    school: '대양휴머니티칼리지',
    name: 'K-MOOC:인공지능콘텐츠아트프로듀싱',
  },
  {
    id: '007082-001',
    school: '대양휴머니티칼리지',
    name: '취업과진로',
  },
  {
    id: '007221-001',
    school: '대양휴머니티칼리지',
    name: '진로설정과자기계발',
  },
  {
    id: '008364-001',
    school: '대양휴머니티칼리지',
    name: '세종사회봉사1',
  },
  {
    id: '008364-002',
    school: '대양휴머니티칼리지',
    name: '세종사회봉사1',
  },
  {
    id: '008364-003',
    school: '대양휴머니티칼리지',
    name: '세종사회봉사1',
  },
  {
    id: '008365-001',
    school: '대양휴머니티칼리지',
    name: '세종사회봉사2',
  },
  {
    id: '009035-001',
    school: '대양휴머니티칼리지',
    name: '창업의이론과실제',
  },
  {
    id: '009046-001',
    school: '대양휴머니티칼리지',
    name: '글로벌잉글리쉬1(진로탐색)',
  },
  {
    id: '009046-002',
    school: '대양휴머니티칼리지',
    name: '글로벌잉글리쉬1(진로탐색)',
  },
  {
    id: '010083-001',
    school: '대양휴머니티칼리지',
    name: '취업전략및사회진출',
  },
  {
    id: '010083-002',
    school: '대양휴머니티칼리지',
    name: '취업전략및사회진출',
  },
  {
    id: '010539-001',
    school: '대양휴머니티칼리지',
    name: '애지헌강좌1',
  },
  {
    id: '010539-002',
    school: '대양휴머니티칼리지',
    name: '애지헌강좌1',
  },
  {
    id: '010539-003',
    school: '대양휴머니티칼리지',
    name: '애지헌강좌1',
  },
  {
    id: '010651-001',
    school: '대양휴머니티칼리지',
    name: '진로오딧세이',
  },
  {
    id: '501296-001',
    school: '대양휴머니티칼리지',
    name: '건강을지켜주는약초학',
  },
  {
    id: '501323-001',
    school: '대양휴머니티칼리지',
    name: '세계음식문화사산책',
  },
  {
    id: '501342-001',
    school: '대양휴머니티칼리지',
    name: '예술,역사를만나다-고대와근대',
  },
  {
    id: '501348-001',
    school: '대양휴머니티칼리지',
    name: '나에게꼭필요한심리학',
  },
  {
    id: '501358-001',
    school: '대양휴머니티칼리지',
    name: '진짜뉴스를찾아라!미디어·AI리터러시',
  },
  {
    id: '501359-001',
    school: '대양휴머니티칼리지',
    name: '현대인의건강라이프',
  },
  {
    id: '010418-001',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-002',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-003',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-004',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-005',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-006',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-007',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-008',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-009',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-010',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-011',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-012',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-013',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-014',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-015',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-016',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-017',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-018',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-019',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-020',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-021',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-022',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-023',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010418-024',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅰ',
  },
  {
    id: '010419-001',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-002',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-003',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-004',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-005',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-006',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-007',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-008',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-009',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-010',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-011',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-012',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-013',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-014',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-015',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010419-016',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅱ',
  },
  {
    id: '010420-001',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010420-002',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010420-003',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010420-004',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010420-005',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅲ',
  },
  {
    id: '010421-001',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅳ',
  },
  {
    id: '010421-002',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅳ',
  },
  {
    id: '010421-003',
    school: '대양휴머니티칼리지',
    name: '자기주도창의전공Ⅳ',
  },
  {
    id: '007849-001',
    school: '대양휴머니티칼리지',
    name: '교직소양을위한독서강좌1',
  },
  {
    id: '008334-001',
    school: '대양휴머니티칼리지',
    name: '교육봉사활동1',
  },
  {
    id: '008336-001',
    school: '대양휴머니티칼리지',
    name: '교육봉사활동3',
  },
  {
    id: '006937-001',
    school: '대양휴머니티칼리지',
    name: '한국현대사',
  },
  {
    id: '011305-001',
    school: '대양휴머니티칼리지',
    name: '동서양의사상과윤리',
  },
  {
    id: '011306-001',
    school: '대양휴머니티칼리지',
    name: '성서와기독교',
  },
  {
    id: '011307-001',
    school: '대양휴머니티칼리지',
    name: '세계사',
  },
  {
    id: '011308-001',
    school: '대양휴머니티칼리지',
    name: '생명과학의이해',
  },
  {
    id: '011309-001',
    school: '대양휴머니티칼리지',
    name: '수의세계',
  },
  {
    id: '011310-001',
    school: '대양휴머니티칼리지',
    name: '지구환경과기후변화',
  },
  {
    id: '011311-001',
    school: '대양휴머니티칼리지',
    name: '현대과학으로의초대',
  },
  {
    id: '011312-001',
    school: '대양휴머니티칼리지',
    name: '경영학',
  },
  {
    id: '011313-001',
    school: '대양휴머니티칼리지',
    name: '경제학',
  },
  {
    id: '011314-001',
    school: '대양휴머니티칼리지',
    name: '미디어빅뱅과방송',
  },
  {
    id: '011315-001',
    school: '대양휴머니티칼리지',
    name: '현대사회와법',
  },
  {
    id: '011316-001',
    school: '대양휴머니티칼리지',
    name: '융합예술의이해',
  },
  {
    id: '011317-001',
    school: '대양휴머니티칼리지',
    name: '컴퓨터게임과메타버스',
  },
  {
    id: '011318-001',
    school: '대양휴머니티칼리지',
    name: '한국의문화와한류',
  },
  {
    id: '011319-001',
    school: '대양휴머니티칼리지',
    name: '현대예술의이해',
  },
  {
    id: '011320-001',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-002',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-003',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-004',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-005',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-006',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-007',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011320-008',
    school: '대양휴머니티칼리지',
    name: '인공지능과빅데이터',
  },
  {
    id: '011322-001',
    school: '대양휴머니티칼리지',
    name: '고급인공지능활용',
  },
  {
    id: '000486-001',
    school: '대양휴머니티칼리지',
    name: '교육사회',
  },
  {
    id: '000486-002',
    school: '대양휴머니티칼리지',
    name: '교육사회',
  },
  {
    id: '000525-001',
    school: '대양휴머니티칼리지',
    name: '교육학개론',
  },
  {
    id: '000525-002',
    school: '대양휴머니티칼리지',
    name: '교육학개론',
  },
  {
    id: '011183-001',
    school: '대양휴머니티칼리지',
    name: '취창업과진로설계',
  },
  {
    id: '011183-002',
    school: '대양휴머니티칼리지',
    name: '취창업과진로설계',
  },
  {
    id: '011183-003',
    school: '대양휴머니티칼리지',
    name: '취창업과진로설계',
  },
  {
    id: '011183-004',
    school: '대양휴머니티칼리지',
    name: '취창업과진로설계',
  },
  {
    id: '011183-005',
    school: '대양휴머니티칼리지',
    name: '취창업과진로설계',
  },
  {
    id: '000464-001',
    school: '대양휴머니티칼리지',
    name: '교육과정',
  },
  {
    id: '000464-002',
    school: '대양휴머니티칼리지',
    name: '교육과정',
  },
  {
    id: '000520-001',
    school: '대양휴머니티칼리지',
    name: '교육평가',
  },
  {
    id: '000520-002',
    school: '대양휴머니티칼리지',
    name: '교육평가',
  },
  {
    id: '008283-001',
    school: '대양휴머니티칼리지',
    name: '교직실무',
  },
  {
    id: '008283-002',
    school: '대양휴머니티칼리지',
    name: '교직실무',
  },
  {
    id: '010653-001',
    school: '대양휴머니티칼리지',
    name: '안보학',
  },
  {
    id: '008276-001',
    school: '대양휴머니티칼리지',
    name: '학교현장실습',
  },
  {
    id: '008910-001',
    school: '대양휴머니티칼리지',
    name: '생활지도및상담',
  },
  {
    id: '008910-002',
    school: '대양휴머니티칼리지',
    name: '생활지도및상담',
  },
  {
    id: '010655-001',
    school: '대양휴머니티칼리지',
    name: '조직리더십',
  },
  {
    id: '004559-001',
    school: '인문과학대학',
    name: '한국문학의이해',
  },
  {
    id: '010434-001',
    school: '인문과학대학',
    name: '의사소통교육론',
  },
  {
    id: '000588-001',
    school: '인문과학대학',
    name: '국어문법론',
  },
  {
    id: '008355-001',
    school: '인문과학대학',
    name: '한국한문학의이해',
  },
  {
    id: '004564-001',
    school: '인문과학대학',
    name: '한국현대소설론',
  },
  {
    id: '008353-001',
    school: '인문과학대학',
    name: '한국문학의장르론',
  },
  {
    id: '005329-001',
    school: '인문과학대학',
    name: '국어교육론',
  },
  {
    id: '000596-001',
    school: '인문과학대학',
    name: '국어의미론',
  },
  {
    id: '006855-001',
    school: '인문과학대학',
    name: '한국현대시론',
  },
  {
    id: '007832-001',
    school: '인문과학대학',
    name: '국어교과교육론',
  },
  {
    id: '008363-001',
    school: '인문과학대학',
    name: '시조가사론',
  },
  {
    id: '008370-001',
    school: '인문과학대학',
    name: '독서교육론',
  },
  {
    id: '008371-001',
    school: '인문과학대학',
    name: '한국문학과문화콘텐츠',
  },
  {
    id: '010111-001',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '008416-001',
    school: '인문과학대학',
    name: '일본사회의이해',
  },
  {
    id: '009495-001',
    school: '인문과학대학',
    name: '중국어입문',
  },
  {
    id: '009495-002',
    school: '인문과학대학',
    name: '중국어입문',
  },
  {
    id: '010386-001',
    school: '인문과학대학',
    name: '시장경제의원리',
  },
  {
    id: '011487-001',
    school: '인문과학대학',
    name: '언어이야기',
  },
  {
    id: '011487-002',
    school: '인문과학대학',
    name: '언어이야기',
  },
  {
    id: '011639-001',
    school: '인문과학대학',
    name: '초급일본어1',
  },
  {
    id: '011639-002',
    school: '인문과학대학',
    name: '초급일본어1',
  },
  {
    id: '011778-001',
    school: '인문과학대학',
    name: '언어학과디지털휴머니티',
  },
  {
    id: '011778-002',
    school: '인문과학대학',
    name: '언어학과디지털휴머니티',
  },
  {
    id: '005840-001',
    school: '인문과학대학',
    name: '영어속의논리',
  },
  {
    id: '005840-002',
    school: '인문과학대학',
    name: '영어속의논리',
  },
  {
    id: '007514-001',
    school: '인문과학대학',
    name: '영문법의이해',
  },
  {
    id: '004891-001',
    school: '인문과학대학',
    name: '영미희곡',
  },
  {
    id: '008373-001',
    school: '인문과학대학',
    name: '영미작가이야기',
  },
  {
    id: '010366-001',
    school: '인문과학대학',
    name: '인지체계와의사소통능력',
  },
  {
    id: '007929-001',
    school: '인문과학대학',
    name: '영미소설의이해',
  },
  {
    id: '007819-001',
    school: '인문과학대학',
    name: '영국사회와문학',
  },
  {
    id: '007820-001',
    school: '인문과학대학',
    name: '영어음성음운론',
  },
  {
    id: '007821-001',
    school: '인문과학대학',
    name: '영어의미의흐름',
  },
  {
    id: '007833-001',
    school: '인문과학대학',
    name: '영어교과교육론',
  },
  {
    id: '007924-001',
    school: '인문과학대학',
    name: '영미시의이해',
  },
  {
    id: '010111-001',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '007909-001',
    school: '인문과학대학',
    name: '일본어문법',
  },
  {
    id: '010373-001',
    school: '인문과학대학',
    name: '일본어작문',
  },
  {
    id: '011638-001',
    school: '인문과학대학',
    name: '중급일본어',
  },
  {
    id: '008391-001',
    school: '인문과학대학',
    name: '일본어학의이해',
  },
  {
    id: '011634-001',
    school: '인문과학대학',
    name: '일본예술의이해',
  },
  {
    id: '011634-002',
    school: '인문과학대학',
    name: '일본예술의이해',
  },
  {
    id: '007834-001',
    school: '인문과학대학',
    name: '일본어교과교육론',
  },
  {
    id: '006408-001',
    school: '인문과학대학',
    name: '일본어능력시험',
  },
  {
    id: '008413-001',
    school: '인문과학대학',
    name: '현대일본과국제사회',
  },
  {
    id: '008413-002',
    school: '인문과학대학',
    name: '현대일본과국제사회',
  },
  {
    id: '010111-001',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '011636-001',
    school: '인문과학대학',
    name: '일본의정치와사회',
  },
  {
    id: '010387-001',
    school: '인문과학대학',
    name: '거시경제의이해',
  },
  {
    id: '010517-001',
    school: '인문과학대학',
    name: '동아시아근현대사',
  },
  {
    id: '007689-001',
    school: '인문과학대학',
    name: '중급중국어1',
  },
  {
    id: '009497-001',
    school: '인문과학대학',
    name: '중급중국어연습1',
  },
  {
    id: '008758-001',
    school: '인문과학대학',
    name: '중국어능력시험',
  },
  {
    id: '010518-001',
    school: '인문과학대학',
    name: '중한독해',
  },
  {
    id: '007749-001',
    school: '인문과학대학',
    name: '중국경제론',
  },
  {
    id: '008754-001',
    school: '인문과학대학',
    name: '중국대외경제관계론',
  },
  {
    id: '010519-001',
    school: '인문과학대학',
    name: '중한회화연습1',
  },
  {
    id: '010111-001',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010522-001',
    school: '인문과학대학',
    name: '경제신문독해',
  },
  {
    id: '010524-001',
    school: '인문과학대학',
    name: '한중기업경영론',
  },
  {
    id: '004445-001',
    school: '인문과학대학',
    name: '인류의선사문화',
  },
  {
    id: '011672-001',
    school: '인문과학대학',
    name: '역사와역사콘텐츠의이해',
  },
  {
    id: '003507-001',
    school: '인문과학대학',
    name: '한국고대사',
  },
  {
    id: '001646-001',
    school: '인문과학대학',
    name: '서양고대사',
  },
  {
    id: '010804-001',
    school: '인문과학대학',
    name: '서양근세문화사',
  },
  {
    id: '003518-001',
    school: '인문과학대학',
    name: '한국근세사',
  },
  {
    id: '007835-001',
    school: '인문과학대학',
    name: '역사교과교육론',
  },
  {
    id: '008321-001',
    school: '인문과학대학',
    name: '역사논리및논술',
  },
  {
    id: '010255-001',
    school: '인문과학대학',
    name: '동아시아근세사',
  },
  {
    id: '007746-001',
    school: '인문과학대학',
    name: '쟁점동양사',
  },
  {
    id: '008418-001',
    school: '인문과학대학',
    name: '쟁점서양사',
  },
  {
    id: '010111-001',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010258-001',
    school: '인문과학대학',
    name: '쟁점한국사',
  },
  {
    id: '008734-001',
    school: '인문과학대학',
    name: '교육학의탐구',
  },
  {
    id: '010808-001',
    school: '인문과학대학',
    name: '대학의이해',
  },
  {
    id: '005071-001',
    school: '인문과학대학',
    name: '교육철학의이해',
  },
  {
    id: '000451-001',
    school: '인문과학대학',
    name: '교수학습이론',
  },
  {
    id: '003402-001',
    school: '인문과학대학',
    name: '평생교육론',
  },
  {
    id: '003492-001',
    school: '인문과학대학',
    name: '학습심리학',
  },
  {
    id: '007251-001',
    school: '인문과학대학',
    name: '인적자원개발론',
  },
  {
    id: '006439-001',
    school: '인문과학대학',
    name: '기업교육론',
  },
  {
    id: '007813-001',
    school: '인문과학대학',
    name: '원격교육론',
  },
  {
    id: '007836-001',
    school: '인문과학대학',
    name: '교육학교과교육론',
  },
  {
    id: '010548-001',
    school: '인문과학대학',
    name: '진로상담의이해와실제',
  },
  {
    id: '006689-001',
    school: '인문과학대학',
    name: '학생상담의이론과실제',
  },
  {
    id: '007395-001',
    school: '인문과학대학',
    name: '최신학습설계이론',
  },
  {
    id: '007814-001',
    school: '인문과학대학',
    name: '교육평가론',
  },
  {
    id: '007856-001',
    school: '인문과학대학',
    name: '평생교육실습',
  },
  {
    id: '010111-001',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '인문과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '011302-001',
    school: '사회과학대학',
    name: '신입생세미나A',
  },
  {
    id: '011643-001',
    school: '사회과학대학',
    name: '융합사회의정부와행정',
  },
  {
    id: '011643-002',
    school: '사회과학대학',
    name: '융합사회의정부와행정',
  },
  {
    id: '002527-001',
    school: '사회과학대학',
    name: '인사행정론',
  },
  {
    id: '002527-002',
    school: '사회과학대학',
    name: '인사행정론',
  },
  {
    id: '009908-001',
    school: '사회과학대학',
    name: '조직론1',
  },
  {
    id: '009908-002',
    school: '사회과학대학',
    name: '조직론1',
  },
  {
    id: '003147-001',
    school: '사회과학대학',
    name: '지방행정론',
  },
  {
    id: '010349-001',
    school: '사회과학대학',
    name: '국제개발과협력',
  },
  {
    id: '011841-001',
    school: '사회과학대학',
    name: '행정통계분석(기초)',
  },
  {
    id: '011841-002',
    school: '사회과학대학',
    name: '행정통계분석(기초)',
  },
  {
    id: '003000-001',
    school: '사회과학대학',
    name: '정책론',
  },
  {
    id: '003000-002',
    school: '사회과학대학',
    name: '정책론',
  },
  {
    id: '000922-001',
    school: '사회과학대학',
    name: '도시행정론',
  },
  {
    id: '000922-002',
    school: '사회과학대학',
    name: '도시행정론',
  },
  {
    id: '003047-001',
    school: '사회과학대학',
    name: '조사방법론',
  },
  {
    id: '007596-001',
    school: '사회과학대학',
    name: '전자정부론',
  },
  {
    id: '007837-001',
    school: '사회과학대학',
    name: '일반사회교과교육론',
  },
  {
    id: '011644-001',
    school: '사회과학대학',
    name: 'AI시대의행정철학과윤리',
  },
  {
    id: '000288-001',
    school: '사회과학대학',
    name: '공기업론',
  },
  {
    id: '000288-002',
    school: '사회과학대학',
    name: '공기업론',
  },
  {
    id: '007183-001',
    school: '사회과학대학',
    name: '공법연습',
  },
  {
    id: '008616-001',
    school: '사회과학대학',
    name: '정책분석평가론',
  },
  {
    id: '010111-001',
    school: '사회과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '사회과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '사회과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '사회과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '사회과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '사회과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '011840-001',
    school: '사회과학대학',
    name: '복지정책론',
  },
  {
    id: '011302-001',
    school: '사회과학대학',
    name: '신입생세미나A',
  },
  {
    id: '011302-002',
    school: '사회과학대학',
    name: '신입생세미나A',
  },
  {
    id: '004208-001',
    school: '사회과학대학',
    name: '인간커뮤니케이션',
  },
  {
    id: '004208-002',
    school: '사회과학대학',
    name: '인간커뮤니케이션',
  },
  {
    id: '006691-001',
    school: '사회과학대학',
    name: '커뮤니케이션이론',
  },
  {
    id: '006691-002',
    school: '사회과학대학',
    name: '커뮤니케이션이론',
  },
  {
    id: '006348-001',
    school: '사회과학대학',
    name: '방송기획',
  },
  {
    id: '007396-001',
    school: '사회과학대학',
    name: '정보리터러시',
  },
  {
    id: '007396-002',
    school: '사회과학대학',
    name: '정보리터러시',
  },
  {
    id: '008427-001',
    school: '사회과학대학',
    name: '광고매체기획',
  },
  {
    id: '010261-001',
    school: '사회과학대학',
    name: '커뮤니케이션통계실무',
  },
  {
    id: '010261-002',
    school: '사회과학대학',
    name: '커뮤니케이션통계실무',
  },
  {
    id: '007404-001',
    school: '사회과학대학',
    name: '디지털미디어와사회',
  },
  {
    id: '007404-002',
    school: '사회과학대학',
    name: '디지털미디어와사회',
  },
  {
    id: '007407-001',
    school: '사회과학대학',
    name: '대중문화론',
  },
  {
    id: '007407-002',
    school: '사회과학대학',
    name: '대중문화론',
  },
  {
    id: '007519-001',
    school: '사회과학대학',
    name: '카피라이팅',
  },
  {
    id: '007519-002',
    school: '사회과학대학',
    name: '카피라이팅',
  },
  {
    id: '010470-001',
    school: '사회과학대학',
    name: '디지털저널리즘',
  },
  {
    id: '010471-001',
    school: '사회과학대학',
    name: 'PR론',
  },
  {
    id: '010471-002',
    school: '사회과학대학',
    name: 'PR론',
  },
  {
    id: '011248-001',
    school: '사회과학대학',
    name: '스타인플루언서마케팅',
  },
  {
    id: '007408-001',
    school: '사회과학대학',
    name: '미디어법제',
  },
  {
    id: '010111-001',
    school: '사회과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '사회과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '사회과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '사회과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '사회과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '사회과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '사회과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '사회과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010476-001',
    school: '사회과학대학',
    name: 'IMC전략과소비자',
  },
  {
    id: '010476-002',
    school: '사회과학대학',
    name: 'IMC전략과소비자',
  },
  {
    id: '010477-001',
    school: '사회과학대학',
    name: '영상제작워크샵',
  },
  {
    id: '011302-001',
    school: '경영경제대학',
    name: '신입생세미나A',
  },
  {
    id: '011302-002',
    school: '경영경제대학',
    name: '신입생세미나A',
  },
  {
    id: '000137-001',
    school: '경영경제대학',
    name: '경영학원론',
  },
  {
    id: '000137-002',
    school: '경영경제대학',
    name: '경영학원론',
  },
  {
    id: '000137-003',
    school: '경영경제대학',
    name: '경영학원론',
  },
  {
    id: '000137-004',
    school: '경영경제대학',
    name: '경영학원론',
  },
  {
    id: '000137-005',
    school: '경영경제대학',
    name: '경영학원론',
  },
  {
    id: '000137-006',
    school: '경영경제대학',
    name: '경영학원론',
  },
  {
    id: '000398-001',
    school: '경영경제대학',
    name: '관리회계',
  },
  {
    id: '000398-002',
    school: '경영경제대학',
    name: '관리회계',
  },
  {
    id: '000398-003',
    school: '경영경제대학',
    name: '관리회계',
  },
  {
    id: '000398-004',
    school: '경영경제대학',
    name: '관리회계',
  },
  {
    id: '000398-005',
    school: '경영경제대학',
    name: '관리회계',
  },
  {
    id: '000398-006',
    school: '경영경제대학',
    name: '관리회계',
  },
  {
    id: '002869-001',
    school: '경영경제대학',
    name: '재무관리',
  },
  {
    id: '002869-002',
    school: '경영경제대학',
    name: '재무관리',
  },
  {
    id: '002869-003',
    school: '경영경제대학',
    name: '재무관리',
  },
  {
    id: '002869-004',
    school: '경영경제대학',
    name: '재무관리',
  },
  {
    id: '004076-001',
    school: '경영경제대학',
    name: '마케팅관리',
  },
  {
    id: '004076-002',
    school: '경영경제대학',
    name: '마케팅관리',
  },
  {
    id: '004076-003',
    school: '경영경제대학',
    name: '마케팅관리',
  },
  {
    id: '004076-004',
    school: '경영경제대학',
    name: '마케팅관리',
  },
  {
    id: '004076-005',
    school: '경영경제대학',
    name: '마케팅관리',
  },
  {
    id: '004076-006',
    school: '경영경제대학',
    name: '마케팅관리',
  },
  {
    id: '004076-007',
    school: '경영경제대학',
    name: '마케팅관리',
  },
  {
    id: '004010-001',
    school: '경영경제대학',
    name: '회계원리2',
  },
  {
    id: '004010-002',
    school: '경영경제대학',
    name: '회계원리2',
  },
  {
    id: '004010-003',
    school: '경영경제대학',
    name: '회계원리2',
  },
  {
    id: '004010-004',
    school: '경영경제대학',
    name: '회계원리2',
  },
  {
    id: '004010-005',
    school: '경영경제대학',
    name: '회계원리2',
  },
  {
    id: '004010-006',
    school: '경영경제대학',
    name: '회계원리2',
  },
  {
    id: '004010-007',
    school: '경영경제대학',
    name: '회계원리2',
  },
  {
    id: '009253-001',
    school: '경영경제대학',
    name: '경영과학',
  },
  {
    id: '006799-001',
    school: '경영경제대학',
    name: '보험과리스크',
  },
  {
    id: '006799-002',
    school: '경영경제대학',
    name: '보험과리스크',
  },
  {
    id: '006799-003',
    school: '경영경제대학',
    name: '보험과리스크',
  },
  {
    id: '006858-001',
    school: '경영경제대학',
    name: '서비스마케팅',
  },
  {
    id: '007186-001',
    school: '경영경제대학',
    name: '인적자원관리',
  },
  {
    id: '007187-001',
    school: '경영경제대학',
    name: '조직관리',
  },
  {
    id: '007187-002',
    school: '경영경제대학',
    name: '조직관리',
  },
  {
    id: '007187-003',
    school: '경영경제대학',
    name: '조직관리',
  },
  {
    id: '007253-001',
    school: '경영경제대학',
    name: '기업윤리와사회적책임',
  },
  {
    id: '007436-001',
    school: '경영경제대학',
    name: '마케팅커뮤니케이션',
  },
  {
    id: '007436-002',
    school: '경영경제대학',
    name: '마케팅커뮤니케이션',
  },
  {
    id: '007436-003',
    school: '경영경제대학',
    name: '마케팅커뮤니케이션',
  },
  {
    id: '007478-001',
    school: '경영경제대학',
    name: '전사적자원관리',
  },
  {
    id: '007986-001',
    school: '경영경제대학',
    name: '비지니스인텔리전스',
  },
  {
    id: '007991-001',
    school: '경영경제대학',
    name: '서비스운영관리',
  },
  {
    id: '008437-001',
    school: '경영경제대학',
    name: '채권분석',
  },
  {
    id: '008437-002',
    school: '경영경제대학',
    name: '채권분석',
  },
  {
    id: '009255-001',
    school: '경영경제대학',
    name: '경영데이터관리',
  },
  {
    id: '009255-002',
    school: '경영경제대학',
    name: '경영데이터관리',
  },
  {
    id: '009872-001',
    school: '경영경제대학',
    name: '중급회계1',
  },
  {
    id: '009872-002',
    school: '경영경제대학',
    name: '중급회계1',
  },
  {
    id: '009872-003',
    school: '경영경제대학',
    name: '중급회계1',
  },
  {
    id: '009872-004',
    school: '경영경제대학',
    name: '중급회계1',
  },
  {
    id: '010391-001',
    school: '경영경제대학',
    name: '상업교과교육론',
  },
  {
    id: '010495-001',
    school: '경영경제대학',
    name: '상업교수법',
  },
  {
    id: '010615-001',
    school: '경영경제대학',
    name: '마케팅애널리틱스',
  },
  {
    id: '011386-001',
    school: '경영경제대학',
    name: 'ESG경영',
  },
  {
    id: '011386-002',
    school: '경영경제대학',
    name: 'ESG경영',
  },
  {
    id: '000834-001',
    school: '경영경제대학',
    name: '노사관계론',
  },
  {
    id: '003993-001',
    school: '경영경제대학',
    name: '회계감사',
  },
  {
    id: '006698-001',
    school: '경영경제대학',
    name: '공급사슬관리',
  },
  {
    id: '006698-002',
    school: '경영경제대학',
    name: '공급사슬관리',
  },
  {
    id: '006698-003',
    school: '경영경제대학',
    name: '공급사슬관리',
  },
  {
    id: '007756-001',
    school: '경영경제대학',
    name: '재무세미나',
  },
  {
    id: '008486-001',
    school: '경영경제대학',
    name: '리더십',
  },
  {
    id: '009258-001',
    school: '경영경제대학',
    name: '브랜드관리',
  },
  {
    id: '010111-001',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-009',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-010',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-011',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-012',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-013',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-014',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-015',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-016',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-017',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-018',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-019',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-020',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-021',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-022',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-023',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-024',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-025',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-026',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-027',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-028',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-029',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-030',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-031',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-032',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-033',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-034',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-035',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-036',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-037',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-038',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-039',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-040',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-041',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010486-001',
    school: '경영경제대학',
    name: '금융위험관리',
  },
  {
    id: '010486-002',
    school: '경영경제대학',
    name: '금융위험관리',
  },
  {
    id: '010492-001',
    school: '경영경제대학',
    name: '비즈니스애널리틱스',
  },
  {
    id: '010492-002',
    school: '경영경제대학',
    name: '비즈니스애널리틱스',
  },
  {
    id: '011302-001',
    school: '경영경제대학',
    name: '신입생세미나A',
  },
  {
    id: '000200-001',
    school: '경영경제대학',
    name: '경제학원론',
  },
  {
    id: '000200-002',
    school: '경영경제대학',
    name: '경제학원론',
  },
  {
    id: '000200-003',
    school: '경영경제대학',
    name: '경제학원론',
  },
  {
    id: '000200-004',
    school: '경영경제대학',
    name: '경제학원론',
  },
  {
    id: '000200-005',
    school: '경영경제대학',
    name: '경제학원론',
  },
  {
    id: '000200-006',
    school: '경영경제대학',
    name: '경제학원론',
  },
  {
    id: '000182-001',
    school: '경영경제대학',
    name: '경제통계',
  },
  {
    id: '000182-002',
    school: '경영경제대학',
    name: '경제통계',
  },
  {
    id: '001342-001',
    school: '경영경제대학',
    name: '미시경제학',
  },
  {
    id: '001342-002',
    school: '경영경제대학',
    name: '미시경제학',
  },
  {
    id: '008419-001',
    school: '경영경제대학',
    name: '경제사',
  },
  {
    id: '000209-001',
    school: '경영경제대학',
    name: '계량경제학',
  },
  {
    id: '000659-001',
    school: '경영경제대학',
    name: '국제무역론',
  },
  {
    id: '003498-001',
    school: '경영경제대학',
    name: '한국경제론',
  },
  {
    id: '007699-001',
    school: '경영경제대학',
    name: '공공경제학',
  },
  {
    id: '007837-001',
    school: '경영경제대학',
    name: '일반사회교과교육론',
  },
  {
    id: '010448-001',
    school: '경영경제대학',
    name: '빅데이터론',
  },
  {
    id: '000830-001',
    school: '경영경제대학',
    name: '노동경제학',
  },
  {
    id: '007379-001',
    school: '경영경제대학',
    name: '문화경제학',
  },
  {
    id: '007988-001',
    school: '경영경제대학',
    name: '게임이론',
  },
  {
    id: '010111-001',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-009',
    school: '경영경제대학',
    name: '졸업연구및진로1',
  },
  {
    id: '011302-001',
    school: '호텔관광대학',
    name: '신입생세미나A',
  },
  {
    id: '011302-002',
    school: '호텔관광대학',
    name: '신입생세미나A',
  },
  {
    id: '011618-001',
    school: '호텔관광대학',
    name: 'Hospitality경영원론',
  },
  {
    id: '011618-002',
    school: '호텔관광대학',
    name: 'Hospitality경영원론',
  },
  {
    id: '011618-003',
    school: '호텔관광대학',
    name: 'Hospitality경영원론',
  },
  {
    id: '011618-004',
    school: '호텔관광대학',
    name: 'Hospitality경영원론',
  },
  {
    id: '011618-005',
    school: '호텔관광대학',
    name: 'Hospitality경영원론',
  },
  {
    id: '011618-006',
    school: '호텔관광대학',
    name: 'Hospitality경영원론',
  },
  {
    id: '000309-001',
    school: '호텔관광대학',
    name: '관광경영론',
  },
  {
    id: '000309-002',
    school: '호텔관광대학',
    name: '관광경영론',
  },
  {
    id: '000309-003',
    school: '호텔관광대학',
    name: '관광경영론',
  },
  {
    id: '000309-004',
    school: '호텔관광대학',
    name: '관광경영론',
  },
  {
    id: '003855-001',
    school: '호텔관광대학',
    name: '호텔경영론',
  },
  {
    id: '003855-002',
    school: '호텔관광대학',
    name: '호텔경영론',
  },
  {
    id: '003855-003',
    school: '호텔관광대학',
    name: '호텔경영론',
  },
  {
    id: '003855-004',
    school: '호텔관광대학',
    name: '호텔경영론',
  },
  {
    id: '009614-001',
    school: '호텔관광대학',
    name: '호텔관광마케팅',
  },
  {
    id: '009614-002',
    school: '호텔관광대학',
    name: '호텔관광마케팅',
  },
  {
    id: '009614-004',
    school: '호텔관광대학',
    name: '호텔관광마케팅',
  },
  {
    id: '009614-005',
    school: '호텔관광대학',
    name: '호텔관광마케팅',
  },
  {
    id: '000362-001',
    school: '호텔관광대학',
    name: '관광자원론',
  },
  {
    id: '000362-002',
    school: '호텔관광대학',
    name: '관광자원론',
  },
  {
    id: '003866-001',
    school: '호텔관광대학',
    name: '호텔관광관리회계',
  },
  {
    id: '003866-002',
    school: '호텔관광대학',
    name: '호텔관광관리회계',
  },
  {
    id: '009888-001',
    school: '호텔관광대학',
    name: '축제경영연구',
  },
  {
    id: '010920-001',
    school: '호텔관광대학',
    name: 'HTM 컴퓨터프로그래밍',
  },
  {
    id: '004074-001',
    school: '호텔관광대학',
    name: '호텔관광재무관리',
  },
  {
    id: '004074-002',
    school: '호텔관광대학',
    name: '호텔관광재무관리',
  },
  {
    id: '007439-001',
    school: '호텔관광대학',
    name: '여가공간계획론',
  },
  {
    id: '007439-002',
    school: '호텔관광대학',
    name: '여가공간계획론',
  },
  {
    id: '007509-001',
    school: '호텔관광대학',
    name: '문화관광경영론',
  },
  {
    id: '007839-001',
    school: '호텔관광대학',
    name: '관광교과교육론',
  },
  {
    id: '009629-001',
    school: '호텔관광대학',
    name: '호텔관광커리어멘토링1',
  },
  {
    id: '009632-001',
    school: '호텔관광대학',
    name: '호텔관광e-business전략',
  },
  {
    id: '009772-001',
    school: '호텔관광대학',
    name: 'MICE산업론',
  },
  {
    id: '009772-002',
    school: '호텔관광대학',
    name: 'MICE산업론',
  },
  {
    id: '010686-001',
    school: '호텔관광대학',
    name: 'HTM 호스피탈리티스마트서비스',
  },
  {
    id: '010825-001',
    school: '호텔관광대학',
    name: 'HTM 스마트의사결정체계',
  },
  {
    id: '011116-001',
    school: '호텔관광대학',
    name: 'TPDM 디지털마케팅',
  },
  {
    id: '009904-001',
    school: '호텔관광대학',
    name: '호텔관광사례연구세미나',
  },
  {
    id: '009905-001',
    school: '호텔관광대학',
    name: '호텔관광기업가정신과리더쉽',
  },
  {
    id: '009905-002',
    school: '호텔관광대학',
    name: '호텔관광기업가정신과리더쉽',
  },
  {
    id: '010111-001',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-009',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-010',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-011',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-012',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-013',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-014',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-015',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-016',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-017',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-018',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010183-001',
    school: '호텔관광대학',
    name: '호텔관광의사결정방법론',
  },
  {
    id: '010184-001',
    school: '호텔관광대학',
    name: '호텔관광데이터분석',
  },
  {
    id: '010184-002',
    school: '호텔관광대학',
    name: '호텔관광데이터분석',
  },
  {
    id: '004469-001',
    school: '호텔관광대학',
    name: '조리원리',
  },
  {
    id: '004469-002',
    school: '호텔관광대학',
    name: '조리원리',
  },
  {
    id: '007385-001',
    school: '호텔관광대학',
    name: '외식산업경영론',
  },
  {
    id: '007385-002',
    school: '호텔관광대학',
    name: '외식산업경영론',
  },
  {
    id: '008453-001',
    school: '호텔관광대학',
    name: '기초한국조리실습',
  },
  {
    id: '009515-001',
    school: '호텔관광대학',
    name: '외식경영통계',
  },
  {
    id: '010684-001',
    school: '호텔관광대학',
    name: 'SFM 외식데이터분석',
  },
  {
    id: '011479-001',
    school: '호텔관광대학',
    name: '주류개론및응용',
  },
  {
    id: '007312-001',
    school: '호텔관광대학',
    name: '외국조리실습',
  },
  {
    id: '009765-001',
    school: '호텔관광대학',
    name: '바리스타및음료실습2',
  },
  {
    id: '011484-001',
    school: '호텔관광대학',
    name: 'F&B품질평가관리',
  },
  {
    id: '006463-001',
    school: '호텔관광대학',
    name: '레스토랑경영론',
  },
  {
    id: '010111-001',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '호텔관광대학',
    name: '졸업연구및진로1',
  },
  {
    id: '009113-001',
    school: '호텔관광대학',
    name: '경영학원론',
  },
  {
    id: '009114-001',
    school: '호텔관광대학',
    name: '마케팅원론',
  },
  {
    id: '009351-001',
    school: '호텔관광대학',
    name: '관광산업의이해',
  },
  {
    id: '009389-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무1',
  },
  {
    id: '011320-001',
    school: '호텔관광대학',
    name: '인공지능과빅데이터',
  },
  {
    id: '002077-001',
    school: '호텔관광대학',
    name: '여행사경영론',
  },
  {
    id: '003093-001',
    school: '호텔관광대학',
    name: '주류학',
  },
  {
    id: '007445-001',
    school: '호텔관광대학',
    name: '식음료원가관리',
  },
  {
    id: '009117-001',
    school: '호텔관광대학',
    name: 'HRT정책및관련법규',
  },
  {
    id: '009397-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무3',
  },
  {
    id: '003855-001',
    school: '호텔관광대학',
    name: '호텔경영론',
  },
  {
    id: '009118-001',
    school: '호텔관광대학',
    name: 'HRT프랜차이즈시스템및경영론',
  },
  {
    id: '006463-001',
    school: '호텔관광대학',
    name: '레스토랑경영론',
  },
  {
    id: '009127-001',
    school: '호텔관광대학',
    name: 'HRT소비자행동',
  },
  {
    id: '009399-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무5',
  },
  {
    id: '009401-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무7',
  },
  {
    id: '010192-001',
    school: '호텔관광대학',
    name: '음식관광기획론',
  },
  {
    id: '009114-001',
    school: '호텔관광대학',
    name: '마케팅원론',
  },
  {
    id: '009351-001',
    school: '호텔관광대학',
    name: '관광산업의이해',
  },
  {
    id: '009389-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무1',
  },
  {
    id: '011811-001',
    school: '호텔관광대학',
    name: '경영학이해',
  },
  {
    id: '003093-001',
    school: '호텔관광대학',
    name: '주류학',
  },
  {
    id: '006700-001',
    school: '호텔관광대학',
    name: '외식영양과건강',
  },
  {
    id: '009397-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무3',
  },
  {
    id: '010194-001',
    school: '호텔관광대학',
    name: '호텔연회기획과케이터링경영',
  },
  {
    id: '010554-001',
    school: '호텔관광대학',
    name: '고객커뮤니케이션전략',
  },
  {
    id: '007385-001',
    school: '호텔관광대학',
    name: '외식산업경영론',
  },
  {
    id: '009393-001',
    school: '호텔관광대학',
    name: '호텔외식마케팅',
  },
  {
    id: '009399-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무5',
  },
  {
    id: '009406-001',
    school: '호텔관광대학',
    name: '호텔외식인적자원관리',
  },
  {
    id: '010161-001',
    school: '호텔관광대학',
    name: '식품관련법규',
  },
  {
    id: '009401-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무7',
  },
  {
    id: '009405-001',
    school: '호텔관광대학',
    name: '호텔외식마케팅조사론',
  },
  {
    id: '009408-001',
    school: '호텔관광대학',
    name: '호텔외식컨설팅',
  },
  {
    id: '009553-001',
    school: '호텔관광대학',
    name: '음식과평론',
  },
  {
    id: '001938-001',
    school: '호텔관광대학',
    name: '식품재료학',
  },
  {
    id: '009389-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무1',
  },
  {
    id: '010837-001',
    school: '호텔관광대학',
    name: '조리기초실습',
  },
  {
    id: '011320-001',
    school: '호텔관광대학',
    name: '인공지능과빅데이터',
  },
  {
    id: '011791-001',
    school: '호텔관광대학',
    name: '식품안전관리시스템(FSMS)',
  },
  {
    id: '501229-001',
    school: '호텔관광대학',
    name: '세계음식문화사',
  },
  {
    id: '006700-001',
    school: '호텔관광대학',
    name: '외식영양과건강',
  },
  {
    id: '009397-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무3',
  },
  {
    id: '010194-001',
    school: '호텔관광대학',
    name: '호텔연회기획과케이터링경영',
  },
  {
    id: '010554-001',
    school: '호텔관광대학',
    name: '고객커뮤니케이션전략',
  },
  {
    id: '010865-001',
    school: '호텔관광대학',
    name: 'CoffeeBarista창업',
  },
  {
    id: '007385-001',
    school: '호텔관광대학',
    name: '외식산업경영론',
  },
  {
    id: '010844-001',
    school: '호텔관광대학',
    name: 'K-Food&세계요리실습',
  },
  {
    id: '010844-002',
    school: '호텔관광대학',
    name: 'K-Food&세계요리실습',
  },
  {
    id: '009399-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무5',
  },
  {
    id: '010875-001',
    school: '호텔관광대학',
    name: '메뉴기획과푸드플레이팅',
  },
  {
    id: '009387-001',
    school: '호텔관광대학',
    name: '호텔외식원가관리',
  },
  {
    id: '009401-001',
    school: '호텔관광대학',
    name: '호텔외식경영실무7',
  },
  {
    id: '009553-001',
    school: '호텔관광대학',
    name: '음식과평론',
  },
  {
    id: '010869-001',
    school: '호텔관광대학',
    name: '카페베이커리실습',
  },
  {
    id: '006597-001',
    school: '자연과학대학',
    name: '보험수학',
  },
  {
    id: '010111-001',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010880-001',
    school: '자연과학대학',
    name: '기계학습',
  },
  {
    id: '000870-001',
    school: '자연과학대학',
    name: '다변량통계분석',
  },
  {
    id: '006469-001',
    school: '자연과학대학',
    name: '범주형자료분석',
  },
  {
    id: '006597-001',
    school: '자연과학대학',
    name: '보험수학',
  },
  {
    id: '010111-001',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010880-001',
    school: '자연과학대학',
    name: '기계학습',
  },
  {
    id: '002638-001',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002638-002',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002638-003',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002638-004',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002638-005',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002638-006',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002638-007',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002638-008',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002638-009',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002638-010',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002638-011',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002638-012',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002638-013',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002638-014',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002638-015',
    school: '자연과학대학',
    name: '일반물리학1',
  },
  {
    id: '002095-001',
    school: '자연과학대학',
    name: '역학1',
  },
  {
    id: '002095-002',
    school: '자연과학대학',
    name: '역학1',
  },
  {
    id: '003677-001',
    school: '자연과학대학',
    name: '항성천문학',
  },
  {
    id: '003677-002',
    school: '자연과학대학',
    name: '항성천문학',
  },
  {
    id: '001776-001',
    school: '자연과학대학',
    name: '수리물리1',
  },
  {
    id: '001776-002',
    school: '자연과학대학',
    name: '수리물리1',
  },
  {
    id: '009700-001',
    school: '자연과학대학',
    name: '기초계산과학',
  },
  {
    id: '009700-002',
    school: '자연과학대학',
    name: '기초계산과학',
  },
  {
    id: '010884-001',
    school: '자연과학대학',
    name: '현대물리학및실험',
  },
  {
    id: '002035-001',
    school: '자연과학대학',
    name: '양자역학1',
  },
  {
    id: '002035-002',
    school: '자연과학대학',
    name: '양자역학1',
  },
  {
    id: '011435-001',
    school: '자연과학대학',
    name: '기초회로와센서실험',
  },
  {
    id: '003182-001',
    school: '자연과학대학',
    name: '천체물리학',
  },
  {
    id: '007740-001',
    school: '자연과학대학',
    name: '항성대기',
  },
  {
    id: '008569-001',
    school: '자연과학대학',
    name: '전자기파와광학',
  },
  {
    id: '010555-001',
    school: '자연과학대학',
    name: '고급계산과학',
  },
  {
    id: '000283-001',
    school: '자연과학대학',
    name: '고체물리학1',
  },
  {
    id: '003335-001',
    school: '자연과학대학',
    name: '통계물리학',
  },
  {
    id: '007741-001',
    school: '자연과학대학',
    name: '현대우주론',
  },
  {
    id: '008044-001',
    school: '자연과학대학',
    name: '전파천문학',
  },
  {
    id: '009138-001',
    school: '자연과학대학',
    name: '디스플레이광학',
  },
  {
    id: '010111-001',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-009',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-010',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-011',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-012',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-013',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-014',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-015',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-016',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-017',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-018',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010886-001',
    school: '자연과학대학',
    name: '데이터분석기법',
  },
  {
    id: '002705-001',
    school: '자연과학대학',
    name: '일반화학1',
  },
  {
    id: '002705-002',
    school: '자연과학대학',
    name: '일반화학1',
  },
  {
    id: '002705-003',
    school: '자연과학대학',
    name: '일반화학1',
  },
  {
    id: '002705-004',
    school: '자연과학대학',
    name: '일반화학1',
  },
  {
    id: '002705-005',
    school: '자연과학대학',
    name: '일반화학1',
  },
  {
    id: '002354-001',
    school: '자연과학대학',
    name: '유기화학1',
  },
  {
    id: '002354-002',
    school: '자연과학대학',
    name: '유기화학1',
  },
  {
    id: '002982-001',
    school: '자연과학대학',
    name: '정량분석화학',
  },
  {
    id: '003990-001',
    school: '자연과학대학',
    name: '환경화학',
  },
  {
    id: '007793-001',
    school: '자연과학대학',
    name: '향장화학',
  },
  {
    id: '001114-001',
    school: '자연과학대학',
    name: '무기화학',
  },
  {
    id: '001283-001',
    school: '자연과학대학',
    name: '물리화학2',
  },
  {
    id: '001288-001',
    school: '자연과학대학',
    name: '물리화학실험',
  },
  {
    id: '006679-001',
    school: '자연과학대학',
    name: '전기화학',
  },
  {
    id: '006970-001',
    school: '자연과학대학',
    name: '유기메카니즘',
  },
  {
    id: '007840-001',
    school: '자연과학대학',
    name: '화학교과교육론',
  },
  {
    id: '004462-001',
    school: '자연과학대학',
    name: '생화학',
  },
  {
    id: '004309-001',
    school: '자연과학대학',
    name: '유기합성',
  },
  {
    id: '004587-001',
    school: '자연과학대학',
    name: '고체화학',
  },
  {
    id: '008033-001',
    school: '자연과학대학',
    name: '고분자화학실험',
  },
  {
    id: '010111-001',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-009',
    school: '자연과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010557-001',
    school: '자연과학대학',
    name: '신소재화학',
  },
  {
    id: '002351-001',
    school: '생명과학대학',
    name: '유기화학',
  },
  {
    id: '004283-001',
    school: '생명과학대학',
    name: '일반미생물학및실험',
  },
  {
    id: '004283-002',
    school: '생명과학대학',
    name: '일반미생물학및실험',
  },
  {
    id: '005194-001',
    school: '생명과학대학',
    name: '생물리화학',
  },
  {
    id: '001957-001',
    school: '생명과학대학',
    name: '식품화학1',
  },
  {
    id: '007468-001',
    school: '생명과학대학',
    name: '식품공학',
  },
  {
    id: '009829-001',
    school: '생명과학대학',
    name: '식품가공학및실험(종합설계)',
  },
  {
    id: '010888-001',
    school: '생명과학대학',
    name: '식품위해미생물학및실험',
  },
  {
    id: '010888-002',
    school: '생명과학대학',
    name: '식품위해미생물학및실험',
  },
  {
    id: '009827-001',
    school: '생명과학대학',
    name: '식품냉동학',
  },
  {
    id: '010111-001',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '011082-001',
    school: '생명과학대학',
    name: '향장식품소재공학',
  },
  {
    id: '006847-001',
    school: '생명과학대학',
    name: '일반생물학1',
  },
  {
    id: '006847-002',
    school: '생명과학대학',
    name: '일반생물학1',
  },
  {
    id: '006847-003',
    school: '생명과학대학',
    name: '일반생물학1',
  },
  {
    id: '006847-004',
    school: '생명과학대학',
    name: '일반생물학1',
  },
  {
    id: '006847-005',
    school: '생명과학대학',
    name: '일반생물학1',
  },
  {
    id: '006847-006',
    school: '생명과학대학',
    name: '일반생물학1',
  },
  {
    id: '004283-001',
    school: '생명과학대학',
    name: '일반미생물학및실험',
  },
  {
    id: '004283-002',
    school: '생명과학대학',
    name: '일반미생물학및실험',
  },
  {
    id: '004283-003',
    school: '생명과학대학',
    name: '일반미생물학및실험',
  },
  {
    id: '004281-001',
    school: '생명과학대학',
    name: '유기화학',
  },
  {
    id: '004281-002',
    school: '생명과학대학',
    name: '유기화학',
  },
  {
    id: '004282-001',
    school: '생명과학대학',
    name: '생화학1',
  },
  {
    id: '004282-002',
    school: '생명과학대학',
    name: '생화학1',
  },
  {
    id: '004282-003',
    school: '생명과학대학',
    name: '생화학1',
  },
  {
    id: '005194-001',
    school: '생명과학대학',
    name: '생물리화학',
  },
  {
    id: '008602-001',
    school: '생명과학대학',
    name: '일반생리학',
  },
  {
    id: '008602-002',
    school: '생명과학대학',
    name: '일반생리학',
  },
  {
    id: '005212-001',
    school: '생명과학대학',
    name: '세포생물학1',
  },
  {
    id: '005212-002',
    school: '생명과학대학',
    name: '세포생물학1',
  },
  {
    id: '005212-003',
    school: '생명과학대학',
    name: '세포생물학1',
  },
  {
    id: '005103-001',
    school: '생명과학대학',
    name: '유전학',
  },
  {
    id: '005622-001',
    school: '생명과학대학',
    name: '대사생화학',
  },
  {
    id: '005643-001',
    school: '생명과학대학',
    name: '생명의약학',
  },
  {
    id: '005643-002',
    school: '생명과학대학',
    name: '생명의약학',
  },
  {
    id: '006920-001',
    school: '생명과학대학',
    name: '면역학2',
  },
  {
    id: '007818-001',
    school: '생명과학대학',
    name: '분자생물학1및실험',
  },
  {
    id: '007818-002',
    school: '생명과학대학',
    name: '분자생물학1및실험',
  },
  {
    id: '007818-003',
    school: '생명과학대학',
    name: '분자생물학1및실험',
  },
  {
    id: '009679-001',
    school: '생명과학대학',
    name: '응용균학',
  },
  {
    id: '009679-002',
    school: '생명과학대학',
    name: '응용균학',
  },
  {
    id: '005211-001',
    school: '생명과학대학',
    name: '생물화학공학',
  },
  {
    id: '005211-002',
    school: '생명과학대학',
    name: '생물화학공학',
  },
  {
    id: '008065-001',
    school: '생명과학대학',
    name: '줄기세포학',
  },
  {
    id: '008604-001',
    school: '생명과학대학',
    name: '후성유전학',
  },
  {
    id: '009326-001',
    school: '생명과학대학',
    name: '단백질공학',
  },
  {
    id: '009668-001',
    school: '생명과학대학',
    name: '바이오나노소재공학',
  },
  {
    id: '009687-001',
    school: '생명과학대학',
    name: '인지뇌과학',
  },
  {
    id: '010111-001',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-009',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-010',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-011',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-012',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-013',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-014',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-015',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-016',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-017',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-018',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-019',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '004283-001',
    school: '생명과학대학',
    name: '일반미생물학및실험',
  },
  {
    id: '004283-002',
    school: '생명과학대학',
    name: '일반미생물학및실험',
  },
  {
    id: '004281-001',
    school: '생명과학대학',
    name: '유기화학',
  },
  {
    id: '009697-001',
    school: '생명과학대학',
    name: '일반유전학',
  },
  {
    id: '009855-001',
    school: '생명과학대학',
    name: '재배학및실습',
  },
  {
    id: '009855-002',
    school: '생명과학대학',
    name: '재배학및실습',
  },
  {
    id: '005458-001',
    school: '생명과학대학',
    name: '생화학및실험',
  },
  {
    id: '005458-002',
    school: '생명과학대학',
    name: '생화학및실험',
  },
  {
    id: '008960-001',
    school: '생명과학대학',
    name: '식물생리학및실험',
  },
  {
    id: '008960-002',
    school: '생명과학대학',
    name: '식물생리학및실험',
  },
  {
    id: '005899-001',
    school: '생명과학대학',
    name: '식물병리학',
  },
  {
    id: '008974-001',
    school: '생명과학대학',
    name: '생물정보학',
  },
  {
    id: '008974-002',
    school: '생명과학대학',
    name: '생물정보학',
  },
  {
    id: '008982-001',
    school: '생명과학대학',
    name: '유전체학개론',
  },
  {
    id: '011440-001',
    school: '생명과학대학',
    name: '자원식물학',
  },
  {
    id: '009681-001',
    school: '생명과학대학',
    name: '식물분자육종학및실험',
  },
  {
    id: '006319-001',
    school: '생명과학대학',
    name: '식물스트레스생물학',
  },
  {
    id: '008972-001',
    school: '생명과학대학',
    name: '종묘생산학',
  },
  {
    id: '009672-001',
    school: '생명과학대학',
    name: '생체신호전달',
  },
  {
    id: '009704-001',
    school: '생명과학대학',
    name: '약용식물학',
  },
  {
    id: '010111-001',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-009',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '004114-001',
    school: '전자정보공학대학',
    name: '전기회로',
  },
  {
    id: '004114-002',
    school: '전자정보공학대학',
    name: '전기회로',
  },
  {
    id: '004114-003',
    school: '전자정보공학대학',
    name: '전기회로',
  },
  {
    id: '004114-004',
    school: '전자정보공학대학',
    name: '전기회로',
  },
  {
    id: '008622-001',
    school: '전자정보공학대학',
    name: '확률및랜덤변수',
  },
  {
    id: '008622-002',
    school: '전자정보공학대학',
    name: '확률및랜덤변수',
  },
  {
    id: '008622-003',
    school: '전자정보공학대학',
    name: '확률및랜덤변수',
  },
  {
    id: '008622-004',
    school: '전자정보공학대학',
    name: '확률및랜덤변수',
  },
  {
    id: '008622-005',
    school: '전자정보공학대학',
    name: '확률및랜덤변수',
  },
  {
    id: '005611-002',
    school: '전자정보공학대학',
    name: '디지털논리회로',
  },
  {
    id: '005611-003',
    school: '전자정보공학대학',
    name: '디지털논리회로',
  },
  {
    id: '005611-004',
    school: '전자정보공학대학',
    name: '디지털논리회로',
  },
  {
    id: '005611-005',
    school: '전자정보공학대학',
    name: '디지털논리회로',
  },
  {
    id: '005611-006',
    school: '전자정보공학대학',
    name: '디지털논리회로',
  },
  {
    id: '008621-001',
    school: '전자정보공학대학',
    name: 'MATLAB프로그래밍',
  },
  {
    id: '008621-002',
    school: '전자정보공학대학',
    name: 'MATLAB프로그래밍',
  },
  {
    id: '008621-003',
    school: '전자정보공학대학',
    name: 'MATLAB프로그래밍',
  },
  {
    id: '008621-004',
    school: '전자정보공학대학',
    name: 'MATLAB프로그래밍',
  },
  {
    id: '008621-005',
    school: '전자정보공학대학',
    name: 'MATLAB프로그래밍',
  },
  {
    id: '008621-006',
    school: '전자정보공학대학',
    name: 'MATLAB프로그래밍',
  },
  {
    id: '004474-001',
    school: '전자정보공학대학',
    name: '통신이론',
  },
  {
    id: '004474-002',
    school: '전자정보공학대학',
    name: '통신이론',
  },
  {
    id: '004474-003',
    school: '전자정보공학대학',
    name: '통신이론',
  },
  {
    id: '004474-004',
    school: '전자정보공학대학',
    name: '통신이론',
  },
  {
    id: '004600-001',
    school: '전자정보공학대학',
    name: '디지털신호처리',
  },
  {
    id: '004600-002',
    school: '전자정보공학대학',
    name: '디지털신호처리',
  },
  {
    id: '004600-003',
    school: '전자정보공학대학',
    name: '디지털신호처리',
  },
  {
    id: '004699-001',
    school: '전자정보공학대학',
    name: '데이터통신',
  },
  {
    id: '004699-002',
    school: '전자정보공학대학',
    name: '데이터통신',
  },
  {
    id: '007453-001',
    school: '전자정보공학대학',
    name: '전자회로1',
  },
  {
    id: '007453-002',
    school: '전자정보공학대학',
    name: '전자회로1',
  },
  {
    id: '007453-003',
    school: '전자정보공학대학',
    name: '전자회로1',
  },
  {
    id: '007806-001',
    school: '전자정보공학대학',
    name: '기초반도체',
  },
  {
    id: '007806-002',
    school: '전자정보공학대학',
    name: '기초반도체',
  },
  {
    id: '007806-003',
    school: '전자정보공학대학',
    name: '기초반도체',
  },
  {
    id: '007806-004',
    school: '전자정보공학대학',
    name: '기초반도체',
  },
  {
    id: '007806-005',
    school: '전자정보공학대학',
    name: '기초반도체',
  },
  {
    id: '009649-001',
    school: '전자정보공학대학',
    name: '전자기1',
  },
  {
    id: '009649-002',
    school: '전자정보공학대학',
    name: '전자기1',
  },
  {
    id: '009649-003',
    school: '전자정보공학대학',
    name: '전자기1',
  },
  {
    id: '009649-004',
    school: '전자정보공학대학',
    name: '전자기1',
  },
  {
    id: '004268-001',
    school: '전자정보공학대학',
    name: '데이터구조론',
  },
  {
    id: '004268-002',
    school: '전자정보공학대학',
    name: '데이터구조론',
  },
  {
    id: '004475-001',
    school: '전자정보공학대학',
    name: '자동제어',
  },
  {
    id: '004475-002',
    school: '전자정보공학대학',
    name: '자동제어',
  },
  {
    id: '008076-001',
    school: '전자정보공학대학',
    name: '기초광학및실험',
  },
  {
    id: '008076-002',
    school: '전자정보공학대학',
    name: '기초광학및실험',
  },
  {
    id: '008626-001',
    school: '전자정보공학대학',
    name: '하드웨어프로그래밍',
  },
  {
    id: '002505-001',
    school: '전자정보공학대학',
    name: '인공지능',
  },
  {
    id: '002505-002',
    school: '전자정보공학대학',
    name: '인공지능',
  },
  {
    id: '006562-001',
    school: '전자정보공학대학',
    name: '초고주파공학',
  },
  {
    id: '007585-001',
    school: '전자정보공학대학',
    name: '통신시스템설계',
  },
  {
    id: '009654-001',
    school: '전자정보공학대학',
    name: '전자정보통신공학특강A',
  },
  {
    id: '009655-001',
    school: '전자정보공학대학',
    name: '광통신공학',
  },
  {
    id: '009661-001',
    school: '전자정보공학대학',
    name: '반도체공정실험',
  },
  {
    id: '009661-002',
    school: '전자정보공학대학',
    name: '반도체공정실험',
  },
  {
    id: '009662-001',
    school: '전자정보공학대학',
    name: '전자회로설계',
  },
  {
    id: '009662-002',
    school: '전자정보공학대학',
    name: '전자회로설계',
  },
  {
    id: '009662-003',
    school: '전자정보공학대학',
    name: '전자회로설계',
  },
  {
    id: '009663-001',
    school: '전자정보공학대학',
    name: '멀티미디어설계',
  },
  {
    id: '009666-001',
    school: '전자정보공학대학',
    name: '마이크로컴퓨터실험',
  },
  {
    id: '009947-001',
    school: '전자정보공학대학',
    name: '캡스톤디자인A',
  },
  {
    id: '009947-002',
    school: '전자정보공학대학',
    name: '캡스톤디자인A',
  },
  {
    id: '010111-001',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-009',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-010',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-011',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-012',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-013',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-014',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-015',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-016',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-017',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-018',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-019',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-020',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-021',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-022',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-023',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-024',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-025',
    school: '전자정보공학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '004118-001',
    school: '소프트웨어융합대학',
    name: '디지털시스템',
  },
  {
    id: '004118-002',
    school: '소프트웨어융합대학',
    name: '디지털시스템',
  },
  {
    id: '004118-003',
    school: '소프트웨어융합대학',
    name: '디지털시스템',
  },
  {
    id: '004118-004',
    school: '소프트웨어융합대학',
    name: '디지털시스템',
  },
  {
    id: '004118-005',
    school: '소프트웨어융합대학',
    name: '디지털시스템',
  },
  {
    id: '004118-006',
    school: '소프트웨어융합대학',
    name: '디지털시스템',
  },
  {
    id: '004118-007',
    school: '소프트웨어융합대학',
    name: '디지털시스템',
  },
  {
    id: '009913-001',
    school: '소프트웨어융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009913-002',
    school: '소프트웨어융합대학',
    name: '고급C프로그래밍및실습',
  },
  {
    id: '009952-001',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '009952-002',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '009952-003',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '009952-004',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '009952-005',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '009952-006',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '009952-007',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '009952-008',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '006237-001',
    school: '소프트웨어융합대학',
    name: '웹프로그래밍',
  },
  {
    id: '006237-002',
    school: '소프트웨어융합대학',
    name: '웹프로그래밍',
  },
  {
    id: '006237-003',
    school: '소프트웨어융합대학',
    name: '웹프로그래밍',
  },
  {
    id: '009959-001',
    school: '소프트웨어융합대학',
    name: '확률통계및프로그래밍',
  },
  {
    id: '009959-002',
    school: '소프트웨어융합대학',
    name: '확률통계및프로그래밍',
  },
  {
    id: '009959-003',
    school: '소프트웨어융합대학',
    name: '확률통계및프로그래밍',
  },
  {
    id: '009959-004',
    school: '소프트웨어융합대학',
    name: '확률통계및프로그래밍',
  },
  {
    id: '009992-001',
    school: '소프트웨어융합대학',
    name: '문제해결및실습:C++',
  },
  {
    id: '009992-002',
    school: '소프트웨어융합대학',
    name: '문제해결및실습:C++',
  },
  {
    id: '011251-001',
    school: '소프트웨어융합대학',
    name: 'K-MOOC:모두를위한머신러닝',
  },
  {
    id: '004310-001',
    school: '소프트웨어융합대학',
    name: '운영체제',
  },
  {
    id: '004310-002',
    school: '소프트웨어융합대학',
    name: '운영체제',
  },
  {
    id: '004310-003',
    school: '소프트웨어융합대학',
    name: '운영체제',
  },
  {
    id: '004310-004',
    school: '소프트웨어융합대학',
    name: '운영체제',
  },
  {
    id: '004310-005',
    school: '소프트웨어융합대학',
    name: '운영체제',
  },
  {
    id: '004310-006',
    school: '소프트웨어융합대학',
    name: '운영체제',
  },
  {
    id: '004310-007',
    school: '소프트웨어융합대학',
    name: '운영체제',
  },
  {
    id: '003281-001',
    school: '소프트웨어융합대학',
    name: '컴퓨터그래픽스',
  },
  {
    id: '005246-001',
    school: '소프트웨어융합대학',
    name: '신호및시스템',
  },
  {
    id: '005246-002',
    school: '소프트웨어융합대학',
    name: '신호및시스템',
  },
  {
    id: '006474-001',
    school: '소프트웨어융합대학',
    name: 'C#프로그래밍',
  },
  {
    id: '007219-001',
    school: '소프트웨어융합대학',
    name: '데이터베이스',
  },
  {
    id: '007219-002',
    school: '소프트웨어융합대학',
    name: '데이터베이스',
  },
  {
    id: '007219-003',
    school: '소프트웨어융합대학',
    name: '데이터베이스',
  },
  {
    id: '007219-004',
    school: '소프트웨어융합대학',
    name: '데이터베이스',
  },
  {
    id: '007313-001',
    school: '소프트웨어융합대학',
    name: '프로그래밍언어의개념',
  },
  {
    id: '011771-001',
    school: '소프트웨어융합대학',
    name: 'K-MOOC:생성형인공지능입문',
  },
  {
    id: '009960-001',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '009960-002',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '009960-003',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '006132-001',
    school: '소프트웨어융합대학',
    name: '영상처리',
  },
  {
    id: '006132-002',
    school: '소프트웨어융합대학',
    name: '영상처리',
  },
  {
    id: '006134-001',
    school: '소프트웨어융합대학',
    name: 'HCI개론',
  },
  {
    id: '006134-002',
    school: '소프트웨어융합대학',
    name: 'HCI개론',
  },
  {
    id: '006135-001',
    school: '소프트웨어융합대학',
    name: '정보보호개론',
  },
  {
    id: '006139-001',
    school: '소프트웨어융합대학',
    name: '임베디드시스템',
  },
  {
    id: '006478-001',
    school: '소프트웨어융합대학',
    name: '무선통신',
  },
  {
    id: '006478-002',
    school: '소프트웨어융합대학',
    name: '무선통신',
  },
  {
    id: '010000-001',
    school: '소프트웨어융합대학',
    name: '기계학습',
  },
  {
    id: '010111-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-009',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-010',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-011',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-012',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-013',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-014',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-015',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-016',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-017',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-018',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '003284-001',
    school: '소프트웨어융합대학',
    name: '컴퓨터네트워크',
  },
  {
    id: '009952-001',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '002998-001',
    school: '소프트웨어융합대학',
    name: '정수론',
  },
  {
    id: '009955-001',
    school: '소프트웨어융합대학',
    name: '이산수학및프로그래밍',
  },
  {
    id: '010443-001',
    school: '소프트웨어융합대학',
    name: '사이버전개론',
  },
  {
    id: '009520-001',
    school: '소프트웨어융합대학',
    name: '공개키암호론',
  },
  {
    id: '009986-001',
    school: '소프트웨어융합대학',
    name: '운영체제및보안',
  },
  {
    id: '009984-001',
    school: '소프트웨어융합대학',
    name: '웹해킹과보안',
  },
  {
    id: '011566-001',
    school: '소프트웨어융합대학',
    name: 'K-MOOC:데이터베이스보안',
  },
  {
    id: '009960-001',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '009991-001',
    school: '소프트웨어융합대학',
    name: '네트워크해킹과보안',
  },
  {
    id: '010111-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '009952-001',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '009952-002',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '009992-001',
    school: '소프트웨어융합대학',
    name: '문제해결및실습:C++',
  },
  {
    id: '009992-002',
    school: '소프트웨어융합대학',
    name: '문제해결및실습:C++',
  },
  {
    id: '005619-001',
    school: '소프트웨어융합대학',
    name: '멀티미디어프로그래밍',
  },
  {
    id: '009959-001',
    school: '소프트웨어융합대학',
    name: '확률통계및프로그래밍',
  },
  {
    id: '009959-002',
    school: '소프트웨어융합대학',
    name: '확률통계및프로그래밍',
  },
  {
    id: '010206-001',
    school: '소프트웨어융합대학',
    name: '일반물리및시뮬레이션',
  },
  {
    id: '010206-002',
    school: '소프트웨어융합대학',
    name: '일반물리및시뮬레이션',
  },
  {
    id: '004310-001',
    school: '소프트웨어융합대학',
    name: '운영체제',
  },
  {
    id: '004310-002',
    school: '소프트웨어융합대학',
    name: '운영체제',
  },
  {
    id: '007219-001',
    school: '소프트웨어융합대학',
    name: '데이터베이스',
  },
  {
    id: '007219-002',
    school: '소프트웨어융합대학',
    name: '데이터베이스',
  },
  {
    id: '009957-001',
    school: '소프트웨어융합대학',
    name: '오픈소스SW개론',
  },
  {
    id: '009957-002',
    school: '소프트웨어융합대학',
    name: '오픈소스SW개론',
  },
  {
    id: '004102-001',
    school: '소프트웨어융합대학',
    name: '수치해석',
  },
  {
    id: '009960-001',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '006208-001',
    school: '소프트웨어융합대학',
    name: '가상현실',
  },
  {
    id: '010000-001',
    school: '소프트웨어융합대학',
    name: '기계학습',
  },
  {
    id: '010111-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-009',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '009952-001',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '010142-001',
    school: '소프트웨어융합대학',
    name: '데이터분석개론',
  },
  {
    id: '006237-001',
    school: '소프트웨어융합대학',
    name: '웹프로그래밍',
  },
  {
    id: '009959-001',
    school: '소프트웨어융합대학',
    name: '확률통계및프로그래밍',
  },
  {
    id: '007219-001',
    school: '소프트웨어융합대학',
    name: '데이터베이스',
  },
  {
    id: '010000-001',
    school: '소프트웨어융합대학',
    name: '기계학습',
  },
  {
    id: '010000-002',
    school: '소프트웨어융합대학',
    name: '기계학습',
  },
  {
    id: '004310-001',
    school: '소프트웨어융합대학',
    name: '운영체제',
  },
  {
    id: '010563-001',
    school: '소프트웨어융합대학',
    name: '의사결정분석',
  },
  {
    id: '009960-001',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '010111-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010148-001',
    school: '소프트웨어융합대학',
    name: '텍스트마이닝',
  },
  {
    id: '010566-001',
    school: '소프트웨어융합대학',
    name: '시계열분석및예측',
  },
  {
    id: '010000-001',
    school: '소프트웨어융합대학',
    name: '기계학습',
  },
  {
    id: '010000-002',
    school: '소프트웨어융합대학',
    name: '기계학습',
  },
  {
    id: '003284-001',
    school: '소프트웨어융합대학',
    name: '컴퓨터네트워크',
  },
  {
    id: '004102-001',
    school: '소프트웨어융합대학',
    name: '수치해석',
  },
  {
    id: '004475-001',
    school: '소프트웨어융합대학',
    name: '자동제어',
  },
  {
    id: '004476-001',
    school: '소프트웨어융합대학',
    name: '전자회로',
  },
  {
    id: '004599-001',
    school: '소프트웨어융합대학',
    name: '통신시스템',
  },
  {
    id: '006132-001',
    school: '소프트웨어융합대학',
    name: '영상처리',
  },
  {
    id: '010227-001',
    school: '소프트웨어융합대학',
    name: '컴퓨터구조및운영체제',
  },
  {
    id: '009960-001',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '009960-002',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '010111-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010238-001',
    school: '소프트웨어융합대학',
    name: '딥러닝시스템',
  },
  {
    id: '010000-001',
    school: '소프트웨어융합대학',
    name: '기계학습',
  },
  {
    id: '010000-002',
    school: '소프트웨어융합대학',
    name: '기계학습',
  },
  {
    id: '003284-001',
    school: '소프트웨어융합대학',
    name: '컴퓨터네트워크',
  },
  {
    id: '004102-001',
    school: '소프트웨어융합대학',
    name: '수치해석',
  },
  {
    id: '004475-001',
    school: '소프트웨어융합대학',
    name: '자동제어',
  },
  {
    id: '004476-001',
    school: '소프트웨어융합대학',
    name: '전자회로',
  },
  {
    id: '004599-001',
    school: '소프트웨어융합대학',
    name: '통신시스템',
  },
  {
    id: '006132-001',
    school: '소프트웨어융합대학',
    name: '영상처리',
  },
  {
    id: '010225-001',
    school: '소프트웨어융합대학',
    name: '반도체소자',
  },
  {
    id: '010227-001',
    school: '소프트웨어융합대학',
    name: '컴퓨터구조및운영체제',
  },
  {
    id: '009960-001',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '009960-002',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '010111-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-009',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010237-001',
    school: '소프트웨어융합대학',
    name: 'AI로봇설계',
  },
  {
    id: '010238-001',
    school: '소프트웨어융합대학',
    name: '딥러닝시스템',
  },
  {
    id: '003313-001',
    school: '소프트웨어융합대학',
    name: '타이포그래피',
  },
  {
    id: '003313-002',
    school: '소프트웨어융합대학',
    name: '타이포그래피',
  },
  {
    id: '006225-001',
    school: '소프트웨어융합대학',
    name: '기초렌더링',
  },
  {
    id: '010310-001',
    school: '소프트웨어융합대학',
    name: '프로덕트디자인2',
  },
  {
    id: '010312-001',
    school: '소프트웨어융합대학',
    name: '비주얼커뮤니케이션디자인2',
  },
  {
    id: '010312-002',
    school: '소프트웨어융합대학',
    name: '비주얼커뮤니케이션디자인2',
  },
  {
    id: '010314-001',
    school: '소프트웨어융합대학',
    name: '디자인인모션1',
  },
  {
    id: '010314-002',
    school: '소프트웨어융합대학',
    name: '디자인인모션1',
  },
  {
    id: '009945-001',
    school: '소프트웨어융합대학',
    name: 'UX디자인1',
  },
  {
    id: '009945-002',
    school: '소프트웨어융합대학',
    name: 'UX디자인1',
  },
  {
    id: '000703-001',
    school: '소프트웨어융합대학',
    name: '그래픽디자인1',
  },
  {
    id: '000703-002',
    school: '소프트웨어융합대학',
    name: '그래픽디자인1',
  },
  {
    id: '010329-001',
    school: '소프트웨어융합대학',
    name: '프로덕트&모빌리티디자인1',
  },
  {
    id: '010333-001',
    school: '소프트웨어융합대학',
    name: '스마트프로덕트디자인1',
  },
  {
    id: '010335-001',
    school: '소프트웨어융합대학',
    name: '3D그래픽어플리케이션',
  },
  {
    id: '010336-001',
    school: '소프트웨어융합대학',
    name: '인포그래픽',
  },
  {
    id: '010336-002',
    school: '소프트웨어융합대학',
    name: '인포그래픽',
  },
  {
    id: '005662-001',
    school: '소프트웨어융합대학',
    name: '아이덴티티디자인1',
  },
  {
    id: '006641-001',
    school: '소프트웨어융합대학',
    name: '제품시스템디자인1',
  },
  {
    id: '009214-001',
    school: '소프트웨어융합대학',
    name: '제품및운송기기디자인3',
  },
  {
    id: '010343-001',
    school: '소프트웨어융합대학',
    name: '디지털미디어프로젝트1',
  },
  {
    id: '008790-001',
    school: '소프트웨어융합대학',
    name: '콘텐츠기획1',
  },
  {
    id: '008790-002',
    school: '소프트웨어융합대학',
    name: '콘텐츠기획1',
  },
  {
    id: '008792-001',
    school: '소프트웨어융합대학',
    name: '만화제작1',
  },
  {
    id: '008792-002',
    school: '소프트웨어융합대학',
    name: '만화제작1',
  },
  {
    id: '010279-001',
    school: '소프트웨어융합대학',
    name: '내러티브워크숍',
  },
  {
    id: '010279-002',
    school: '소프트웨어융합대학',
    name: '내러티브워크숍',
  },
  {
    id: '010281-001',
    school: '소프트웨어융합대학',
    name: '애니메이션액팅1',
  },
  {
    id: '010281-002',
    school: '소프트웨어융합대학',
    name: '애니메이션액팅1',
  },
  {
    id: '010580-001',
    school: '소프트웨어융합대학',
    name: '3D제작도구1',
  },
  {
    id: '010580-002',
    school: '소프트웨어융합대학',
    name: '3D제작도구1',
  },
  {
    id: '011185-001',
    school: '소프트웨어융합대학',
    name: '프리비즈워크숍1',
  },
  {
    id: '011185-002',
    school: '소프트웨어융합대학',
    name: '프리비즈워크숍1',
  },
  {
    id: '011090-001',
    school: '소프트웨어융합대학',
    name: '디지털코믹스제작1',
  },
  {
    id: '011090-002',
    school: '소프트웨어융합대학',
    name: '디지털코믹스제작1',
  },
  {
    id: '011191-001',
    school: '소프트웨어융합대학',
    name: '비주얼디벨롭먼트1',
  },
  {
    id: '011191-002',
    school: '소프트웨어융합대학',
    name: '비주얼디벨롭먼트1',
  },
  {
    id: '011088-001',
    school: '소프트웨어융합대학',
    name: '이펙트디자인1',
  },
  {
    id: '011088-002',
    school: '소프트웨어융합대학',
    name: '이펙트디자인1',
  },
  {
    id: '011089-001',
    school: '소프트웨어융합대학',
    name: '디지털애니메이션디렉팅1',
  },
  {
    id: '011187-001',
    school: '소프트웨어융합대학',
    name: '애니메이션워크숍1',
  },
  {
    id: '011187-002',
    school: '소프트웨어융합대학',
    name: '애니메이션워크숍1',
  },
  {
    id: '011189-001',
    school: '소프트웨어융합대학',
    name: '3D제작도구고급1',
  },
  {
    id: '011189-002',
    school: '소프트웨어융합대학',
    name: '3D제작도구고급1',
  },
  {
    id: '005764-001',
    school: '소프트웨어융합대학',
    name: '졸업작품(P/NP)',
  },
  {
    id: '010298-001',
    school: '소프트웨어융합대학',
    name: '애니메이션코어스튜디오1',
  },
  {
    id: '010298-002',
    school: '소프트웨어융합대학',
    name: '애니메이션코어스튜디오1',
  },
  {
    id: '010300-001',
    school: '소프트웨어융합대학',
    name: '웹툰커넥션프로덕션1',
  },
  {
    id: '010111-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '011092-001',
    school: '소프트웨어융합대학',
    name: '영상캡스톤디자인',
  },
  {
    id: '011279-001',
    school: '공과대학',
    name: '창의공학설계',
  },
  {
    id: '011279-002',
    school: '공과대학',
    name: '창의공학설계',
  },
  {
    id: '006153-001',
    school: '공과대학',
    name: '건축구조시스템',
  },
  {
    id: '006154-001',
    school: '공과대학',
    name: '건축환경개론',
  },
  {
    id: '004321-001',
    school: '공과대학',
    name: '구조역학2',
  },
  {
    id: '007663-001',
    school: '공과대학',
    name: '건축환경설계',
  },
  {
    id: '007663-002',
    school: '공과대학',
    name: '건축환경설계',
  },
  {
    id: '004431-001',
    school: '공과대학',
    name: '건축일반구조',
  },
  {
    id: '006479-001',
    school: '공과대학',
    name: '건축기계설비시스템',
  },
  {
    id: '007662-001',
    school: '공과대학',
    name: '철근콘크리트공학',
  },
  {
    id: '008180-001',
    school: '공과대학',
    name: '건설관리및경영',
  },
  {
    id: '007812-001',
    school: '공과대학',
    name: '공학설계A',
  },
  {
    id: '007812-002',
    school: '공과대학',
    name: '공학설계A',
  },
  {
    id: '004704-001',
    school: '공과대학',
    name: '철골구조',
  },
  {
    id: '006574-001',
    school: '공과대학',
    name: '건축전기설비시스템',
  },
  {
    id: '006932-001',
    school: '공과대학',
    name: '건축실무',
  },
  {
    id: '008182-001',
    school: '공과대학',
    name: '구조계획및설계',
  },
  {
    id: '010111-001',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '006663-001',
    school: '공과대학',
    name: '스튜디오5',
  },
  {
    id: '006663-002',
    school: '공과대학',
    name: '스튜디오5',
  },
  {
    id: '006663-003',
    school: '공과대학',
    name: '스튜디오5',
  },
  {
    id: '006663-004',
    school: '공과대학',
    name: '스튜디오5',
  },
  {
    id: '008642-001',
    school: '공과대학',
    name: '프로젝트관리론',
  },
  {
    id: '006765-001',
    school: '공과대학',
    name: '도시계획',
  },
  {
    id: '010273-001',
    school: '공과대학',
    name: '건축구조역학',
  },
  {
    id: '011283-001',
    school: '공과대학',
    name: '디지털패브리케이션',
  },
  {
    id: '006930-001',
    school: '공과대학',
    name: '스튜디오7',
  },
  {
    id: '006930-002',
    school: '공과대학',
    name: '스튜디오7',
  },
  {
    id: '006930-003',
    school: '공과대학',
    name: '스튜디오7',
  },
  {
    id: '006930-004',
    school: '공과대학',
    name: '스튜디오7',
  },
  {
    id: '006932-001',
    school: '공과대학',
    name: '건축실무',
  },
  {
    id: '007177-001',
    school: '공과대학',
    name: '공간과사회',
  },
  {
    id: '010111-001',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '004280-001',
    school: '공과대학',
    name: '응용역학및연습1',
  },
  {
    id: '004674-001',
    school: '공과대학',
    name: '환경공학및실험',
  },
  {
    id: '010657-001',
    school: '공과대학',
    name: '유체역학및연습',
  },
  {
    id: '010589-001',
    school: '공과대학',
    name: '콘크리트공학',
  },
  {
    id: '010590-001',
    school: '공과대학',
    name: '구조공학',
  },
  {
    id: '004852-001',
    school: '공과대학',
    name: '측량학',
  },
  {
    id: '010591-001',
    school: '공과대학',
    name: '재해방지공학',
  },
  {
    id: '010593-001',
    school: '공과대학',
    name: '강구조공학',
  },
  {
    id: '011426-001',
    school: '공과대학',
    name: '스마트수처리시스템공학',
  },
  {
    id: '004710-001',
    school: '공과대학',
    name: '해안및항만공학',
  },
  {
    id: '004898-001',
    school: '공과대학',
    name: '내진설계',
  },
  {
    id: '010111-001',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010598-001',
    school: '공과대학',
    name: '건설CAD',
  },
  {
    id: '011425-001',
    school: '공과대학',
    name: '도시수재해공학',
  },
  {
    id: '010901-001',
    school: '공과대학',
    name: '공간정보개론',
  },
  {
    id: '009622-001',
    school: '공과대학',
    name: '대기환경및기후변화',
  },
  {
    id: '009815-001',
    school: '공과대학',
    name: '기상대기과학',
  },
  {
    id: '003989-001',
    school: '공과대학',
    name: '환경화학',
  },
  {
    id: '007665-001',
    school: '공과대학',
    name: '환경유체역학',
  },
  {
    id: '009631-001',
    school: '공과대학',
    name: '환경단위공정기초',
  },
  {
    id: '007738-001',
    school: '공과대학',
    name: '토양지하수환경학',
  },
  {
    id: '010902-001',
    school: '공과대학',
    name: '졸업논문연구',
  },
  {
    id: '009616-001',
    school: '공과대학',
    name: '하폐수처리및실습',
  },
  {
    id: '010111-001',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '006312-001',
    school: '공과대학',
    name: '기계제작법',
  },
  {
    id: '005233-001',
    school: '공과대학',
    name: '유체기계',
  },
  {
    id: '005233-002',
    school: '공과대학',
    name: '유체기계',
  },
  {
    id: '006492-001',
    school: '공과대학',
    name: '재료거동학',
  },
  {
    id: '006891-001',
    school: '공과대학',
    name: '기계진동학',
  },
  {
    id: '007698-001',
    school: '공과대학',
    name: '응용기계설계',
  },
  {
    id: '005232-001',
    school: '공과대학',
    name: '기초유한요소법',
  },
  {
    id: '006486-001',
    school: '공과대학',
    name: '로보틱스',
  },
  {
    id: '007465-001',
    school: '공과대학',
    name: '연소공학개론',
  },
  {
    id: '008485-001',
    school: '공과대학',
    name: '생체역학',
  },
  {
    id: '009193-001',
    school: '공과대학',
    name: '시스템해석',
  },
  {
    id: '009850-001',
    school: '공과대학',
    name: '종합설계A',
  },
  {
    id: '009850-002',
    school: '공과대학',
    name: '종합설계A',
  },
  {
    id: '010111-001',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '006885-001',
    school: '공과대학',
    name: '비행동역학',
  },
  {
    id: '006885-002',
    school: '공과대학',
    name: '비행동역학',
  },
  {
    id: '004715-001',
    school: '공과대학',
    name: '진동학',
  },
  {
    id: '004756-001',
    school: '공과대학',
    name: '압축성유체역학',
  },
  {
    id: '007054-001',
    school: '공과대학',
    name: '우주궤도역학',
  },
  {
    id: '010662-001',
    school: '공과대학',
    name: '메카트로닉스종합설계',
  },
  {
    id: '006886-001',
    school: '공과대학',
    name: '시뮬레이션시스템설계',
  },
  {
    id: '007164-001',
    school: '공과대학',
    name: '응용공기역학및설계',
  },
  {
    id: '007268-001',
    school: '공과대학',
    name: '항법전자시스템설계',
  },
  {
    id: '008115-001',
    school: '공과대학',
    name: '로켓공학및설계',
  },
  {
    id: '009249-001',
    school: '공과대학',
    name: '항공우주공학연구1',
  },
  {
    id: '009835-001',
    school: '공과대학',
    name: '종합설계1',
  },
  {
    id: '010111-001',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-009',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010922-001',
    school: '공과대학',
    name: '자율비행체시스템설계2',
  },
  {
    id: '005217-001',
    school: '공과대학',
    name: '재료열역학1',
  },
  {
    id: '005217-002',
    school: '공과대학',
    name: '재료열역학1',
  },
  {
    id: '005217-003',
    school: '공과대학',
    name: '재료열역학1',
  },
  {
    id: '006682-001',
    school: '공과대학',
    name: '결정구조및X-선회절',
  },
  {
    id: '006682-002',
    school: '공과대학',
    name: '결정구조및X-선회절',
  },
  {
    id: '003790-001',
    school: '공과대학',
    name: '현대물리',
  },
  {
    id: '006680-001',
    school: '공과대학',
    name: '신소재과학1',
  },
  {
    id: '006680-002',
    school: '공과대학',
    name: '신소재과학1',
  },
  {
    id: '007160-001',
    school: '공과대학',
    name: '전기전자공학',
  },
  {
    id: '009196-001',
    school: '공과대학',
    name: '공학기초설계실험',
  },
  {
    id: '009196-002',
    school: '공과대학',
    name: '공학기초설계실험',
  },
  {
    id: '005650-001',
    school: '공과대학',
    name: '고체물리',
  },
  {
    id: '005650-002',
    school: '공과대학',
    name: '고체물리',
  },
  {
    id: '006683-001',
    school: '공과대학',
    name: '확산및상변태',
  },
  {
    id: '006683-002',
    school: '공과대학',
    name: '확산및상변태',
  },
  {
    id: '010079-001',
    school: '공과대학',
    name: '금속과세라믹기초설계및실험',
  },
  {
    id: '010079-002',
    school: '공과대학',
    name: '금속과세라믹기초설계및실험',
  },
  {
    id: '010079-003',
    school: '공과대학',
    name: '금속과세라믹기초설계및실험',
  },
  {
    id: '010079-004',
    school: '공과대학',
    name: '금속과세라믹기초설계및실험',
  },
  {
    id: '010079-005',
    school: '공과대학',
    name: '금속과세라믹기초설계및실험',
  },
  {
    id: '000264-001',
    school: '공과대학',
    name: '고분자화학',
  },
  {
    id: '005918-001',
    school: '공과대학',
    name: '반도체재료',
  },
  {
    id: '008495-001',
    school: '공과대학',
    name: '에너지재료',
  },
  {
    id: '009837-001',
    school: '공과대학',
    name: '바이오재료공학',
  },
  {
    id: '010081-001',
    school: '공과대학',
    name: '나노신소재창의연구1(종합설계)',
  },
  {
    id: '010081-002',
    school: '공과대학',
    name: '나노신소재창의연구1(종합설계)',
  },
  {
    id: '010081-003',
    school: '공과대학',
    name: '나노신소재창의연구1(종합설계)',
  },
  {
    id: '006314-001',
    school: '공과대학',
    name: '박막공학',
  },
  {
    id: '006686-001',
    school: '공과대학',
    name: '재료분석학',
  },
  {
    id: '007274-001',
    school: '공과대학',
    name: '고분자합성',
  },
  {
    id: '007460-001',
    school: '공과대학',
    name: '초미립소재학',
  },
  {
    id: '007461-001',
    school: '공과대학',
    name: '자성체재료',
  },
  {
    id: '009017-001',
    school: '공과대학',
    name: '산학협동강좌1',
  },
  {
    id: '009020-001',
    school: '공과대학',
    name: '반도체나노소자',
  },
  {
    id: '010111-001',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-009',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-010',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-011',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-012',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-013',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-014',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-015',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-016',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-017',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '004510-001',
    school: '공과대학',
    name: '고체역학',
  },
  {
    id: '004714-001',
    school: '공과대학',
    name: '열역학',
  },
  {
    id: '004714-002',
    school: '공과대학',
    name: '열역학',
  },
  {
    id: '004102-001',
    school: '공과대학',
    name: '수치해석',
  },
  {
    id: '004102-002',
    school: '공과대학',
    name: '수치해석',
  },
  {
    id: '006889-001',
    school: '공과대학',
    name: '기계제도및CAD',
  },
  {
    id: '006889-002',
    school: '공과대학',
    name: '기계제도및CAD',
  },
  {
    id: '007620-001',
    school: '공과대학',
    name: '기초설계',
  },
  {
    id: '008920-001',
    school: '공과대학',
    name: '해전사',
  },
  {
    id: '010211-001',
    school: '공과대학',
    name: '장교직무교육세미나1',
  },
  {
    id: '010936-001',
    school: '공과대학',
    name: '해양체육',
  },
  {
    id: '004508-001',
    school: '공과대학',
    name: '디지털시스템및실험',
  },
  {
    id: '008766-001',
    school: '공과대학',
    name: '군대윤리',
  },
  {
    id: '010213-001',
    school: '공과대학',
    name: '장교직무교육세미나3',
  },
  {
    id: '008764-001',
    school: '공과대학',
    name: '군사학개론',
  },
  {
    id: '004600-001',
    school: '공과대학',
    name: '디지털신호처리',
  },
  {
    id: '006152-001',
    school: '공과대학',
    name: '전자기학',
  },
  {
    id: '008768-001',
    school: '공과대학',
    name: '선형대수와시스템이론',
  },
  {
    id: '010215-001',
    school: '공과대학',
    name: '장교직무교육세미나5',
  },
  {
    id: '010932-001',
    school: '공과대학',
    name: '고급프로그래밍언어',
  },
  {
    id: '008922-001',
    school: '공과대학',
    name: '무기체계공학',
  },
  {
    id: '010217-001',
    school: '공과대학',
    name: '장교직무교육세미나7',
  },
  {
    id: '008929-001',
    school: '공과대학',
    name: '로봇공학',
  },
  {
    id: '009207-001',
    school: '공과대학',
    name: '전자전',
  },
  {
    id: '010111-001',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010935-001',
    school: '공과대학',
    name: '국방딥러닝신호처리',
  },
  {
    id: '010939-001',
    school: '공과대학',
    name: '통신공학',
  },
  {
    id: '009532-001',
    school: '공과대학',
    name: '비행역학',
  },
  {
    id: '011070-001',
    school: '공과대학',
    name: '항공안전관리론',
  },
  {
    id: '011071-001',
    school: '공과대학',
    name: '항공전략론',
  },
  {
    id: '011059-001',
    school: '공과대학',
    name: '우주기술운용체계',
  },
  {
    id: '006164-001',
    school: '공과대학',
    name: '무인항공기설계1',
  },
  {
    id: '010111-001',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '011073-001',
    school: '공과대학',
    name: '모의비행실습2',
  },
  {
    id: '011073-002',
    school: '공과대학',
    name: '모의비행실습2',
  },
  {
    id: '008141-001',
    school: '공과대학',
    name: '석유가스공학개론',
  },
  {
    id: '004325-001',
    school: '공과대학',
    name: '공업역학',
  },
  {
    id: '009541-001',
    school: '공과대학',
    name: '전산프로그래밍및실습',
  },
  {
    id: '010912-001',
    school: '공과대학',
    name: '응용지질학개론',
  },
  {
    id: '010916-001',
    school: '공과대학',
    name: '위성원격탐사개론및실습',
  },
  {
    id: '011113-001',
    school: '공과대학',
    name: '빅데이터로보는세상',
  },
  {
    id: '006657-001',
    school: '공과대학',
    name: '지질공학및실습',
  },
  {
    id: '008476-001',
    school: '공과대학',
    name: '광물암석학및실습',
  },
  {
    id: '009540-001',
    school: '공과대학',
    name: '이산자료처리및실습',
  },
  {
    id: '009565-001',
    school: '공과대학',
    name: '선광제련공학개론',
  },
  {
    id: '008146-001',
    school: '공과대학',
    name: '저류공학',
  },
  {
    id: '011392-001',
    school: '공과대학',
    name: '핵심광물융합탐사',
  },
  {
    id: '009823-001',
    school: '공과대학',
    name: '물리탐사모니터링',
  },
  {
    id: '009850-001',
    school: '공과대학',
    name: '종합설계A',
  },
  {
    id: '010111-001',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-005',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-006',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-007',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-008',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-009',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-010',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-011',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010908-001',
    school: '공과대학',
    name: '화약발파및터널굴착설계',
  },
  {
    id: '010914-001',
    school: '공과대학',
    name: '에너지경제성평가',
  },
  {
    id: '007620-001',
    school: '공과대학',
    name: '기초설계',
  },
  {
    id: '008991-001',
    school: '공과대학',
    name: '원자및핵물리',
  },
  {
    id: '010924-001',
    school: '공과대학',
    name: '양자공학개론',
  },
  {
    id: '011390-001',
    school: '공과대학',
    name: '원자력공학개론1',
  },
  {
    id: '009568-001',
    school: '공과대학',
    name: '원자로열역학',
  },
  {
    id: '009002-001',
    school: '공과대학',
    name: '원자로열수력학',
  },
  {
    id: '009571-001',
    school: '공과대학',
    name: '방사선계측및실험',
  },
  {
    id: '004102-001',
    school: '공과대학',
    name: '수치해석',
  },
  {
    id: '009846-001',
    school: '공과대학',
    name: '원자력발전소구조해석',
  },
  {
    id: '010929-001',
    school: '공과대학',
    name: '원자로해석실무',
  },
  {
    id: '010930-001',
    school: '공과대학',
    name: '원자로동역학및보호계통',
  },
  {
    id: '009590-001',
    school: '공과대학',
    name: '원자력안전과물리적방호',
  },
  {
    id: '009850-001',
    school: '공과대학',
    name: '종합설계A',
  },
  {
    id: '010111-001',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-004',
    school: '공과대학',
    name: '졸업연구및진로1',
  },
  {
    id: '000806-001',
    school: '예체능대학',
    name: '기초한국화1',
  },
  {
    id: '000806-002',
    school: '예체능대학',
    name: '기초한국화1',
  },
  {
    id: '005681-001',
    school: '예체능대학',
    name: '기초회화1',
  },
  {
    id: '005681-002',
    school: '예체능대학',
    name: '기초회화1',
  },
  {
    id: '004120-001',
    school: '예체능대학',
    name: '기초소묘',
  },
  {
    id: '004120-002',
    school: '예체능대학',
    name: '기초소묘',
  },
  {
    id: '008659-001',
    school: '예체능대학',
    name: '서양미술사1',
  },
  {
    id: '000773-001',
    school: '예체능대학',
    name: '기초서양화1',
  },
  {
    id: '000773-002',
    school: '예체능대학',
    name: '기초서양화1',
  },
  {
    id: '009543-001',
    school: '예체능대학',
    name: '인물화',
  },
  {
    id: '001798-001',
    school: '예체능대학',
    name: '수묵화',
  },
  {
    id: '002398-001',
    school: '예체능대학',
    name: '유화기법1',
  },
  {
    id: '003561-001',
    school: '예체능대학',
    name: '한국미술사',
  },
  {
    id: '005105-001',
    school: '예체능대학',
    name: '컴퓨터드로잉1',
  },
  {
    id: '011236-001',
    school: '예체능대학',
    name: '공간연구',
  },
  {
    id: '002390-001',
    school: '예체능대학',
    name: '유화1',
  },
  {
    id: '002390-002',
    school: '예체능대학',
    name: '유화1',
  },
  {
    id: '004127-001',
    school: '예체능대학',
    name: '한국화1',
  },
  {
    id: '001643-001',
    school: '예체능대학',
    name: '서.현대회화',
  },
  {
    id: '003810-001',
    school: '예체능대학',
    name: '현대미술론',
  },
  {
    id: '004129-001',
    school: '예체능대학',
    name: '한.현대회화',
  },
  {
    id: '007381-001',
    school: '예체능대학',
    name: '멀티미디어와회화1',
  },
  {
    id: '007381-002',
    school: '예체능대학',
    name: '멀티미디어와회화1',
  },
  {
    id: '007843-001',
    school: '예체능대학',
    name: '미술교과교육론',
  },
  {
    id: '001629-001',
    school: '예체능대학',
    name: '서.종합실기1',
  },
  {
    id: '001629-002',
    school: '예체능대학',
    name: '서.종합실기1',
  },
  {
    id: '004747-001',
    school: '예체능대학',
    name: '한.종합실기1',
  },
  {
    id: '005764-001',
    school: '예체능대학',
    name: '졸업작품(P/NP)',
  },
  {
    id: '001634-001',
    school: '예체능대학',
    name: '서.종합실기3',
  },
  {
    id: '004748-001',
    school: '예체능대학',
    name: '한.종합실기3',
  },
  {
    id: '005624-001',
    school: '예체능대학',
    name: '사진과회화',
  },
  {
    id: '008505-001',
    school: '예체능대학',
    name: '기초패턴설계',
  },
  {
    id: '008505-002',
    school: '예체능대학',
    name: '기초패턴설계',
  },
  {
    id: '008506-001',
    school: '예체능대학',
    name: '패션디자인',
  },
  {
    id: '008506-002',
    school: '예체능대학',
    name: '패션디자인',
  },
  {
    id: '010942-001',
    school: '예체능대학',
    name: '텍스타일캡스톤디자인',
  },
  {
    id: '010942-002',
    school: '예체능대학',
    name: '텍스타일캡스톤디자인',
  },
  {
    id: '004466-001',
    school: '예체능대학',
    name: '서양복식사',
  },
  {
    id: '004744-001',
    school: '예체능대학',
    name: '모델드로잉',
  },
  {
    id: '004744-002',
    school: '예체능대학',
    name: '모델드로잉',
  },
  {
    id: '010943-001',
    school: '예체능대학',
    name: '고급패턴종합설계',
  },
  {
    id: '010943-002',
    school: '예체능대학',
    name: '고급패턴종합설계',
  },
  {
    id: '010948-001',
    school: '예체능대학',
    name: '패션과색채',
  },
  {
    id: '010948-002',
    school: '예체능대학',
    name: '패션과색채',
  },
  {
    id: '008513-001',
    school: '예체능대학',
    name: '고급패션드레이핑',
  },
  {
    id: '008513-002',
    school: '예체능대학',
    name: '고급패션드레이핑',
  },
  {
    id: '007845-001',
    school: '예체능대학',
    name: '의상교과교육론',
  },
  {
    id: '010946-001',
    school: '예체능대학',
    name: '기초니트종합설계',
  },
  {
    id: '010946-002',
    school: '예체능대학',
    name: '기초니트종합설계',
  },
  {
    id: '010947-001',
    school: '예체능대학',
    name: '디지털패션종합설계',
  },
  {
    id: '010947-002',
    school: '예체능대학',
    name: '디지털패션종합설계',
  },
  {
    id: '005764-001',
    school: '예체능대학',
    name: '졸업작품(P/NP)',
  },
  {
    id: '009941-001',
    school: '예체능대학',
    name: '창작패턴종합설계',
  },
  {
    id: '009941-002',
    school: '예체능대학',
    name: '창작패턴종합설계',
  },
  {
    id: '010015-001',
    school: '예체능대학',
    name: '패션소재기획종합설계',
  },
  {
    id: '010016-001',
    school: '예체능대학',
    name: '패션컬렉션종합설계',
  },
  {
    id: '010016-002',
    school: '예체능대학',
    name: '패션컬렉션종합설계',
  },
  {
    id: '011302-001',
    school: '예체능대학',
    name: '신입생세미나A',
  },
  {
    id: '002894-001',
    school: '예체능대학',
    name: '전공실기1',
  },
  {
    id: '004134-001',
    school: '예체능대학',
    name: '연주1',
  },
  {
    id: '004134-002',
    school: '예체능대학',
    name: '연주1',
  },
  {
    id: '004134-003',
    school: '예체능대학',
    name: '연주1',
  },
  {
    id: '010640-001',
    school: '예체능대학',
    name: '오케스트라및앙상블1',
  },
  {
    id: '010949-001',
    school: '예체능대학',
    name: '기초악전및컴퓨터사보',
  },
  {
    id: '001045-001',
    school: '예체능대학',
    name: '딕션1',
  },
  {
    id: '003647-001',
    school: '예체능대학',
    name: '합창1',
  },
  {
    id: '007140-001',
    school: '예체능대학',
    name: '현악합주1',
  },
  {
    id: '007427-001',
    school: '예체능대학',
    name: '관악합주1',
  },
  {
    id: '007706-001',
    school: '예체능대학',
    name: '피아노교수법',
  },
  {
    id: '009471-001',
    school: '예체능대학',
    name: '체임버뮤직1',
  },
  {
    id: '009471-002',
    school: '예체능대학',
    name: '체임버뮤직1',
  },
  {
    id: '009471-003',
    school: '예체능대학',
    name: '체임버뮤직1',
  },
  {
    id: '009482-001',
    school: '예체능대학',
    name: '시창청음1',
  },
  {
    id: '009482-002',
    school: '예체능대학',
    name: '시창청음1',
  },
  {
    id: '009482-003',
    school: '예체능대학',
    name: '시창청음1',
  },
  {
    id: '002112-001',
    school: '예체능대학',
    name: '연주3',
  },
  {
    id: '002112-002',
    school: '예체능대학',
    name: '연주3',
  },
  {
    id: '002112-003',
    school: '예체능대학',
    name: '연주3',
  },
  {
    id: '002902-001',
    school: '예체능대학',
    name: '전공실기3',
  },
  {
    id: '003464-001',
    school: '예체능대학',
    name: '피아노문헌1',
  },
  {
    id: '009469-001',
    school: '예체능대학',
    name: '딕션3',
  },
  {
    id: '004135-001',
    school: '예체능대학',
    name: '합창3',
  },
  {
    id: '007424-001',
    school: '예체능대학',
    name: '현악합주3',
  },
  {
    id: '007678-001',
    school: '예체능대학',
    name: '관악합주3',
  },
  {
    id: '009473-001',
    school: '예체능대학',
    name: '체임버뮤직3',
  },
  {
    id: '009473-002',
    school: '예체능대학',
    name: '체임버뮤직3',
  },
  {
    id: '009473-003',
    school: '예체능대학',
    name: '체임버뮤직3',
  },
  {
    id: '009479-001',
    school: '예체능대학',
    name: '화성법및대위법1',
  },
  {
    id: '009479-002',
    school: '예체능대학',
    name: '화성법및대위법1',
  },
  {
    id: '009479-003',
    school: '예체능대학',
    name: '화성법및대위법1',
  },
  {
    id: '009750-001',
    school: '예체능대학',
    name: '레코딩실습1',
  },
  {
    id: '009754-001',
    school: '예체능대학',
    name: '리듬연구',
  },
  {
    id: '009928-001',
    school: '예체능대학',
    name: '컴퓨터음악2',
  },
  {
    id: '009928-002',
    school: '예체능대학',
    name: '컴퓨터음악2',
  },
  {
    id: '010642-001',
    school: '예체능대학',
    name: '오케스트라및앙상블3',
  },
  {
    id: '002907-001',
    school: '예체능대학',
    name: '전공실기5',
  },
  {
    id: '004137-001',
    school: '예체능대학',
    name: '합창5',
  },
  {
    id: '004139-001',
    school: '예체능대학',
    name: '연주5',
  },
  {
    id: '004139-002',
    school: '예체능대학',
    name: '연주5',
  },
  {
    id: '004139-003',
    school: '예체능대학',
    name: '연주5',
  },
  {
    id: '001738-001',
    school: '예체능대학',
    name: '성악문헌1',
  },
  {
    id: '002455-001',
    school: '예체능대학',
    name: '음악사1',
  },
  {
    id: '007679-001',
    school: '예체능대학',
    name: '현악합주5',
  },
  {
    id: '007785-001',
    school: '예체능대학',
    name: '관악합주5',
  },
  {
    id: '007846-001',
    school: '예체능대학',
    name: '음악교과교육론',
  },
  {
    id: '009475-001',
    school: '예체능대학',
    name: '체임버뮤직5',
  },
  {
    id: '009475-002',
    school: '예체능대학',
    name: '체임버뮤직5',
  },
  {
    id: '009475-003',
    school: '예체능대학',
    name: '체임버뮤직5',
  },
  {
    id: '009486-001',
    school: '예체능대학',
    name: '관현악문헌',
  },
  {
    id: '010645-001',
    school: '예체능대학',
    name: '오케스트라및앙상블5',
  },
  {
    id: '002432-001',
    school: '예체능대학',
    name: '음악분석',
  },
  {
    id: '002432-002',
    school: '예체능대학',
    name: '음악분석',
  },
  {
    id: '002911-001',
    school: '예체능대학',
    name: '전공실기7',
  },
  {
    id: '007789-001',
    school: '예체능대학',
    name: '현악합주7',
  },
  {
    id: '008187-001',
    school: '예체능대학',
    name: '관악합주7',
  },
  {
    id: '009477-001',
    school: '예체능대학',
    name: '체임버뮤직7',
  },
  {
    id: '009477-002',
    school: '예체능대학',
    name: '체임버뮤직7',
  },
  {
    id: '009477-003',
    school: '예체능대학',
    name: '체임버뮤직7',
  },
  {
    id: '009484-001',
    school: '예체능대학',
    name: '오페라워크샾1',
  },
  {
    id: '009760-001',
    school: '예체능대학',
    name: 'DJing',
  },
  {
    id: '009930-001',
    school: '예체능대학',
    name: '반주문헌1',
  },
  {
    id: '010394-001',
    school: '예체능대학',
    name: '연주7',
  },
  {
    id: '010394-002',
    school: '예체능대학',
    name: '연주7',
  },
  {
    id: '010394-003',
    school: '예체능대학',
    name: '연주7',
  },
  {
    id: '010643-001',
    school: '예체능대학',
    name: '오케스트라및앙상블7',
  },
  {
    id: '003220-001',
    school: '예체능대학',
    name: '체육원리',
  },
  {
    id: '010952-001',
    school: '예체능대학',
    name: '기초종목실기',
  },
  {
    id: '011093-001',
    school: '예체능대학',
    name: '골프',
  },
  {
    id: '011094-001',
    school: '예체능대학',
    name: '운동과건강',
  },
  {
    id: '002552-001',
    school: '예체능대학',
    name: '인체해부학',
  },
  {
    id: '006902-001',
    school: '예체능대학',
    name: '체육철학',
  },
  {
    id: '003224-001',
    school: '예체능대학',
    name: '체육측정평가',
  },
  {
    id: '010953-001',
    school: '예체능대학',
    name: '구기스포츠',
  },
  {
    id: '002329-001',
    school: '예체능대학',
    name: '운동생리학',
  },
  {
    id: '003218-001',
    school: '예체능대학',
    name: '체육심리학',
  },
  {
    id: '001844-001',
    school: '예체능대학',
    name: '스포츠특강1',
  },
  {
    id: '006900-001',
    school: '예체능대학',
    name: '레저스포츠1',
  },
  {
    id: '007847-001',
    school: '예체능대학',
    name: '체육교과교육론',
  },
  {
    id: '005765-001',
    school: '예체능대학',
    name: '졸업시험(P/NP)',
  },
  {
    id: '007384-001',
    school: '예체능대학',
    name: '스포츠마케팅',
  },
  {
    id: '004337-001',
    school: '예체능대학',
    name: '코우치학',
  },
  {
    id: '006903-001',
    school: '예체능대학',
    name: '스포츠과학실험법',
  },
  {
    id: '010958-001',
    school: '예체능대학',
    name: '스포츠재활',
  },
  {
    id: '003768-001',
    school: '예체능대학',
    name: '현대무용기본1',
  },
  {
    id: '004495-001',
    school: '예체능대학',
    name: '발레테크닉1',
  },
  {
    id: '004497-001',
    school: '예체능대학',
    name: '워크샵1',
  },
  {
    id: '005656-001',
    school: '예체능대학',
    name: '발레레파토리1',
  },
  {
    id: '007217-001',
    school: '예체능대학',
    name: '발레기초1',
  },
  {
    id: '008823-001',
    school: '예체능대학',
    name: '모던댄스1',
  },
  {
    id: '008827-001',
    school: '예체능대학',
    name: '한국전통무용기교훈련1',
  },
  {
    id: '008829-001',
    school: '예체능대학',
    name: '한국창작무용기교훈련1',
  },
  {
    id: '008902-001',
    school: '예체능대학',
    name: '한국전통무용기본1',
  },
  {
    id: '004896-001',
    school: '예체능대학',
    name: '레파토리',
  },
  {
    id: '007550-001',
    school: '예체능대학',
    name: '전통타악실기',
  },
  {
    id: '004736-001',
    school: '예체능대학',
    name: '발레테크닉3',
  },
  {
    id: '004738-001',
    school: '예체능대학',
    name: '워크샵3',
  },
  {
    id: '005657-001',
    school: '예체능대학',
    name: '발레레파토리3',
  },
  {
    id: '008825-001',
    school: '예체능대학',
    name: '모던댄스3',
  },
  {
    id: '008834-001',
    school: '예체능대학',
    name: '전통춤기교실습1',
  },
  {
    id: '008836-001',
    school: '예체능대학',
    name: '창작춤기교실습1',
  },
  {
    id: '008842-001',
    school: '예체능대학',
    name: '동작분석',
  },
  {
    id: '008844-001',
    school: '예체능대학',
    name: '신무용기법',
  },
  {
    id: '010270-001',
    school: '예체능대학',
    name: '발레사',
  },
  {
    id: '005660-001',
    school: '예체능대학',
    name: '고급현대무용1',
  },
  {
    id: '008838-001',
    school: '예체능대학',
    name: '발레테크닉5',
  },
  {
    id: '008849-001',
    school: '예체능대학',
    name: '컨템포러리댄스1',
  },
  {
    id: '008853-001',
    school: '예체능대학',
    name: '한국전통무용안무1',
  },
  {
    id: '008855-001',
    school: '예체능대학',
    name: '한국창작무용안무1',
  },
  {
    id: '008868-001',
    school: '예체능대학',
    name: '발레레파토리5',
  },
  {
    id: '008857-001',
    school: '예체능대학',
    name: '춤과미디어',
  },
  {
    id: '008858-001',
    school: '예체능대학',
    name: '한국무용창작기법',
  },
  {
    id: '009226-001',
    school: '예체능대학',
    name: '컨템포러리발레1',
  },
  {
    id: '009228-001',
    school: '예체능대학',
    name: '발레워크샵1',
  },
  {
    id: '005661-001',
    school: '예체능대학',
    name: '고급현대무용3',
  },
  {
    id: '005764-001',
    school: '예체능대학',
    name: '졸업작품(P/NP)',
  },
  {
    id: '008840-001',
    school: '예체능대학',
    name: '발레테크닉7',
  },
  {
    id: '008851-001',
    school: '예체능대학',
    name: '컨템포러리댄스3',
  },
  {
    id: '008864-001',
    school: '예체능대학',
    name: '한국전통무용작품분석1',
  },
  {
    id: '008866-001',
    school: '예체능대학',
    name: '한국창작무용작품분석1',
  },
  {
    id: '008870-001',
    school: '예체능대학',
    name: '발레레파토리7',
  },
  {
    id: '001206-001',
    school: '예체능대학',
    name: '무용미학',
  },
  {
    id: '008872-001',
    school: '예체능대학',
    name: '무용표현심리학',
  },
  {
    id: '009230-001',
    school: '예체능대학',
    name: '캐릭터발레1',
  },
  {
    id: '011215-001',
    school: '예체능대학',
    name: '무용교육프로그램개발',
  },
  {
    id: '005627-001',
    school: '예체능대학',
    name: '영화개론',
  },
  {
    id: '005627-002',
    school: '예체능대학',
    name: '영화개론',
  },
  {
    id: '007034-001',
    school: '예체능대학',
    name: '무대매커니즘1',
  },
  {
    id: '008673-001',
    school: '예체능대학',
    name: '스토리텔링',
  },
  {
    id: '008674-001',
    school: '예체능대학',
    name: '영상표현기초',
  },
  {
    id: '008675-001',
    school: '예체능대학',
    name: '연극의이해',
  },
  {
    id: '008675-002',
    school: '예체능대학',
    name: '연극의이해',
  },
  {
    id: '009976-001',
    school: '예체능대학',
    name: '기초연기1(근육과감각훈련)',
  },
  {
    id: '009977-001',
    school: '예체능대학',
    name: '개별창의연구1',
  },
  {
    id: '010970-001',
    school: '예체능대학',
    name: '호흡과발성1',
  },
  {
    id: '004522-001',
    school: '예체능대학',
    name: '작품분석',
  },
  {
    id: '006171-001',
    school: '예체능대학',
    name: '촬영조명1',
  },
  {
    id: '007285-001',
    school: '예체능대학',
    name: '세계연극사',
  },
  {
    id: '007285-002',
    school: '예체능대학',
    name: '세계연극사',
  },
  {
    id: '010054-001',
    school: '예체능대학',
    name: '텍스트와연기실습1',
  },
  {
    id: '010056-001',
    school: '예체능대학',
    name: '공연프로덕션실습1',
  },
  {
    id: '006174-001',
    school: '예체능대학',
    name: '영화제작WS1',
  },
  {
    id: '008692-001',
    school: '예체능대학',
    name: '뮤지컬넘버플레이1',
  },
  {
    id: '010053-001',
    school: '예체능대학',
    name: '편집',
  },
  {
    id: '010972-001',
    school: '예체능대학',
    name: '신체언어훈련1',
  },
  {
    id: '004725-001',
    school: '예체능대학',
    name: '다큐영화제작',
  },
  {
    id: '008687-001',
    school: '예체능대학',
    name: '동양영화사',
  },
  {
    id: '004732-001',
    school: '예체능대학',
    name: '영화제작WS3',
  },
  {
    id: '007848-001',
    school: '예체능대학',
    name: '연극영화교과교육론',
  },
  {
    id: '008700-001',
    school: '예체능대학',
    name: '영화기술고급',
  },
  {
    id: '010050-001',
    school: '예체능대학',
    name: '화술트레이닝2',
  },
  {
    id: '010058-001',
    school: '예체능대학',
    name: '연기실습콜라보레이션1',
  },
  {
    id: '005764-001',
    school: '예체능대학',
    name: '졸업작품(P/NP)',
  },
  {
    id: '006177-001',
    school: '예체능대학',
    name: '영화제작WS5',
  },
  {
    id: '008695-001',
    school: '예체능대학',
    name: '장편영화기획',
  },
  {
    id: '008696-001',
    school: '예체능대학',
    name: '공연제작Project1',
  },
  {
    id: '010059-001',
    school: '예체능대학',
    name: '영화장르연구',
  },
  {
    id: '010061-001',
    school: '예체능대학',
    name: '다중매체연기연구',
  },
  {
    id: '009600-001',
    school: '대학',
    name: '헌법1',
  },
  {
    id: '009608-001',
    school: '대학',
    name: '형법총론',
  },
  {
    id: '008711-001',
    school: '대학',
    name: '상행위법',
  },
  {
    id: '008715-001',
    school: '대학',
    name: '법학적성평가연습1',
  },
  {
    id: '009602-001',
    school: '대학',
    name: '민법총칙',
  },
  {
    id: '009604-001',
    school: '대학',
    name: '채권총론',
  },
  {
    id: '003706-001',
    school: '대학',
    name: '행정법1',
  },
  {
    id: '009607-001',
    school: '대학',
    name: '형사소송법',
  },
  {
    id: '008724-001',
    school: '대학',
    name: '노동법',
  },
  {
    id: '009975-001',
    school: '대학',
    name: '금융법입문',
  },
  {
    id: '008726-001',
    school: '대학',
    name: '불법행위법',
  },
  {
    id: '010111-001',
    school: '대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '대학',
    name: '졸업연구및진로1',
  },
  {
    id: '011204-001',
    school: '대학',
    name: '공정거래법',
  },
  {
    id: '010605-001',
    school: '연계전공',
    name: '디자인씽킹',
  },
  {
    id: '010065-001',
    school: '연계전공',
    name: '창업기업의성장과재무',
  },
  {
    id: '010610-001',
    school: '연계전공',
    name: '사업계획서',
  },
  {
    id: '010981-001',
    school: '연계전공',
    name: '실전창업동아리3',
  },
  {
    id: '009715-001',
    school: '연계전공',
    name: 'ES-문화예술과ICT',
  },
  {
    id: '009730-001',
    school: '연계전공',
    name: 'ES-창업을위한디지털패션디자인',
  },
  {
    id: '009729-001',
    school: '연계전공',
    name: 'ES-엔터테인먼트SW프로젝트',
  },
  {
    id: '010086-001',
    school: '연계전공',
    name: 'GMSW-NLE영상편집',
  },
  {
    id: '010504-001',
    school: '연계전공',
    name: 'GMSW-미디어네트워크분석',
  },
  {
    id: '010483-001',
    school: '연계전공',
    name: 'GMSW-글로벌시장과일본문화콘텐츠',
  },
  {
    id: '007330-001',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '007330-002',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '007330-003',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '007330-004',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '009912-001',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-002',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-003',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-004',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-005',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '011076-001',
    school: '연계전공',
    name: '인공지능기초수학',
  },
  {
    id: '011113-001',
    school: '연계전공',
    name: '빅데이터로보는세상',
  },
  {
    id: '011113-002',
    school: '연계전공',
    name: '빅데이터로보는세상',
  },
  {
    id: '011251-001',
    school: '연계전공',
    name: 'K-MOOC:모두를위한머신러닝',
  },
  {
    id: '004119-001',
    school: '공과대학',
    name: '건축학개론',
  },
  {
    id: '004275-001',
    school: '공과대학',
    name: '서양건축사',
  },
  {
    id: '006157-001',
    school: '공과대학',
    name: '스튜디오1',
  },
  {
    id: '006157-002',
    school: '공과대학',
    name: '스튜디오1',
  },
  {
    id: '006157-003',
    school: '공과대학',
    name: '스튜디오1',
  },
  {
    id: '006157-004',
    school: '공과대학',
    name: '스튜디오1',
  },
  {
    id: '006157-005',
    school: '공과대학',
    name: '스튜디오1',
  },
  {
    id: '006776-001',
    school: '공과대학',
    name: '건축디지털디자인1',
  },
  {
    id: '006776-002',
    school: '공과대학',
    name: '건축디지털디자인1',
  },
  {
    id: '006776-003',
    school: '공과대학',
    name: '건축디지털디자인1',
  },
  {
    id: '011280-001',
    school: '공과대학',
    name: '표현과매체',
  },
  {
    id: '011280-002',
    school: '공과대학',
    name: '표현과매체',
  },
  {
    id: '011280-003',
    school: '공과대학',
    name: '표현과매체',
  },
  {
    id: '006154-001',
    school: '공과대학',
    name: '건축환경개론',
  },
  {
    id: '006481-001',
    school: '공과대학',
    name: '스튜디오3',
  },
  {
    id: '006481-002',
    school: '공과대학',
    name: '스튜디오3',
  },
  {
    id: '006481-003',
    school: '공과대학',
    name: '스튜디오3',
  },
  {
    id: '006481-004',
    school: '공과대학',
    name: '스튜디오3',
  },
  {
    id: '006577-001',
    school: '공과대학',
    name: '건축법제도',
  },
  {
    id: '007828-001',
    school: '공과대학',
    name: '건축시공및관리',
  },
  {
    id: '011679-001',
    school: '인문과학대학',
    name: '한국어회화연습',
  },
  {
    id: '011681-001',
    school: '인문과학대학',
    name: '한국어청취연습',
  },
  {
    id: '011682-001',
    school: '인문과학대학',
    name: '한국어독해연습',
  },
  {
    id: '011745-001',
    school: '인문과학대학',
    name: '시장경제의원리',
  },
  {
    id: '011121-001',
    school: '연계전공',
    name: '금융보험애널리틱스2',
  },
  {
    id: '011020-001',
    school: '연계전공',
    name: '융합캡스톤디자인4',
  },
  {
    id: '011021-001',
    school: '연계전공',
    name: '무대디자인과메커니즘',
  },
  {
    id: '011224-001',
    school: '연계전공',
    name: '디지털문화유산',
  },
  {
    id: '011326-001',
    school: '연계전공',
    name: '문화유산활용세미나',
  },
  {
    id: '011227-001',
    school: '연계전공',
    name: '디지털큐레이션전공인턴쉽1',
  },
  {
    id: '010748-001',
    school: '연계전공',
    name: '럭셔리브랜드큐레이션',
  },
  {
    id: '011007-001',
    school: '연계전공',
    name: '가죽제품설계',
  },
  {
    id: '011010-001',
    school: '연계전공',
    name: '럭셔리브랜드스튜디오',
  },
  {
    id: '010992-001',
    school: '연계전공',
    name: '스토리텔링기획론',
  },
  {
    id: '010994-001',
    school: '연계전공',
    name: '문화홍보기획론',
  },
  {
    id: '010998-001',
    school: '연계전공',
    name: '문화수용자연구',
  },
  {
    id: '010999-001',
    school: '연계전공',
    name: '대중문화연구',
  },
  {
    id: '011346-001',
    school: '전자정보공학대학',
    name: '연구실인턴',
  },
  {
    id: '011346-002',
    school: '전자정보공학대학',
    name: '연구실인턴',
  },
  {
    id: '004114-001',
    school: '전자정보공학대학',
    name: '전기회로',
  },
  {
    id: '010571-001',
    school: '전자정보공학대학',
    name: '디지털회로설계',
  },
  {
    id: '011347-001',
    school: '전자정보공학대학',
    name: '반도체재료공학',
  },
  {
    id: '011348-001',
    school: '전자정보공학대학',
    name: '확률및랜덤프로세스',
  },
  {
    id: '007330-001',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '009912-001',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-002',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '008802-001',
    school: '사회과학대학',
    name: '법학입문',
  },
  {
    id: '011029-001',
    school: '연계전공',
    name: 'BA 빅데이터통계분석론',
  },
  {
    id: '011029-002',
    school: '연계전공',
    name: 'BA 빅데이터통계분석론',
  },
  {
    id: '011032-001',
    school: '연계전공',
    name: 'BA 웹스크레이핑빅데이터분석',
  },
  {
    id: '010113-001',
    school: '연계전공',
    name: 'SM-소셜미디어개론',
  },
  {
    id: '010114-001',
    school: '연계전공',
    name: 'SM-소셜미디어마케팅',
  },
  {
    id: '010120-001',
    school: '연계전공',
    name: 'SM-소셜웹프로그래밍',
  },
  {
    id: '007330-001',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '009912-001',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-002',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '006646-001',
    school: '자연과학대학',
    name: '해석학개론1',
  },
  {
    id: '007645-001',
    school: '자연과학대학',
    name: '선형대수학1',
  },
  {
    id: '007645-002',
    school: '자연과학대학',
    name: '선형대수학1',
  },
  {
    id: '011273-001',
    school: '자연과학대학',
    name: '계산수학1',
  },
  {
    id: '003064-001',
    school: '자연과학대학',
    name: '조합론',
  },
  {
    id: '003064-002',
    school: '자연과학대학',
    name: '조합론',
  },
  {
    id: '004081-001',
    school: '자연과학대학',
    name: '전산통계실습',
  },
  {
    id: '004299-001',
    school: '자연과학대학',
    name: '현대대수학1',
  },
  {
    id: '003421-001',
    school: '자연과학대학',
    name: '표본조사론',
  },
  {
    id: '004029-001',
    school: '자연과학대학',
    name: '회귀분석1',
  },
  {
    id: '004102-001',
    school: '자연과학대학',
    name: '수치해석',
  },
  {
    id: '004102-002',
    school: '자연과학대학',
    name: '수치해석',
  },
  {
    id: '004302-001',
    school: '자연과학대학',
    name: '수리통계학1',
  },
  {
    id: '004302-002',
    school: '자연과학대학',
    name: '수리통계학1',
  },
  {
    id: '010880-001',
    school: '자연과학대학',
    name: '기계학습',
  },
  {
    id: '011122-001',
    school: '생명과학대학',
    name: '분자세포생물학및실험1',
  },
  {
    id: '004281-001',
    school: '생명과학대학',
    name: '유기화학',
  },
  {
    id: '009954-001',
    school: '생명과학대학',
    name: '알고리즘및실습',
  },
  {
    id: '011123-001',
    school: '생명과학대학',
    name: '식물생명과학및실습',
  },
  {
    id: '011124-001',
    school: '생명과학대학',
    name: '수산생물학및실험',
  },
  {
    id: '011126-001',
    school: '생명과학대학',
    name: '융합학문위한분석화학',
  },
  {
    id: '011135-001',
    school: '생명과학대학',
    name: '천연물화학및실험1',
  },
  {
    id: '011139-001',
    school: '생명과학대학',
    name: '종자생명산업과학및실습2',
  },
  {
    id: '011140-001',
    school: '생명과학대학',
    name: '농식품산업ICT융복합전략',
  },
  {
    id: '009267-001',
    school: '생명과학대학',
    name: '빅데이터분석',
  },
  {
    id: '010111-001',
    school: '생명과학대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010629-001',
    school: '연계전공',
    name: 'ST-데이터분석및시각화',
  },
  {
    id: '009155-001',
    school: '연계전공',
    name: '유전체학',
  },
  {
    id: '011222-001',
    school: '연계전공',
    name: '시스템생명공학캡스톤디자인Ⅰ',
  },
  {
    id: '011095-001',
    school: '연계전공',
    name: '에듀테크콘텐츠개발',
  },
  {
    id: '011097-001',
    school: '연계전공',
    name: 'EduTechCA캡스톤디자인',
  },
  {
    id: '010704-001',
    school: '연계전공',
    name: '디지털필름메이킹1',
  },
  {
    id: '010704-002',
    school: '연계전공',
    name: '디지털필름메이킹1',
  },
  {
    id: '011229-001',
    school: '연계전공',
    name: '모션그래픽스1:원리',
  },
  {
    id: '011229-002',
    school: '연계전공',
    name: '모션그래픽스1:원리',
  },
  {
    id: '011229-003',
    school: '연계전공',
    name: '모션그래픽스1:원리',
  },
  {
    id: '011231-001',
    school: '연계전공',
    name: '3D모션디자인',
  },
  {
    id: '011231-002',
    school: '연계전공',
    name: '3D모션디자인',
  },
  {
    id: '010727-001',
    school: '연계전공',
    name: '영상디자인스튜디오1',
  },
  {
    id: '011101-001',
    school: '연계전공',
    name: '문화현장실습',
  },
  {
    id: '011213-001',
    school: '연계전공',
    name: '예술융합캡스톤디자인',
  },
  {
    id: '004510-001',
    school: '공과대학',
    name: '고체역학',
  },
  {
    id: '004714-001',
    school: '공과대학',
    name: '열역학',
  },
  {
    id: '011360-001',
    school: '공과대학',
    name: '우주항공입문',
  },
  {
    id: '007330-001',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '007330-002',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '007330-003',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '009912-001',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-002',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-003',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-004',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009952-001',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '009952-002',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '011259-001',
    school: '소프트웨어융합대학',
    name: '기계학습개론',
  },
  {
    id: '011259-002',
    school: '소프트웨어융합대학',
    name: '기계학습개론',
  },
  {
    id: '006237-001',
    school: '소프트웨어융합대학',
    name: '웹프로그래밍',
  },
  {
    id: '009959-001',
    school: '소프트웨어융합대학',
    name: '확률통계및프로그래밍',
  },
  {
    id: '011170-001',
    school: '소프트웨어융합대학',
    name: '인공지능수학1',
  },
  {
    id: '011261-001',
    school: '소프트웨어융합대학',
    name: '딥러닝개론',
  },
  {
    id: '001823-001',
    school: '소프트웨어융합대학',
    name: '수치해석',
  },
  {
    id: '006132-001',
    school: '소프트웨어융합대학',
    name: '영상처리',
  },
  {
    id: '007219-001',
    school: '소프트웨어융합대학',
    name: '데이터베이스',
  },
  {
    id: '011173-001',
    school: '소프트웨어융합대학',
    name: '자연어처리',
  },
  {
    id: '011262-001',
    school: '소프트웨어융합대학',
    name: '인공지능과사이버보안',
  },
  {
    id: '009960-001',
    school: '소프트웨어융합대학',
    name: 'Capstone디자인(산학협력프로젝트)',
  },
  {
    id: '010111-001',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-002',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010111-003',
    school: '소프트웨어융합대학',
    name: '졸업연구및진로1',
  },
  {
    id: '010238-001',
    school: '소프트웨어융합대학',
    name: '딥러닝시스템',
  },
  {
    id: '011181-001',
    school: '소프트웨어융합대학',
    name: '강화학습',
  },
  {
    id: '006770-001',
    school: '연계전공',
    name: '전기전자공학개론',
  },
  {
    id: '007330-001',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '007330-002',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '009912-001',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-002',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-003',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-004',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-001',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009952-001',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '009952-002',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '009952-003',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '009952-004',
    school: '소프트웨어융합대학',
    name: '자료구조및실습',
  },
  {
    id: '009961-001',
    school: '소프트웨어융합대학',
    name: '선형대수및프로그래밍',
  },
  {
    id: '009961-002',
    school: '소프트웨어융합대학',
    name: '선형대수및프로그래밍',
  },
  {
    id: '009961-003',
    school: '소프트웨어융합대학',
    name: '선형대수및프로그래밍',
  },
  {
    id: '009961-004',
    school: '소프트웨어융합대학',
    name: '선형대수및프로그래밍',
  },
  {
    id: '010224-001',
    school: '소프트웨어융합대학',
    name: '창의SW기초설계',
  },
  {
    id: '010224-002',
    school: '소프트웨어융합대학',
    name: '창의SW기초설계',
  },
  {
    id: '010224-003',
    school: '소프트웨어융합대학',
    name: '창의SW기초설계',
  },
  {
    id: '010224-004',
    school: '소프트웨어융합대학',
    name: '창의SW기초설계',
  },
  {
    id: '004114-001',
    school: '소프트웨어융합대학',
    name: '전기회로',
  },
  {
    id: '004114-002',
    school: '소프트웨어융합대학',
    name: '전기회로',
  },
  {
    id: '004118-001',
    school: '소프트웨어융합대학',
    name: '디지털시스템',
  },
  {
    id: '004118-002',
    school: '소프트웨어융합대학',
    name: '디지털시스템',
  },
  {
    id: '004642-001',
    school: '소프트웨어융합대학',
    name: '동역학',
  },
  {
    id: '004642-002',
    school: '소프트웨어융합대학',
    name: '동역학',
  },
  {
    id: '008621-001',
    school: '소프트웨어융합대학',
    name: 'MATLAB프로그래밍',
  },
  {
    id: '005119-001',
    school: '인공지능융합대학',
    name: '만화기초1',
  },
  {
    id: '005119-002',
    school: '인공지능융합대학',
    name: '만화기초1',
  },
  {
    id: '008785-001',
    school: '인공지능융합대학',
    name: '애니메이션기초1',
  },
  {
    id: '008785-002',
    school: '인공지능융합대학',
    name: '애니메이션기초1',
  },
  {
    id: '008785-003',
    school: '인공지능융합대학',
    name: '애니메이션기초1',
  },
  {
    id: '010306-001',
    school: '인공지능융합대학',
    name: '2D디자인',
  },
  {
    id: '010306-002',
    school: '인공지능융합대학',
    name: '2D디자인',
  },
  {
    id: '010307-001',
    school: '인공지능융합대학',
    name: '3D디자인',
  },
  {
    id: '010307-002',
    school: '인공지능융합대학',
    name: '3D디자인',
  },
  {
    id: '011302-001',
    school: '인공지능융합대학',
    name: '신입생세미나A',
  },
  {
    id: '011302-002',
    school: '인공지능융합대학',
    name: '신입생세미나A',
  },
  {
    id: '007330-001',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '007330-002',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '007330-003',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '007330-004',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '007330-005',
    school: '인공지능융합대학',
    name: '확률및통계',
  },
  {
    id: '009912-001',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-002',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-003',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-004',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-005',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-006',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-007',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '009912-008',
    school: '인공지능융합대학',
    name: 'C프로그래밍및실습',
  },
  {
    id: '011360-001',
    school: '공과대학',
    name: '우주항공입문',
  },
  {
    id: '008764-001',
    school: '공과대학',
    name: '군사학개론',
  },
  {
    id: '011378-001',
    school: '공과대학',
    name: '비행기초역학1',
  },
  {
    id: '004714-001',
    school: '공과대학',
    name: '열역학',
  },
  {
    id: '009530-001',
    school: '공과대학',
    name: '관숙비행',
  },
];

export default courseList;
